
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаОтбора.Использование  = Истина;
    ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	СписокСтатусов = Новый СписокЗначений; 	
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.НаПодходе);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Выгружен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ГотовКВывозу);
    СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Вывезен); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Доставлен);
	
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВРаботе);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВПорту);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыходИзПорта);
	
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов;  
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Контейнеры.ТТН"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Контейнеры.ПеревозчикВозвратВовремя"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПуть(Ссыл)
	
	Возврат Ссыл.ПутьКПапке;
	
КонецФункции
