
&ИзменениеИКонтроль("НомерОбъектаБезПрефикса")
Функция ЛГС_НомерОбъектаБезПрефикса(Знач НомерОбъекта)

	НомерОбъекта = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(СокрЛП(НомерОбъекта), Истина, Истина);
	
	#Вставка
	НомерОбъекта = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъектаПлатежки(СокрЛП(НомерОбъекта), Истина, Истина);
	#КонецВставки
	НомерОбъекта = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(НомерОбъекта);

	Возврат НомерОбъекта;

КонецФункции
