
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаНаКонтрагента") Тогда
		
		Если ЗначениеЗаполнено(Параметры.СсылкаНаКонтрагента) Тогда
			
			Элементы.Контрагент.Видимость = Ложь;
			
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент"); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  			
			ЭлементОтбора.ПравоеЗначение = Параметры.СсылкаНаКонтрагента; 
			
			СсылкаНаКонтрагента = Параметры.СсылкаНаКонтрагента;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюДоверенность(Команда)
	
	ПараметрыНовогоЭлемента = Новый Структура("СсылкаНаКонтрагента", СсылкаНаКонтрагента);
	
	ОткрытьФорму("Документ.ДоверенностьОтКлиента.Форма.ФормаДокумента", ПараметрыНовогоЭлемента);
	
КонецПроцедуры
