
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаСкд = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();  
	ПараметрыДанных = Настройки.ПараметрыДанных; 
	Параметры = СформироватьПараметрыОтчета(ПараметрыДанных);
	
	ТЗ_Начисления = СформироватьТаблицуНачислений();
	
	МенеджерВТ = ЗапросПрофитПоСделкам(Параметры);
	                                                        
	ЗаполнитьТаблицуЗначенийДаннымиПоОтделам(ТЗ_Начисления, Параметры, МенеджерВТ); 
	
	Если НЕ (РольДоступна("ОтчетПоКомиссииПросмотрВсехСотрудников") ИЛИ РольДоступна("АдминистраторСистемы")) Тогда
		ОтобратьТаблицуТаблицаПоСотруднику(ТЗ_Начисления);	
	КонецЕсли;
	
	КомпановщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпановщикМакета.Выполнить(СхемаСкд, Настройки, ДанныеРасшифровки);
	
	ВнешнийНаборДанных = Новый Структура("тзНачисления", ТЗ_Начисления); 
	
	ПроцессорКД = новый ПроцессорКомпоновкиДанных; 
	ПроцессорКД.Инициализировать(МакетКД, ВнешнийНаборДанных, ДанныеРасшифровки); 
	
	ПроцессорВывода = новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКД, истина);
	
КонецПроцедуры 

#Область СлужебныеПроцедурыИФункции

Процедура ОтобратьТаблицуТаблицаПоСотруднику(ТЗ_Начисления)
	
	ТЗ_СОтборомПоСотруднику = СформироватьТаблицуНачислений();
	
	Для каждого Строка Из ТЗ_Начисления Цикл
	
		Если Строка.Сотрудник = Пользователи.ТекущийПользователь() Тогда
			НоваяСтрока = ТЗ_СОтборомПоСотруднику.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;	
	
	КонецЦикла;
	
	ТЗ_Начисления = ТЗ_СОтборомПоСотруднику;
		
КонецПроцедуры

Функция СформироватьПараметрыОтчета(ПараметрыДанных)
	
	Параметры = Новый Структура();
	
	Период = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;  
	Параметры.Вставить("НачалоПериода", Период.ДатаНачала);
	Параметры.Вставить("КонецПериода", Период.ДатаОкончания); 
	
	Возврат Параметры;
	
КонецФункции

Функция СформироватьТаблицуНачислений()
	
	ТЗ_Начисления = Новый ТаблицаЗначений; 
	
	ОписаниеТиповСотрудник = Новый Массив(); 
	ОписаниеТиповСотрудник.Добавить(Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ОписаниеТиповСотрудник.Добавить(Новый ОписаниеТипов("Строка"));
	
	ТЗ_Начисления.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов(ОписаниеТиповСотрудник,,,, Новый КвалификаторыСтроки(100)));
	ТЗ_Начисления.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты")); 
	ТЗ_Начисления.Колонки.Добавить("КонтрагентНаименование", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	ТЗ_Начисления.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
	ТЗ_Начисления.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ_Начисления.Колонки.Добавить("Профит", Новый ОписаниеТипов("Число"));
	ТЗ_Начисления.Колонки.Добавить("Премия", Новый ОписаниеТипов("Число"));
	ТЗ_Начисления.Колонки.Добавить("Отдел", Новый ОписаниеТипов("СправочникСсылка.ОтделыОрганизаций")); 
	ТЗ_Начисления.Колонки.Добавить("ТипПремииСлуж", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	ТЗ_Начисления.Колонки.Добавить("СуммаАктРеализации", Новый ОписаниеТипов("Число"));
	ТЗ_Начисления.Колонки.Добавить("СуммаАктПоступление", Новый ОписаниеТипов("Число")); 
	
	Возврат ТЗ_Начисления;                 
	
КонецФункции 

Процедура ЗаполнитьТаблицуЗначенийДаннымиПоОтделам(ТЗ_Начисления, Параметры, МенеджерВТ)
	
	РезультатЗапросаНастройкиОтчета = ЗапросНастройкиОтчета(Параметры);
	ВыборкаНастройкиОтчета = РезультатЗапросаНастройкиОтчета.Выбрать();
	
	Пока ВыборкаНастройкиОтчета.Следующий() Цикл
		
		ПараметрыОтбора = ВыборкаНастройкиОтчета.ХранилищеОтбора.Получить();   
		РезультатЗапросаПрофитПоОтделу = ЗапросПрофитПоОтделу(ПараметрыОтбора, ВыборкаНастройкиОтчета, МенеджерВТ);
		
		ВыборкаИтог = РезультатЗапросаПрофитПоОтделу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаИтог.Следующий();
		
		Выборка = ВыборкаИтог.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрТЗ = ТЗ_Начисления.Добавить();
			
			Если ВыборкаНастройкиОтчета.ДляРуководителя Тогда
				СтрТЗ.Сотрудник =  " Руководитель отдела";
			Иначе	
				СтрТЗ.Сотрудник = Выборка.Менеджер;
			КонецЕсли;
			
			Если ПараметрыОтбора.ВариантыРасчетаКомиссии = "Процент" Тогда   
				
				Если ПараметрыОтбора.ОтЧегоПроцент = Перечисления.БазаДляРасчетаКомиссии.СуммаПрофита Тогда
					БазаКомиссии = Выборка.ПрофитПоАктам;
					БазаОбщаяСумма = ВыборкаИтог.ПрофитПоАктам;
				ИначеЕсли ПараметрыОтбора.ОтЧегоПроцент = Перечисления.БазаДляРасчетаКомиссии.СуммаПродаж Тогда	
					БазаКомиссии = Выборка.ПрофитПоАктам; 
					БазаОбщаяСумма = ВыборкаИтог.СуммаАктаИсходящего;
				КонецЕсли;                      
				
				Если ПараметрыОтбора.Свойство("РазмерПроцентаКомисси") Тогда
					ПроцентКомиссии = ПараметрыОтбора.РазмерПроцентаКомисси
				ИначеЕсли ПараметрыОтбора.Свойство("ПороговыеЗначенияДляПроцента") Тогда
					ПроцентКомиссии = ПолучитьПороговоеЗначение(БазаОбщаяСумма, ПараметрыОтбора.ПороговыеЗначенияДляПроцента);
					ПроцентКомиссии = ?(ПроцентКомиссии = Неопределено, 0, ПроцентКомиссии);
				КонецЕсли;   
				
				Если ПараметрыОтбора.НадбавкаЗаПервичнуюСделку > 0 Тогда
					
					НомерСделки	= ПолучитьНомерСделки(Выборка.Сделка);
					
					Если НомерСделки = 1 Тогда
						ПроцентКомиссии = ПроцентКомиссии + ПараметрыОтбора.НадбавкаЗаПервичнуюСделку;
					Иначе
						ПроцентКомиссии = ПроцентКомиссии;	
					КонецЕсли;
							
				КонецЕсли;
				
				СтрТЗ.Премия = Выборка.ПрофитПоАктам * ПроцентКомиссии / 100;    
				
			ИначеЕсли ПараметрыОтбора.ВариантыРасчетаКомиссии = "ФиксированнаяСумма" Тогда 
				
				Если ПараметрыОтбора.ОтделОрганизации.Наименование = "Сертификация" Тогда
					Количество = Выборка.КоличествоСертификатов;	
				Иначе	
					Количество = Выборка.Количество;	
				КонецЕсли;
				
				ФиксированнаяСумма = 0;
				Если ПараметрыОтбора.Свойство("РазмерФиксированнойСуммы") Тогда
					ФиксированнаяСумма = ПараметрыОтбора.РазмерФиксированнойСуммы
				ИначеЕсли ПараметрыОтбора.Свойство("ПороговыеЗначенияДляФиксированнойСуммы") Тогда
					ФиксированнаяСумма = ПолучитьПороговоеЗначение(Количество, ПараметрыОтбора.ПороговыеЗначенияДляФиксированнойСуммы);
				КонецЕсли;	
				
				СтрТЗ.Премия = Количество * ФиксированнаяСумма;
				
			КонецЕсли;
			
			СтрТЗ.Профит = Выборка.ПрофитПоАктам;
			СтрТЗ.Сделка = Выборка.Сделка; 
			СтрТЗ.Номенклатура = Выборка.Номенклатура;
			СтрТЗ.Контрагент = Выборка.Контрагент; 
			СтрТЗ.КонтрагентНаименование = Выборка.КонтрагентНаименование;
			СтрТЗ.Отдел = ВыборкаНастройкиОтчета.Отдел;
			СтрТЗ.ТипПремииСлуж = ""; 
			СтрТЗ.СуммаАктРеализации = Выборка.СуммаАктаИсходящего;
			СтрТЗ.СуммаАктПоступление = Выборка.СуммаАктаВходящего;

		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗапросПрофитПоОтделу(ПараметрыОтбора, ЗаписьРегистра, МенеджерВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ВТ_ИтоговыеДанные.СуммаАктаВходящего, 0)) КАК СуммаАктаВходящего,
	|	СУММА(ЕСТЬNULL(ВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0)) КАК СуммаАктаИсходящего,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ ВТ_ИтоговыеДанные.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|		ИНАЧЕ ВТ_ИтоговыеДанные.Сделка
	|	КОНЕЦ КАК Сделка,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		ИНАЧЕ ВТ_ИтоговыеДанные.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ИтоговыеДанные.Ответственный
	|	КОНЕЦ КАК Ответственный,
	|	СУММА(ЕСТЬNULL(ВТ_ИтоговыеДанные.ПрофитПоАктам, 0)) КАК ПрофитПоАктам,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА ""Таможенные декларации""
	|		ИНАЧЕ ВТ_ИтоговыеДанные.КонтрагентНаименование
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	СУММА(ЕСТЬNULL(ВТ_ИтоговыеДанные.Количество, 0)) КАК Количество,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ИтоговыеДанные.ОтветственныйНаименование
	|	КОНЕЦ КАК ОтветственныйНаименование,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ИтоговыеДанные.СделкаДата
	|	КОНЕЦ КАК СделкаДата,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ИтоговыеДанные.НомерСделки
	|	КОНЕЦ КАК НомерСделки,
	|	ВТ_ИтоговыеДанные.Сделка.МенеджерПоТаможне КАК Менеджер,
	|	СУММА(ЕСТЬNULL(ВТ_ИтоговыеДанные.КоличествоСертификатов, 0)) КАК КоличествоСертификатов
	|ИЗ
	|	ВТ_ИтоговыеДанные КАК ВТ_ИтоговыеДанные
	|ГДЕ
	|	(&ОтборПоНоменклатуре = ЛОЖЬ
	|			ИЛИ ВТ_ИтоговыеДанные.Номенклатура В (&НоменклатураОтбор))
	|	И (&ОтборПоВидуСделки = ЛОЖЬ
	|			ИЛИ ВТ_ИтоговыеДанные.Сделка.Вид В (&ВидыСделокОтбор))
	|	И (&ОтборПоМенеджеру = ЛОЖЬ
	|			ИЛИ НЕ ВТ_ИтоговыеДанные.Сделка.МенеджерПоТаможне В (&МенеджерыОтбор))
	|	И ВТ_ИтоговыеДанные.Сделка ССЫЛКА Документ.Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ ВТ_ИтоговыеДанные.Номенклатура
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|		ИНАЧЕ ВТ_ИтоговыеДанные.Сделка
	|	КОНЕЦ,
	|	ВТ_ИтоговыеДанные.Сделка.МенеджерПоТаможне,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ИтоговыеДанные.ОтветственныйНаименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ИтоговыеДанные.СделкаДата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ИтоговыеДанные.НомерСделки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ИтоговыеДанные.Ответственный
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		ИНАЧЕ ВТ_ИтоговыеДанные.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СгруппироватьНоменклатуру
	|			ТОГДА ""Таможенные декларации""
	|		ИНАЧЕ ВТ_ИтоговыеДанные.КонтрагентНаименование
	|	КОНЕЦ
	|ИТОГИ
	|	СУММА(СуммаАктаВходящего),
	|	СУММА(СуммаАктаИсходящего),
	|	СУММА(ПрофитПоАктам),
	|	СУММА(Количество),
	|	СУММА(КоличествоСертификатов)
	|ПО
	|	ОБЩИЕ";  
	
	Запрос.УстановитьПараметр("СгруппироватьНоменклатуру", ЗаписьРегистра.СгруппироватьНоменклатуру);
	Если ПараметрыОтбора.Свойство("НоменклатураДляОтобора") Тогда
		Запрос.УстановитьПараметр("НоменклатураОтбор", ПараметрыОтбора.НоменклатураДляОтобора.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("ОтборПоНоменклатуре", ЗаписьРегистра.ЗависитОтНоменклатуры);  
	Иначе
		Запрос.УстановитьПараметр("НоменклатураОтбор", "");
		Запрос.УстановитьПараметр("ОтборПоНоменклатуре", ЗаписьРегистра.ЗависитОтНоменклатуры); 	
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ВидыСделокДляОтбора") Тогда
		Запрос.УстановитьПараметр("ВидыСделокОтбор", ПараметрыОтбора.ВидыСделокДляОтбора.ВыгрузитьКолонку("ВидСделки"));
		Запрос.УстановитьПараметр("ОтборПоВидуСделки", ЗаписьРегистра.ЗависитОтВидаСделки);
	Иначе
		Запрос.УстановитьПараметр("ВидыСделокОтбор", "");
		Запрос.УстановитьПараметр("ОтборПоВидуСделки", ЗаписьРегистра.ЗависитОтВидаСделки);	
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("МенеджерыДляОтбора") Тогда
		Запрос.УстановитьПараметр("МенеджерыОтбор", ПараметрыОтбора.МенеджерыДляОтбора.ВыгрузитьКолонку("Менеджер"));
		Запрос.УстановитьПараметр("ОтборПоМенеджеру", ЗаписьРегистра.ОтборПоМенеджерам);
	Иначе                                                                         
		Запрос.УстановитьПараметр("МенеджерыОтбор", "");
		Запрос.УстановитьПараметр("ОтборПоМенеджеру", ЗаписьРегистра.ОтборПоМенеджерам);
	КонецЕсли;
	
	Если ПараметрыОтбора.Менеджер = Перечисления.ВидыМенеджеровНачислениеКомиссии.МенеджерПоРаботеСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделка.МенеджерПоТаможне", "Сделка.МенеджерПоРаботеСКлиентами");
	ИначеЕсли ПараметрыОтбора.Менеджер = Перечисления.ВидыМенеджеровНачислениеКомиссии.МенеджерПоПродажам Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделка.МенеджерПоТаможне", "Сделка.Менеджер");	
	КонецЕсли;  
	
	РезультатЗапроса = Запрос.Выполнить();	 
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ЗапросНастройкиОтчета(Параметры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних.Отдел КАК Отдел,
	|	НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних.ДляРуководителя КАК ДляРуководителя,
	|	НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних.ЗависитОтНоменклатуры КАК ЗависитОтНоменклатуры,
	|	НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних.ПроцентЗависитОтПороговогоЗначения КАК ПроцентЗависитОтПороговогоЗначения,
	|	НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних.ЗависитОтВидаСделки КАК ЗависитОтВидаСделки,
	|	НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних.ФиксированнаяСуммаЗависитОтПороговогоЗначения КАК ФиксированнаяСуммаЗависитОтПороговогоЗначения,
	|	НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних.ХранилищеОтбора КАК ХранилищеОтбора,
	|	НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних.ОтборПоМенеджерам КАК ОтборПоМенеджерам,
	|	НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних.СгруппироватьНоменклатуру КАК СгруппироватьНоменклатуру
	|ИЗ
	|	РегистрСведений.НачислениеКомиссииМенеджерамНастройкиОтчета.СрезПоследних(, ) КАК НачислениеКомиссииМенеджерамНастройкиОтчетаСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;

КонецФункции

Функция ПолучитьПороговоеЗначение(ОбщаяСумма, ПороговыеЗначения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПороговыеЗначения.От КАК От,
	|	ПороговыеЗначения.Значение КАК Значение
	|ПОМЕСТИТЬ ВтПороговыеЗначения
	|ИЗ
	|	&ПороговыеЗначения КАК ПороговыеЗначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПороговыеЗначения.От КАК От,
	|	МИНИМУМ(ЕСТЬNULL(ВтПороговыеЗначения1.От, 999999999999999)) КАК До,
	|	ВтПороговыеЗначения.Значение КАК Значение
	|ПОМЕСТИТЬ ВтЗначенияОтИДо
	|ИЗ
	|	ВтПороговыеЗначения КАК ВтПороговыеЗначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПороговыеЗначения КАК ВтПороговыеЗначения1
	|		ПО ВтПороговыеЗначения.От < ВтПороговыеЗначения1.От
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтПороговыеЗначения.От,
	|	ВтПороговыеЗначения.Значение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВтЗначенияОтИДо.Значение КАК Значение
	|ИЗ
	|	ВтЗначенияОтИДо КАК ВтЗначенияОтИДо
	|ГДЕ
	|	ВтЗначенияОтИДо.От <= &ОбщаяСумма
	|	И ВтЗначенияОтИДо.До >= &ОбщаяСумма";
	
	Запрос.УстановитьПараметр("ОбщаяСумма", ОбщаяСумма);
	Запрос.УстановитьПараметр("ПороговыеЗначения", ПороговыеЗначения); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Значение;
	
КонецФункции 

Функция ПолучитьНомерСделки(Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Сделка.Ссылка) КАК Номер,
	|	Сделка.Контрагент КАК Контрагент,
	|	Сделка.Вид КАК Вид
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.Дата <= &Дата
	|	И Сделка.Контрагент = &Контрагент
	|	И Сделка.Вид = &Вид
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделка.Контрагент,
	|	Сделка.Вид
	|";
	Запрос.УстановитьПараметр("Дата",Сделка.Дата);
	Запрос.УстановитьПараметр("Контрагент",Сделка.Контрагент);
	Запрос.УстановитьПараметр("Вид",Сделка.Вид);  
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Результат.Пустой() Тогда
		НомерСделки = 1;
	Иначе	
		Выборка.Следующий();
		НомерСделки = Выборка.Номер;
	КонецЕсли;
	
	Возврат НомерСделки;
	
КонецФункции

Функция ЗапросПрофитПоСделкам(Параметры)
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	ПониженнаяСтавкаНДС = УчетНДС.ПрименяетсяПониженнаяСтавкаНДС(ОсновнаяОрганизация, ТекущаяДата());
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;                     
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПрофитаСделки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Вт_ОтборНоменклатура
	|ИЗ
	|	РегистрСведений.НоменклатураПрофитаСделки КАК НоменклатураПрофитаСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сделка.Ссылка КАК Сделка,
	|	Сделка.Контрагент КАК Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделка_1.Ссылка) КАК Номер
	|ПОМЕСТИТЬ ВТ_НомераСделок
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка_1
	|		ПО Сделка.МоментВремени >= Сделка_1.МоментВремени
	|			И Сделка.Контрагент = Сделка_1.Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделка.Контрагент,
	|	Сделка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Акт КАК Акт,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	|	ВложенныйЗапрос.Сделка КАК Сделка,
	|	ВложенныйЗапрос.Счет КАК Счет,
	|	СУММА(ВложенныйЗапрос.СуммаНДСАкта) КАК СуммаНДСАкта,
	|	СУММА(ВложенныйЗапрос.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата КАК ДатаПоступленияНаРС
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РеализацияТоваровУслугТовары.Ссылка КАК Акт,
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|					ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|				КОНЕЦ) КАК СуммаБезНДСАкта,
	|			РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
	|			РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
	|			СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА РеализацияТоваровУслугТовары.Сумма
	|					ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	|				КОНЕЦ) КАК СуммаСНДСАкта,
	|			СУММА(РеализацияТоваровУслугТовары.Сумма) КАК СуммаАкта,
	|			РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|			СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	|			ИСТИНА КАК ОтборПоВидуСделки
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ГДЕ
	|			РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугТовары.Ссылка,
	|			РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|			РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|			РеализацияТоваровУслугТовары.Номенклатура
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			РеализацияТоваровУслугУслуги.Ссылка,
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	|					ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|				КОНЕЦ),
	|			РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|			РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|			СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|					ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|				КОНЕЦ),
	|			СУММА(РеализацияТоваровУслугУслуги.Сумма),
	|			РеализацияТоваровУслугУслуги.Номенклатура,
	|			СУММА(РеализацияТоваровУслугУслуги.Количество),
	|			ИСТИНА
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ГДЕ
	|			РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугУслуги.Ссылка,
	|			РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|			РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|			РеализацияТоваровУслугУслуги.Номенклатура
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	|					ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	|				КОНЕЦ),
	|			РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|			РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|			СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
	|			СУММА(ВЫБОР
	|					КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
	|					ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	|				КОНЕЦ),
	|			СУММА(РеализацияТоваровУслугАгентскиеУслуги.Сумма),
	|			РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	|			СУММА(РеализацияТоваровУслугАгентскиеУслуги.Количество),
	|			ИСТИНА
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	|		ГДЕ
	|			РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	|			РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|			РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|			РеализацияТоваровУслугАгентскиеУслуги.Номенклатура
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			СделкаВнутренниеДоходы.НаименованиеДохода,
	|			СУММА(СделкаВнутренниеДоходы.Сумма),
	|			СделкаВнутренниеДоходы.Ссылка,
	|			СделкаВнутренниеДоходы.Ссылка,
	|			0,
	|			СУММА(СделкаВнутренниеДоходы.Сумма),
	|			СУММА(СделкаВнутренниеДоходы.Сумма),
	|			NULL,
	|			NULL,
	|			ЛОЖЬ
	|		ИЗ
	|			Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	|		ГДЕ
	|			СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СделкаВнутренниеДоходы.НаименованиеДохода,
	|			СделкаВнутренниеДоходы.Ссылка,
	|			СделкаВнутренниеДоходы.Ссылка
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ОтчетКомитентуОПродажахТовары.Ссылка,
	|			СУММА(ВЫБОР
	|					КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	|					ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	|				КОНЕЦ),
	|			ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	|			ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	|			СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
	|			СУММА(ВЫБОР
	|					КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
	|					ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
	|				КОНЕЦ),
	|			СУММА(ОтчетКомитентуОПродажахТовары.Сумма),
	|			ОтчетКомитентуОПродажахТовары.Номенклатура,
	|			СУММА(ОтчетКомитентуОПродажахТовары.Количество),
	|			ИСТИНА
	|		ИЗ
	|			Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ГДЕ
	|			ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	|			ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	|			ОтчетКомитентуОПродажахТовары.Ссылка,
	|			ОтчетКомитентуОПродажахТовары.Номенклатура) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
	|			ПО ВложенныйЗапрос.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
	|		ПО (ВложенныйЗапрос.Счет = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетНаОплату)
	|			И (ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Акт,
	|	ВложенныйЗапрос.Сделка,
	|	ВложенныйЗапрос.Счет,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Номенклатура КАК Номенклатура,
	|	ВТ_Реализации.Сделка КАК Сделка,
	|	ВТ_Реализации.Счет КАК Счет,
	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый,
	|	СУММА(ЕСТЬNULL(ВТ_Реализации.Количество, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(ВТ_Реализации.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	|	СУММА(ЕСТЬNULL(ВТ_Реализации.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	|	СУММА(ЕСТЬNULL(ВТ_Реализации.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	|	СтатусыДокументов.Статус КАК Статус,
	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО,
	|	ВТ_Реализации.ДатаПоступленияНаРС КАК ДатаПоступленияНаРС
	|ПОМЕСТИТЬ ВТ_Исходящие
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	|		ПО ВТ_Реализации.Сделка.Вид = ВидыРасходовСделки.ВидСделки
	|			И ВТ_Реализации.Номенклатура = ВидыРасходовСделки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|		ПО ВТ_Реализации.Счет = СтатусыДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
	|		ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВТ_Реализации.Акт)
	|ГДЕ
	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Номенклатура,
	|	ВТ_Реализации.Сделка,
	|	ВидыРасходовСделки.Перевыставляемый,
	|	СтатусыДокументов.Статус,
	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО,
	|	ВТ_Реализации.Счет,
	|	ВТ_Реализации.ДатаПоступленияНаРС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Акт КАК Акт,
	|	ВложенныйЗапрос.Счет КАК Счет,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	|	ВложенныйЗапрос.Сделка КАК Сделка,
	|	СУММА(ВложенныйЗапрос.СуммаНДСАкта) КАК СуммаНДСАкта,
	|	СУММА(ВложенныйЗапрос.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Акт,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ) КАК СуммаБезНДСАкта,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика КАК Счет,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|				ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|			КОНЕЦ) КАК СуммаНДСАкта,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	|					КОНЕЦ
	|			КОНЕЦ) КАК СуммаСНДСАкта,
	|		ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|		СУММА(0) КАК Количество,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	|					КОНЕЦ
	|			КОНЕЦ) КАК СуммаАкта,
	|		ИСТИНА КАК ОтборПоВидуСделки
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	|				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	|	ГДЕ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугУслуги.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СделкаВнутренниеРасходы.НаименованиеРасхода,
	|		СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	|		NULL,
	|		СделкаВнутренниеРасходы.Ссылка,
	|		СУММА(0),
	|		СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	|		NULL,
	|		СУММА(0),
	|		СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	|		ЛОЖЬ
	|	ИЗ
	|		Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	|	ГДЕ
	|		СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СделкаВнутренниеРасходы.НаименованиеРасхода,
	|		СделкаВнутренниеРасходы.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|				ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ПоступлениеТоваровУслугТовары.Номенклатура,
	|		СУММА(0),
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ИСТИНА
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	|				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	|	ГДЕ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугТовары.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|				ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура,
	|		СУММА(0),
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ИСТИНА
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	|				И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	|	ГДЕ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОперацияБух.Ссылка,
	|		СУММА(ХозрасчетныйДвиженияССубконто.Сумма),
	|		NULL,
	|		ОперацияБух.Сделка.Ссылка,
	|		СУММА(0),
	|		СУММА(ХозрасчетныйДвиженияССубконто.Сумма),
	|		NULL,
	|		СУММА(0),
	|		СУММА(ХозрасчетныйДвиженияССубконто.Сумма),
	|		ИСТИНА
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК ХозрасчетныйДвиженияССубконто
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияБух КАК ОперацияБух
	|			ПО ХозрасчетныйДвиженияССубконто.Регистратор = ОперацияБух.Ссылка
	|	ГДЕ
	|		ОперацияБух.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОперацияБух.Ссылка,
	|		ОперацияБух.Сделка.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
	|		ПО ВложенныйЗапрос.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Акт,
	|	ВложенныйЗапрос.Счет,
	|	ВложенныйЗапрос.Сделка,
	|	ВложенныйЗапрос.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Поступления.Номенклатура КАК Номенклатура,
	|	ВТ_Поступления.Сделка КАК Сделка,
	|	ВТ_Поступления.Счет КАК Счет,
	|	СУММА(ЕСТЬNULL(ВТ_Поступления.Количество, 0)) КАК Количество,
	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый,
	|	СУММА(ЕСТЬNULL(ВТ_Поступления.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	|	СУММА(ЕСТЬNULL(ВТ_Поступления.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	|	СУММА(ЕСТЬNULL(ВТ_Поступления.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	|	СтатусыДокументов.Статус КАК Статус,
	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО
	|ПОМЕСТИТЬ ВТ_Входящие
	|ИЗ
	|	ВТ_Поступления КАК ВТ_Поступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	|		ПО ВТ_Поступления.Сделка.Вид = ВидыРасходовСделки.ВидСделки
	|			И ВТ_Поступления.Номенклатура = ВидыРасходовСделки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|		ПО ВТ_Поступления.Счет = СтатусыДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
	|		ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВТ_Поступления.Акт.Ссылка)
	|ГДЕ
	|	(СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО ЕСТЬ NULL
	|			ИЛИ СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Поступления.Сделка,
	|	ВТ_Поступления.Номенклатура,
	|	ВидыРасходовСделки.Перевыставляемый,
	|	СтатусыДокументов.Статус,
	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО,
	|	ВТ_Поступления.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка) КАК Сделка,
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент) КАК Контрагент,
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный) КАК Ответственный,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА &ПониженнаяСтавкаНДС
	|					ТОГДА ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта, 0) - ЕСТЬNULL(ВТ_Входящие.СуммаСНДСАкта, 0) - ВЫБОР
	|							КОГДА ВТ_Исходящие.Перевыставляемый ЕСТЬ NULL
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(ВЫБОР
	|										КОГДА ВТ_Исходящие.Перевыставляемый
	|											ТОГДА 0
	|										ИНАЧЕ ВТ_Исходящие.СуммаНДСАкта
	|									КОНЕЦ, 0)
	|						КОНЕЦ
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта, 0) - ЕСТЬNULL(ВТ_Входящие.СуммаБезНДСАкта, 0)
	|			КОНЕЦ, 0)) КАК ПрофитПоАктам,
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент.Наименование, ВТ_Входящие.Сделка.Контрагент.Наименование) КАК КонтрагентНаименование,
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный.Наименование, ВТ_Входящие.Сделка.Ответственный.Наименование) КАК ОтветственныйНаименование,
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Дата, ВТ_Входящие.Сделка.Дата) КАК СделкаДата,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА &ПониженнаяСтавкаНДС
	|					ТОГДА ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта, 0) - ВЫБОР
	|							КОГДА ВТ_Исходящие.Перевыставляемый ЕСТЬ NULL
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(ВЫБОР
	|										КОГДА ВТ_Исходящие.Перевыставляемый
	|											ТОГДА 0
	|										ИНАЧЕ ВТ_Исходящие.СуммаНДСАкта
	|									КОНЕЦ, 0)
	|						КОНЕЦ
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта, 0)
	|			КОНЕЦ, 0)) КАК СуммаАктаИсходящего,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА &ПониженнаяСтавкаНДС
	|					ТОГДА ЕСТЬNULL(ВТ_Входящие.СуммаСНДСАкта, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_Входящие.СуммаБезНДСАкта, 0)
	|			КОНЕЦ, 0)) КАК СуммаАктаВходящего,
	|	СУММА(ВТ_Исходящие.Количество) КАК Количество
	|ПОМЕСТИТЬ ИВТ_ПрофитПоСделкам
	|ИЗ
	|	ВТ_Входящие КАК ВТ_Входящие
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Исходящие КАК ВТ_Исходящие
	|		ПО ВТ_Входящие.Сделка = ВТ_Исходящие.Сделка
	|			И ВТ_Входящие.Номенклатура = ВТ_Исходящие.Номенклатура
	|ГДЕ
	|	ВТ_Исходящие.ДатаПоступленияНаРС МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура),
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка),
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент),
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный),
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент.Наименование, ВТ_Входящие.Сделка.Контрагент.Наименование),
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный.Наименование, ВТ_Входящие.Сделка.Ответственный.Наименование),
	|	ЕСТЬNULL(ВТ_Исходящие.Сделка.Дата, ВТ_Входящие.Сделка.Дата)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИВТ_ПрофитПоСделкам.Номенклатура КАК Номенклатура,
	|	ИВТ_ПрофитПоСделкам.Сделка КАК Сделка,
	|	ИВТ_ПрофитПоСделкам.Контрагент КАК Контрагент,
	|	ИВТ_ПрофитПоСделкам.Ответственный КАК Ответственный,
	|	ИВТ_ПрофитПоСделкам.ПрофитПоАктам КАК ПрофитПоАктам,
	|	ИВТ_ПрофитПоСделкам.КонтрагентНаименование КАК КонтрагентНаименование,
	|	ИВТ_ПрофитПоСделкам.ОтветственныйНаименование КАК ОтветственныйНаименование,
	|	ИВТ_ПрофитПоСделкам.СделкаДата КАК СделкаДата,
	|	ВТ_НомераСделок.Номер КАК НомерСделки,
	|	ИВТ_ПрофитПоСделкам.Сделка.Менеджер КАК МенеджерПоПродажам,
	|	ИВТ_ПрофитПоСделкам.Сделка.МенеджерПоТаможне КАК МенеджерПоТаможне,
	|	ИВТ_ПрофитПоСделкам.Количество КАК Количество,
	|	ИВТ_ПрофитПоСделкам.СуммаАктаИсходящего КАК СуммаАктаИсходящего,
	|	ИВТ_ПрофитПоСделкам.СуммаАктаВходящего КАК СуммаАктаВходящего,
	|	ИВТ_ПрофитПоСделкам.Сделка.КоличествоСертификатов КАК КоличествоСертификатов
	|ПОМЕСТИТЬ ВТ_ИтоговыеДанные
	|ИЗ
	|	ИВТ_ПрофитПоСделкам КАК ИВТ_ПрофитПоСделкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераСделок КАК ВТ_НомераСделок
	|		ПО ИВТ_ПрофитПоСделкам.Сделка = ВТ_НомераСделок.Сделка";
	
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода); 
	Запрос.УстановитьПараметр("ПониженнаяСтавкаНДС", ПониженнаяСтавкаНДС);
	
	Запрос.Выполнить();
	
	Возврат МенеджерВТ;	
	
КонецФункции      

#КонецОбласти
