
Процедура ПриЗаписи(Отказ)
	
	НЗ = РегистрыСведений.ДанныеДоверенностейКлиентовДляВыводаВСписках.СоздатьНаборЗаписей();
	
	НЗ.Отбор.ДоверенностьКлиента.Установить(ЭтотОбъект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись ИЗ НЗ Цикл
			
			Запись.ДоверенностьКлиента = ЭтотОбъект.Ссылка;
			
			СтруктураПараметров = РассчитатьПоказателиДляВыводаВСписках();
			
			Запись.Контрагент = СтруктураПараметров.Контрагент;
			Запись.Линия = СтруктураПараметров.Линия;
			Запись.Грузополучатель = СтруктураПараметров.Грузополучатель;
			
		КонецЦикла;
		
	НЗ.Записать();	
		
	Иначе
		
		Запись = РегистрыСведений.ДанныеДоверенностейКлиентовДляВыводаВСписках.СоздатьМенеджерЗаписи(); 
		
		Запись.ДоверенностьКлиента = ЭтотОбъект.Ссылка; 
		
		СтруктураПараметров = РассчитатьПоказателиДляВыводаВСписках();
		
		Запись.Контрагент = СтруктураПараметров.Контрагент;
		Запись.Линия = СтруктураПараметров.Линия;
		Запись.Грузополучатель = СтруктураПараметров.Грузополучатель;
		
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры  

Функция РассчитатьПоказателиДляВыводаВСписках() 
		
	Строка = Новый Структура;
	Строка.Вставить("Контрагент");
	Строка.Вставить("Линия");
	Строка.Вставить("Грузополучатель");
	
	КонтрагентСтр = "";
	Линия = "";
	ГрузополучательСтр = "";
	
	Для Каждого Стр Из ЭтотОбъект.Доверенности Цикл
		
		Если Стр.НомерСтроки = 1 Тогда
			
			КонтрагентСтр = Строка(Стр.Контрагент);
			
			ГрузополучательСтр = Строка(Стр.Грузополучатель);
			
		Иначе
			
			КонтрагентСтр = КонтрагентСтр + Символы.ПС + Строка(Стр.Контрагент);
			
			ГрузополучательСтр = ГрузополучательСтр + Символы.ПС + Строка(Стр.Грузополучатель);	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Стр Из ЭтотОбъект.Линии Цикл
		
		Если Стр.НомерСтроки = 1 Тогда	
			
			Линия = Строка(Стр.Линия);
			
		Иначе
			
			Линия = Линия + Символы.ПС + Строка(Стр.Линия);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Строка.Контрагент = КонтрагентСтр;
	Строка.Линия = Линия;
	Строка.Грузополучатель = ГрузополучательСтр; 
	
	Возврат Строка;

КонецФункции
