
&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("Клиент", Клиент);
	СтруктураОповещения.Вставить("ПортОтгрузки", ПортОтгрузки);
	СтруктураОповещения.Вставить("ПортПрибытия", ПортПрибытия);
	СтруктураОповещения.Вставить("ТипКонтейнера", ТипКонтейнера); 
	СтруктураОповещения.Вставить("АгентЛинии", АгентЛинии);
	СтруктураОповещения.Вставить("ВидТранспорта", ВидТранспорта);
	СтруктураОповещения.Вставить("РазмерКонтейнера", РазмерКонтейнера);
	СтруктураОповещения.Вставить("Груз", Груз);
	СтруктураОповещения.Вставить("Грузополучатель", Грузополучатель);
	СтруктураОповещения.Вставить("Демередж", Демередж);
	СтруктураОповещения.Вставить("КоличествоГрузовыхМест", КоличествоГрузовыхМест);
	СтруктураОповещения.Вставить("Линия", Линия);
	СтруктураОповещения.Вставить("НаправлениеКонтейнеров", НаправлениеКонтейнеров);
	СтруктураОповещения.Вставить("ПеревозчикиКонтейнеров", ПеревозчикиКонтейнеров);
	СтруктураОповещения.Вставить("ПрипортовойТерминал", ПрипортовойТерминал);
	СтруктураОповещения.Вставить("РежимВывоза", РежимВывоза);
	СтруктураОповещения.Вставить("Судно", Судно);
	СтруктураОповещения.Вставить("ТерминальнаяОбработка", ТерминальнаяОбработка);
	СтруктураОповещения.Вставить("УсловиеПоставки", УсловиеПоставки);
	СтруктураОповещения.Вставить("Фрахт", Фрахт);
	
	СтруктураОповещения.Вставить("СсылкаНаСделку", СсылкаНаСделку);
	СтруктураОповещения.Вставить("КопированиеСделки", Истина);
	
	ЭтаФорма.Закрыть();
	
	Оповестить("ВыбраныПараметрыКопированияСделки", СтруктураОповещения, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаНаСделку") Тогда
		
		Если ЗначениеЗаполнено(Параметры.СсылкаНаСделку) Тогда
			
			СсылкаНаСделку = Параметры.СсылкаНаСделку;
			
		КонецЕсли; 
		
	КонецЕсли;  
	
КонецПроцедуры
