
// Основная функция регистрации активности
Функция РегистрацияАктивностиПользователя(ДатаВремяАктивности, АктивныйЭлемент) Экспорт
	
	ТекДата = ТекущаяДата();
	
	ЗавершитьСеанс = Ложь;  
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	ТаймаутСекунд = Константы.ТаймаутПользователя.Получить();  
	
	ЗапросЧастногоТаймаута = Новый Запрос;
	ЗапросЧастногоТаймаута.Текст = "ВЫБРАТЬ
	                               |	ТаймаутыПользователей.ТаймаутСекунд КАК ТаймаутСекунд
	                               |ИЗ
	                               |	РегистрСведений.ТаймаутыПользователей КАК ТаймаутыПользователей
	                               |ГДЕ
	                               |	ТаймаутыПользователей.Пользователь = &Пользователь
	                               |	И ТаймаутыПользователей.Активно = ИСТИНА";
	
	ЗапросЧастногоТаймаута.УстановитьПараметр("Пользователь", ТекущийПользователь); 
	ВыборкаЧастногоТаймаута = ЗапросЧастногоТаймаута.Выполнить().Выбрать();
	
	Если ВыборкаЧастногоТаймаута.Следующий() Тогда
		
		ТаймаутСекунд = ВыборкаЧастногоТаймаута.ТаймаутСекунд;
		
	КонецЕсли;
	
	Если ТаймаутСекунд = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	// Колупаев М.Б. 30.07.2026. ID 6458
	"ВЫБРАТЬ
	|	АктивностьПользователейСрезПоследних.Пользователь КАК Пользователь,
	|	АктивностьПользователейСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.АктивностьПользователей.СрезПоследних(, Пользователь = &Пользователь) КАК АктивностьПользователейСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктивностьПользователейСрезПоследних.Период";
	
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Период = Null Тогда
			
			ПоследнийПериодАктивности = ТекДата; 
			
		Иначе  
			
			ПоследнийПериодАктивности = Выборка.Период;
			
		КонецЕсли;
		
	Иначе  
		
		ПоследнийПериодАктивности = ТекДата;
		
		//Сначала очистим регистр, чтобы была одна запись
		НЗ = РегистрыСведений.АктивностьПользователей.СоздатьНаборЗаписей();
		НЗ.Отбор.Пользователь.Установить(ТекущийПользователь);
		НЗ.Записать();
		
		//Записываем последний период активности и активный элемент
		
		МЗ = РегистрыСведений.АктивностьПользователей.СоздатьМенеджерЗаписи();
		МЗ.Период = ДатаВремяАктивности;
		МЗ.Пользователь = ТекущийПользователь;
		МЗ.АктивныйЭлемент = АктивныйЭлемент;
		МЗ.Записать();
		
	КонецЕсли;  
	
	Если ПоследнийПериодАктивности < ДатаВремяАктивности Тогда	
		
		//Сначала очистим регистр, чтобы была одна запись
		НЗ = РегистрыСведений.АктивностьПользователей.СоздатьНаборЗаписей();
		НЗ.Отбор.Пользователь.Установить(ТекущийПользователь);
		НЗ.Записать();
		
		//Записываем последний период активности и активный элемент
		
		МЗ = РегистрыСведений.АктивностьПользователей.СоздатьМенеджерЗаписи();
		МЗ.Период = ДатаВремяАктивности;
		МЗ.Пользователь = ТекущийПользователь;
		МЗ.АктивныйЭлемент = АктивныйЭлемент;
		МЗ.Записать();
		
	Иначе
		
		
		Простой = ТекДата - ПоследнийПериодАктивности; // Простой в секундах
		
		Если Простой > ТаймаутСекунд Тогда
			
			ЗавершитьСеанс = Истина;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	Возврат ЗавершитьСеанс; 
	
КонецФункции

Функция ПолучитьПредыдущееЗначениеТекущегоЭлемента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АктивностьПользователейСрезПоследних.АктивныйЭлемент КАК АктивныйЭлемент
	|ИЗ
	|	РегистрСведений.АктивностьПользователей.СрезПоследних(, Пользователь = &Пользователь) КАК АктивностьПользователейСрезПоследних";
	
	Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.АктивныйЭлемент;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции