
&НаКлиенте
Процедура Выгрузить(Команда)
				
			Если Объект.ВидыФайлов.Количество()>0 Тогда
				
				СтруктураВозврата = ПолучитьФайлыНаСервере();
				
				РасширениеПодключено = Истина;
				
				#Если ВебКлиент Тогда
					
					ПодключитьРасширениеРаботыСФайламиНаКлиенте(Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Истина, СтруктураВозврата.МассивФайлов));
					
				#КонецЕсли
				
				#Если НЕ ВебКлиент Тогда
				
				Если СтруктураВозврата.МассивФайлов.Количество() > 0 Тогда
											
						Попытка
							
							СсылкаНаФайл = ПолучитьСсылкуНаФайл(СтруктураВозврата.МассивФайлов);
							
							Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
								
								ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
								
								Возврат; 
								
							КонецЕсли;
							
							ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
							ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
							ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
							
							
							НачатьПолучениеФайлаССервера(СсылкаНаФайл, "Документы по сделкам.zip", ПараметрыДиалогаПолученияФайлов);
							
						Исключение	
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
							Сообщение.Сообщить();  
							
						КонецПопытки;
											
				КонецЕсли;
					
				#КонецЕсли					
												
				Если СтруктураВозврата.МассивОтсутствующихФайлов.Количество() > 0 ИЛИ СтруктураВозврата.МассивФайлов.Количество() > 0 Тогда
					
					КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("СписокФайловСделок");
					
					КоллекцияПечатныхФорм[0].ТабличныйДокумент = ЗаполнитьТабличныйДокументСпискаФайловСделок(СтруктураВозврата.МассивОтсутствующихФайлов, СтруктураВозврата.МассивФайлов); 
					
					КоллекцияПечатныхФорм[0].Экземпляров = 1;
					
					КоллекцияПечатныхФорм[0].СинонимМакета = "Список файлов сделок"; 
					
					Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
						
						УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект); 
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Не выбрано ни одного вида файла", 0, "Ошибка при выгрузке");	
				
			КонецЕсли;
						
КонецПроцедуры  

&НаКлиенте
Процедура ПослеПодключенияРасширения(Подключено, ДопПараметры) Экспорт
	
	Если Подключено Тогда
		
		Попытка
			
			СсылкаНаФайл = ПолучитьСсылкуНаФайл(ДопПараметры.МассивФайлов);
			
			Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
				
				ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
				
				Возврат; 
				
			КонецЕсли;
			
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
			
			
			НачатьПолучениеФайлаССервера(СсылкаНаФайл, "Документы по сделкам.zip", ПараметрыДиалогаПолученияФайлов);
			
		Исключение	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
			Сообщение.Сообщить();  
			
		КонецПопытки;	
		
	ИначеЕсли ДопПараметры.УстановитьЕслиНеПодключено Тогда
		
		НачатьУстановкуРасширенияРаботыСФайлами(
            Новый ОписаниеОповещения(
                "ПодключитьРасширениеРаботыСФайламиНаКлиенте",
                ЭтотОбъект,
                Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Ложь, ДопПараметры.МассивФайлов)));
		
	Иначе
		
		ПоказатьПредупреждение( , НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодключитьРасширениеРаботыСФайламиНаКлиенте(ДопПараметры) Экспорт
	
	ОповещениеОПодключенииРасширенияРаботыСФайлами = Новый ОписаниеОповещения("ПослеПодключенияРасширения", ЭтотОбъект, ДопПараметры);
	
	НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеОПодключенииРасширенияРаботыСФайлами);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаФайл(МассивФайлов)
		
	ЗаписьZIP = Новый ЗаписьZipФайла(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip",,,,,);	
	
	Для Каждого СтрФайл Из МассивФайлов Цикл
				
		ДвоичныеДанныеФайла = СтрФайл.ДвоичныеДанные;
		ДвоичныеДанныеФайла.Записать(СтрФайл.ИмяФайла);	
		
		ЗаписьZIP.Добавить(СтрФайл.ИмяФайла, РежимСохраненияПутейZIP.СохранятьПолныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
				
	КонецЦикла;   
		
	ЗаписьZIP.Записать(); 
	
	Для Каждого СтрФайл Из МассивФайлов Цикл 
		
		УдалитьФайлы(СтрФайл.ИмяФайла);
		
		УдалитьФайлы(СтрФайл.ПутьФайла);
		
	КонецЦикла;
	
	Файл = Новый Файл(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip");  
	
	Если Файл.Существует() Тогда  
		
        Данные = Новый ДвоичныеДанные(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip");  
		
		СсылкаНаФайл = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
		
		УдалитьФайлы(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip"); 
		
        Возврат СсылкаНаФайл;
		
	Иначе
		
        Возврат Неопределено;
		
    КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьФайлыНаСервере()
	
	МассивОтсутствующихФайлов = Новый Массив;
	МассивФайлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Сделка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.Проведен = ИСТИНА
	|	И Сделка.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ответственный) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И Сделка.Ответственный = &Ответственный";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.Период.ДатаНачала); 
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Ответственный", ЭтотОбъект.Ответственный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого СтрВидФайла Из Объект.ВидыФайлов Цикл
			
			ЗапросФайла = Новый Запрос;
			
			ЗапросФайла.Текст = "ВЫБРАТЬ
			|	СделкаПрисоединенныеФайлы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
			|ГДЕ
			|	СделкаПрисоединенныеФайлы.ВидФайла = &ВидФайла
			|	И СделкаПрисоединенныеФайлы.ВладелецФайла = &Сделка
			|	И СделкаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
			ЗапросФайла.УстановитьПараметр("ВидФайла", СтрВидФайла.ВидФайла);
			ЗапросФайла.УстановитьПараметр("Сделка", Выборка.Ссылка);
			
			ВыборкаФайла = ЗапросФайла.Выполнить().Выгрузить();
			
			Если ВыборкаФайла.Количество()>0 Тогда
				
				Если ВыборкаФайла.Количество()>1 Тогда
					
					НумераторДокумента = 1;
					
					Для Каждого СтрВыборкаФайла Из ВыборкаФайла Цикл
						
						ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(СтрВыборкаФайла.Ссылка);
						ИмяФайла = Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделка №" + Выборка.Ссылка.Номер + " от " + Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy") + "\" + Строка(СтрВыборкаФайла.Ссылка.ВидФайла) + Строка(НумераторДокумента) + "." + СтрВыборкаФайла.Ссылка.Расширение;
						
						ПутьФайла = Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделка №" + Выборка.Ссылка.Номер + " от " + Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy");
						
						НумераторДокумента = НумераторДокумента + 1;
						
						СтруктураФайла = Новый Структура;
						СтруктураФайла.Вставить("ДвоичныеДанные", ДвоичныеДанныеФайла);
						СтруктураФайла.Вставить("ИмяФайла", ИмяФайла);
						СтруктураФайла.Вставить("ПутьФайла", ПутьФайла);
						СтруктураФайла.Вставить("ВидФайла", Строка(СтрВыборкаФайла.Ссылка.ВидФайла));
						СтруктураФайла.Вставить("Сделка", Выборка.Ссылка);
						
						МассивФайлов.Добавить(СтруктураФайла);
						
					КонецЦикла;   
					
				Иначе  
					
					Для Каждого СтрВыборкаФайла ИЗ ВыборкаФайла Цикл
						
						ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(СтрВыборкаФайла.Ссылка);
						ИмяФайла = Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделка №" + Выборка.Ссылка.Номер + " от " + Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy") + "\" + Строка(СтрВыборкаФайла.Ссылка.ВидФайла) + "." + СтрВыборкаФайла.Ссылка.Расширение;
						 
						ПутьФайла = Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделка №" + Выборка.Ссылка.Номер + " от " + Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy");
						
						СтруктураФайла = Новый Структура;
						СтруктураФайла.Вставить("ДвоичныеДанные", ДвоичныеДанныеФайла);
						СтруктураФайла.Вставить("ИмяФайла", ИмяФайла);
						СтруктураФайла.Вставить("ПутьФайла", ПутьФайла);
						СтруктураФайла.Вставить("ВидФайла", Строка(СтрВыборкаФайла.Ссылка.ВидФайла));
						СтруктураФайла.Вставить("Сделка", Выборка.Ссылка);
						
						МассивФайлов.Добавить(СтруктураФайла);
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				Структ = Новый Структура;
				
				Структ.Вставить("Сделка", Выборка.Ссылка);
				Структ.Вставить("ВидФайла", СтрВидФайла.ВидФайла);
				
				МассивОтсутствующихФайлов.Добавить(Структ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивФайлов", МассивФайлов);
	СтруктураВозврата.Вставить("МассивОтсутствующихФайлов", МассивОтсутствующихФайлов);
	
	Возврат СтруктураВозврата;
	
КонецФункции      

&НаСервере
Функция ЗаполнитьТабличныйДокументСпискаФайловСделок(МассивОтсутствующихФайлов, МассивВыгруженныхФайлов)

	ТабДок = Новый ТабличныйДокумент;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ВыгрузкаФайловСделокЗаПериод.МакетСпискаФайлов");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОбластьШапка);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВыгруженныеВидыФайлов");
	ТЗ.Колонки.Добавить("ОтсутствующиеВидыФайлов");
	ТЗ.Колонки.Добавить("Сделка");
	
	Для Каждого Стр Из МассивВыгруженныхФайлов Цикл
		
		ПараметрыОтбора = Новый Структура("Сделка", Стр.Сделка);
		
		НайденныеСтроки = ТЗ.НайтиСтроки(ПараметрыОтбора); 
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Если НайденныеСтроки[0].ВыгруженныеВидыФайлов = Неопределено Тогда
				
				НайденныеСтроки[0].ВыгруженныеВидыФайлов = Строка(Стр.ВидФайла);
				
			Иначе	
				
				НайденныеСтроки[0].ВыгруженныеВидыФайлов = НайденныеСтроки[0].ВыгруженныеВидыФайлов + ", " + Стр.ВидФайла;	
				
			КонецЕсли;
			
		Иначе
			
			СтрТЗ = ТЗ.Добавить();
			
			СтрТЗ.Сделка = Стр.Сделка;
			СтрТЗ.ВыгруженныеВидыФайлов = Строка(Стр.ВидФайла); 
			
		КонецЕсли; 		 
		
	КонецЦикла;
	
	Для Каждого Стр Из МассивОтсутствующихФайлов Цикл
		
		ПараметрыОтбора = Новый Структура("Сделка", Стр.Сделка);
		
		НайденныеСтроки = ТЗ.НайтиСтроки(ПараметрыОтбора); 
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Если НайденныеСтроки[0].ОтсутствующиеВидыФайлов = Неопределено Тогда
				
				НайденныеСтроки[0].ОтсутствующиеВидыФайлов = Строка(Стр.ВидФайла);
				
			Иначе	
				
				НайденныеСтроки[0].ОтсутствующиеВидыФайлов = НайденныеСтроки[0].ОтсутствующиеВидыФайлов + ", " + Строка(Стр.ВидФайла);	
				
			КонецЕсли;
			
		Иначе
			
			СтрТЗ = ТЗ.Добавить();
			
			СтрТЗ.Сделка = Стр.Сделка;
			СтрТЗ.ОтсутствующиеВидыФайлов = Строка(Стр.ВидФайла); 
			
		КонецЕсли; 		 
		
	КонецЦикла;
	
	Для Каждого Стр Из ТЗ Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		ОбластьСтрока.Параметры.Сделка = Стр.Сделка;
		
		ОбластьСтрока.Параметры.СделкаСсылка = Стр.Сделка;
		
		ОбластьСтрока.Параметры.ВыгруженныеВидыФайлов = Стр.ВыгруженныеВидыФайлов;
		
		ОбластьСтрока.Параметры.ОтсутствующиеВидыФайлов = Стр.ОтсутствующиеВидыФайлов;
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Защита = Ложь;
	
	Возврат ТабДок;	
	
КонецФункции  
