#Область ФункцииПроцедуры
&НаСервере
Процедура ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах()
	
	Для Каждого Стр Из Объект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("КлючСвязи",Стр.КлючСвязиРаспределения); 
		
		НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ТекстовоеПредставление = "";
			
			Для Каждого СтрНайденнаяСтрока из НайденныеСтроки Цикл
				
				Если ТекстовоеПредставление = "" Тогда
					
					ТекстовоеПредставление = ПолучитьНомерДокумента(СтрНайденнаяСтрока.Сделка) + " - " + Формат(СтрНайденнаяСтрока.СуммаРаспределения,"ЧДЦ=2; ЧГ=");	

				Иначе
					
					ТекстовоеПредставление = ТекстовоеПредставление + Символы.ПС + ПолучитьНомерДокумента(СтрНайденнаяСтрока.Сделка) + " - " + Формат(СтрНайденнаяСтрока.СуммаРаспределения,"ЧДЦ=2; ЧГ=");
					
				КонецЕсли;	
				
			КонецЦикла;	
			
			Стр.Сделки = ТекстовоеПредставление;
			
		КонецЕсли;
		
		
	КонецЦикла;  
	
	Для Каждого Стр Из Объект.Товары Цикл
	
		Если НЕ ЗначениеЗаполнено(Стр.Сделки) Тогда
			
			Стр.Сделки = "не распределено";
			
		КонецЕсли;	
	
	КонецЦикла;  
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьНомерДокумента(Док) 
	
	Возврат Док.Номер;
	
КонецФункции

#КонецОбласти

#Область СобытияФормы 

 &НаКлиенте
Процедура ЛГС_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)


	Если Источник = ЭтаФорма.УникальныйИдентификатор Тогда
		
		Если ИмяСобытия = "ВыполненоРаспределениеСтрокиПоСделкамСчетПоставщикаТовары" Тогда
			
			Для Каждого Стр Из Объект.РаспределениеСуммПоСделкамТовары Цикл
				
				ПараметрыОтбора = Новый Структура("КлючСвязи", Параметр.КлючСвязи);
				
				НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора);
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
						
						Объект.РаспределениеСуммПоСделкамТовары.Удалить(СтрНайденнаяСтрока);
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла; 
			
			Для Каждого Стр Из Параметр.МассивДобавляемыхСтрокРаспределения Цикл
				
				СтрРаспределение = Объект.РаспределениеСуммПоСделкамТовары.Добавить();
				СтрРаспределение.КлючСвязи = Параметр.КлючСвязи;
				СтрРаспределение.Сделка = Стр.Сделка;
				СтрРаспределение.СуммаРаспределения = Стр.Сумма;
				
			КонецЦикла;
			
			Для Каждого Стр Из Объект.Товары Цикл
				
				Если Стр.КлючСвязиРаспределения = Параметр.КлючСвязи Тогда
					
					Стр.Сделки = Параметр.ТекстовоеПредставление;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЛГС_ТоварыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ТоварыСделки" Тогда
		
		Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения= Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
		
		
		ПараметрыФормы = Новый Структура("Номенклатура",Элементы.товары.ТекущиеДанные.Номенклатура);
		ПараметрыФормы.Вставить("Сумма", ?(Объект.СуммаВключаетНДС, Элементы.Товары.ТекущиеДанные.Сумма, Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаНДС));
		ПараметрыФормы.Вставить("КлючСвязи",Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
		ПараметрыФормы.Вставить("ВидТЧ", "Товары"); 
		
		ОткрытьФорму("Документ.СчетНаОплатуПоставщика.Форма.ФормаРедактированияСуммПоСделкам",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ЭтаФорма.Модифицированность = Истина   
		
	КонецЕсли;	

	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыПередУдалениемПосле(Элемент, Отказ)
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамТовары.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		
		МаксКлючСвязиРаспределения = -1;
		
		Для Каждого Стр Из Объект.Товары Цикл
			
			Если Стр.КлючСвязиРаспределения = "" Тогда
				
				Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения = Строка(МаксКлючСвязиРаспределения + 1);
				Элементы.Товары.ТекущиеДанные.Сделки = "не распределено";
				
			ИначеЕсли МаксКлючСвязиРаспределения < Число(Стр.КлючСвязиРаспределения) Тогда
				
				МаксКлючСвязиРаспределения = Число(Стр.КлючСвязиРаспределения);	
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если Копирование Тогда
		
		Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения = Строка(МаксКлючСвязиРаспределения + 1); 
		Элементы.Товары.ТекущиеДанные.Сделки = "не распределено";
		
	КонецЕсли;


КонецПроцедуры

&НаСервере
Процедура ЛГС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах();
	
	Если ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") тогда
		
		Элементы.Администратор.Видимость = Истина;
		
	КонецЕсли;
	
	// ++ ХАУНД Устинин 04.06.2026 ID: 4410
	Элементы.СтатусДокумента.Доступность = ОбщегоНазначения.ПользовательМожетМенятьСтатусДокумента();
	// -- ХАУНД Устинин 04.06.2026 ID: 4410
		
КонецПроцедуры

&НаСервере
Процедура ЛГС_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах(); 

КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыЦенаПриИзмененииПосле(Элемент)
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамТовары.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыСуммаПриИзмененииПосле(Элемент)

	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамТовары.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыКоличествоПриИзмененииПосле(Элемент)

	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамТовары.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах();

КонецПроцедуры

&НаКлиенте
Процедура ЛГС_СделкаПриИзмененииПосле(Элемент)
	
	СтатусСделки = ЛогистикаСервер.ПолучитьСтатусыСделки(Объект.Сделка);
	
	Если СтатусСделки = ПредопределенноеЗначение("Перечисление.СтатусыСделок.Закрыта") ИЛИ СтатусСделки = ПредопределенноеЗначение("Перечисление.СтатусыСделок.Отменена")
		ИЛИ СтатусСделки = ПредопределенноеЗначение("Перечисление.СтатусыСделок.Завершена") Тогда
		
		ПоказатьПредупреждение(,"Архивная сделка не может быть выбрана",,"ОШИБКА!!!" + Символы.ПС +"СДЕЛКА НАХОДИТСЯ В АРХИВЕ!!!");																				   
		
		Объект.Сделка = ПредопределенноеЗначение("Документ.Сделка.ПустаяСсылка");
		
		Возврат;
		
	КонецЕсли;	
	
	УстановитьЗначенияСделокВСтроки();
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВУслугах();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияСделокВСтроки()
	
	Если ЗначениеЗаполнено(Объект.Сделка) Тогда
		
		Объект.РаспределениеСуммПоСделкамТовары.Очистить();
		
		Для Каждого Стр Из Объект.Товары Цикл
			
			Если НЕ ЗначениеЗаполнено(Стр.КлючСвязиРаспределения) Тогда
				
				Стр.КлючСвязиРаспределения = Стр.ПолучитьИдентификатор();
				
			КонецЕсли;
			
			СтрРаспределение = Объект.РаспределениеСуммПоСделкамТовары.Добавить();
			СтрРаспределение.КлючСвязи = Стр.КлючСвязиРаспределения;
			СтрРаспределение.Сделка = Объект.Сделка;
			
			Если Объект.СуммаВключаетНДС Тогда
				
				СтрРаспределение.СуммаРаспределения = Стр.Сумма;
				
			Иначе
				
				СтрРаспределение.СуммаРаспределения = Стр.Сумма + Стр.СуммаНДС;
				
			КонецЕсли;
			
		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВУслугах()
	
	Для Каждого Стр Из Объект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("КлючСвязи", Стр.КлючСвязиРаспределения);
		
		НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ТекстовоеПредставление = "";
			
			Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
				
				Если ТекстовоеПредставление = "" Тогда
					
					ТекстовоеПредставление = ПолучитьНомерДокумента(СтрНайденнаяСтрока.Сделка) + " - " + Формат(СтрНайденнаяСтрока.СуммаРаспределения,"ЧДЦ=2; ЧГ=");	
					
				Иначе
					
					ТекстовоеПредставление = ТекстовоеПредставление + Символы.ПС + ПолучитьНомерДокумента(СтрНайденнаяСтрока.Сделка) + " - " + Формат(СтрНайденнаяСтрока.СуммаРаспределения,"ЧДЦ=2; ЧГ=");
					
				КонецЕсли;
				
			КонецЦикла;
			
			Стр.Сделки = ТекстовоеПредставление;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Для Каждого Стр ИЗ Объект.Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Сделки) Тогда
			
			Стр.Сделки = "не распределено";
			
		КонецЕсли;
		
	КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	Если (ЭтотОбъект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусОплатыСчета.ДобавленВПлатежныйКалендарь") 
		ИЛИ ЭтотОбъект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусОплатыСчета.ОплаченЧастично") 
		ИЛИ ЭтотОбъект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусОплатыСчета.Оплачен")) 
		И ЭтотОбъект.СрокОплаты = '00010101' Тогда  
		
		ПоказатьПредупреждение(,"Не заполнено поле <Срок оплаты>",,"Ошибка");
		ЭтаФорма.ТекущийЭлемент = Элементы.СрокОплаты;
		
		Отказ = Истина;
		
	КонецЕсли;
	
	ЕстьНераспределенные =  РезультатПроверкиПозицийПоВидамСделок();
	
	Если ЕстьНераспределенные Тогда
		ПоказатьПредупреждение(,"Имеются нераспределенные позиции из Видов Расходов Сделки",,"Ошибка");
		Отказ = Истина;
	КонецЕсли; 
	
 КонецПроцедуры 
 
 &НаСервере
 Функция РезультатПроверкиПозицийПоВидамСделок()
	 
	 НаличиеНераспределено = Ложь;
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВидыРасходовСделки.Номенклатура КАК Номенклатура
	 |ИЗ
	 |	РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	 |"; 
	 ВидыРасходов = Запрос.Выполнить().Выгрузить();
	 ВидыРасходов.Свернуть("Номенклатура");  
	 
	//Проверяем ТЧ Товаты 
	НаличиеНераспределено = ЛогистикаСервер.ПолучитьРезультатПроверкиРаспределенные(Объект.Товары, Объект.РаспределениеСуммПоСделкамТовары, ВидыРасходов);  
	 
	Возврат НаличиеНераспределено;
		 
КонецФункции 
 

&НаКлиенте
Процедура ЛГС_СтатусДокументаНачалоВыбораПеред(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ЭтотОбъект.СтарыйСтатус = ЭтотОбъект.СтатусДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_СтатусДокументаПриИзмененииПеред(Элемент)
	
	Если ЭтотОбъект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусОплатыСчета.СогласованДляОплаты") Тогда
		
		Если НЕ (ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") ИЛИ ЛогистикаСервер.ЕстьРоль("ЛогистикаСогласованиеОплатыСчетов")) Тогда
			
			ЭтотОбъект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусОплатыСчета.НеОплачен"); 
			
		    ПоказатьПредупреждение(,"Недостаточно прав для установки статуса <Согласован для оплаты>",,"Ошибка");
			
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусОплатыСчета.ДобавленВПлатежныйКалендарь") Тогда	
		
		Если ЭтотОбъект.СтарыйСтатус = ПредопределенноеЗначение("Перечисление.СтатусОплатыСчета.СогласованДляОплаты") Тогда
			
			ЭтаФорма.ТекущийЭлемент = Элементы.СрокОплаты;
			
		ИначеЕсли НЕ (ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") ИЛИ ЛогистикаСервер.ЕстьРоль("ЛогистикаСогласованиеОплатыСчетов")) Тогда
			
			ЭтотОбъект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусОплатыСчета.НеОплачен");
			ПоказатьПредупреждение(,"Статус <Добавлен в платежный календарь> может быть установлен только из статуса <Согласован для оплаты>",,"Ошибка");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПослеЗаписиНаСервере")
Процедура ЛГС_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ЗаполнитьДобавленныеКолонкиТаблиц();

	Если Не ЗначениеЗаполнено(Объект.ТипЦен) Тогда
		Ценообразование.ОбновитьЦеныНоменклатуры(Объект.Ссылка, 
		Перечисления.СпособыЗаполненияЦен.ПоЗакупочнымЦенам,
		Объект.ВалютаДокумента,
		Объект.СуммаВключаетНДС);
	КонецЕсли;

	ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию("ОсновнойВариантРасчетаВходящегоНДС",
	?(Объект.СуммаВключаетНДС, Перечисления.ВариантыРасчетаНДС.НДСВСумме, Перечисления.ВариантыРасчетаНДС.НДССверху));

	УстановитьСостояниеДокумента();
	#Удаление
	УстановитьСтатусДокумента();
	#КонецУдаления 
	#Вставка
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОграничениеСчетов.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.ОграничениеСчетов КАК ОграничениеСчетов
	|ГДЕ
	|	ОграничениеСчетов.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		УстановитьСтатусДокумента(); 
		
	КонецЕсли;

	#КонецВставки
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.СостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

	РаботаСДоговорамиКонтрагентовБП.ЗаписатьСпособЗаполненияСтавкиНДСПоДокументу(
	ТекущийОбъект.ДоговорКонтрагента, ТекущийОбъект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ЛГС_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("СрокОплаты");
КонецПроцедуры

 #КонецОбласти

