&ИзменениеИКонтроль("ПоместитьВыбранныеФайлыВХранилище")
Процедура ЛГС_ПоместитьВыбранныеФайлыВХранилище(Знач ВыбранныеФайлы, Знач ВладелецФайла, ПрисоединенныеФайлыМассив, Знач ИдентификаторФормы, Знач ИмяСоздаваемогоФайла, Знач ГруппаФайлов)

	ОбщиеНастройки = ОбщиеНастройкиРаботыСФайлами();
	ТекущаяПозиция = 0;
	ПоследнийСохраненныйФайл = Неопределено;

	Для Каждого ПолноеИмяФайла Из ВыбранныеФайлы Цикл

		ТекущаяПозиция = ТекущаяПозиция + 1;		
		Файл = Новый Файл(ПолноеИмяФайла);		
		ПроверитьВозможностьЗагрузкиФайла(Файл);

		Если ОбщиеНастройки.ИзвлекатьТекстыФайловНаСервере Тогда
			АдресВременногоХранилищаТекста = "";
		Иначе
			АдресВременногоХранилищаТекста = ИзвлечьТекстВоВременноеХранилище(ПолноеИмяФайла, ИдентификаторФормы);
		КонецЕсли;

		ВремяИзмененияУниверсальное = Файл.ПолучитьУниверсальноеВремяИзменения();

		ОбновитьСостояниеОСохраненииФайлов(ВыбранныеФайлы, Файл, ТекущаяПозиция, ИмяСоздаваемогоФайла);
		ПоследнийСохраненныйФайл = Файл;

		ПомещаемыеФайлы = Новый Массив;
		Описание = Новый ОписаниеПередаваемогоФайла(Файл.ПолноеИмя, "");
		ПомещаемыеФайлы.Добавить(Описание);

		ПомещенныеФайлы = Новый Массив;		
		Если НЕ ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь, ИдентификаторФормы) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось поместить в приложение файл ""%1"".'"),
			Файл.ПолноеИмя) );
			Продолжить;
		КонецЕсли;

		АдресВременногоХранилищаФайла = ПомещенныеФайлы[0].Хранение;

		ИмяИРасширениеФайла = ИмяИРасширениеФайла(Файл);
		РасширениеФайла = ИмяИРасширениеФайла.РасширениеФайла;
		ИмяФайлаБезРасширения = ИмяИРасширениеФайла.ИмяФайлаБезРасширения;

		ИмяБезРасширения = ?(ПустаяСтрока(ИмяСоздаваемогоФайла), ИмяФайлаБезРасширения, ИмяСоздаваемогоФайла);

		ПараметрыФайла = РаботаСФайламиСлужебныйКлиентСервер.ПараметрыДобавленияФайла();
		ПараметрыФайла.ГруппаФайлов = ГруппаФайлов;
		ПараметрыФайла.ВладелецФайлов = ВладелецФайла;
		ПараметрыФайла.ИмяБезРасширения = ИмяБезРасширения;
		ПараметрыФайла.РасширениеБезТочки = РасширениеФайла;
		ПараметрыФайла.ВремяИзмененияУниверсальное = ВремяИзмененияУниверсальное;
		
		#Вставка
		
		Если ПараметрыФайла.Свойство("Автор") Тогда 
			
			Если НЕ ЗначениеЗаполнено(ПараметрыФайла.Автор) Тогда
				
				ПараметрыФайла.Автор = ПользователиКлиентСервер.ТекущийПользователь();
				
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецВставки
		
		ПрисоединенныйФайл = РаботаСФайламиСлужебныйВызовСервера.ДобавитьФайл(ПараметрыФайла,
		АдресВременногоХранилищаФайла, АдресВременногоХранилищаТекста);
		Если ЭтоАдресВременногоХранилища(АдресВременногоХранилищаТекста) Тогда
			УдалитьИзВременногоХранилища(АдресВременногоХранилищаТекста);
		КонецЕсли;
		Если ПрисоединенныйФайл = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ПрисоединенныеФайлыМассив.Добавить(ПрисоединенныйФайл);

	КонецЦикла;

	ОбновитьСостояниеОСохраненииФайлов(ВыбранныеФайлы, ПоследнийСохраненныйФайл, , ИмяБезРасширения);

КонецПроцедуры

&ИзменениеИКонтроль("ПоместитьВыбранныеФайлыВХранилищеВебЗавершение")
Процедура ЛГС_ПоместитьВыбранныеФайлыВХранилищеВебЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры)

	Обработчик = ДополнительныеПараметры.ОбработчикРезультата; // ОписаниеОповещения
	Если Не Результат Тогда
		ВыполнитьОбработкуОповещения(Обработчик, Неопределено);
		Возврат;
	КонецЕсли;

	ВладелецФайла = ДополнительныеПараметры.ВладелецФайла;
	СтруктураПути = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ВыбранноеИмяФайла);
	ГруппаФайлов = ?(Обработчик.ДополнительныеПараметры.Свойство("ГруппаФайлов"),
	Обработчик.ДополнительныеПараметры.ГруппаФайлов, "");

	Если Не ПустаяСтрока(СтруктураПути.Расширение) Тогда
		Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(СтруктураПути.Расширение);
		ИмяБезРасширения = СтруктураПути.ИмяБезРасширения;
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось поместить в приложение файл ""%1"".'"),
		ВыбранноеИмяФайла);
	КонецЕсли;

	ПроверитьРасширениеФайлаДляЗагрузки(Расширение);

	ОбщиеНастройки = ОбщиеНастройкиРаботыСФайлами();
	РазмерЗагружаемогоФайла = ПолучитьИзВременногоХранилища(Адрес).Размер();
	Если РазмерЗагружаемогоФайла > ОбщиеНастройки.МаксимальныйРазмерФайла Тогда

		РазмерВМб     = РазмерЗагружаемогоФайла / (1024 * 1024);
		РазмерВМбМакс = ОбщиеНастройки.МаксимальныйРазмерФайла / (1024 * 1024);

		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Размер файла ""%1"" (%2 Мб)
		|превышает максимально допустимый размер %3 Мб.'"),
		ВыбранноеИмяФайла,
		РаботаСФайламиСлужебныйКлиентСервер.ПредставлениеРазмераФайла(РазмерВМб),
		РаботаСФайламиСлужебныйКлиентСервер.ПредставлениеРазмераФайла(РазмерВМбМакс));

		ВызватьИсключение ОписаниеОшибки;

	КонецЕсли;

	ПараметрыФайла = РаботаСФайламиСлужебныйКлиентСервер.ПараметрыДобавленияФайла();
	ПараметрыФайла.ВладелецФайлов = ВладелецФайла;
	ПараметрыФайла.ИмяБезРасширения = ИмяБезРасширения;
	ПараметрыФайла.РасширениеБезТочки = Расширение; 
	
	#Вставка
	
	Если ПараметрыФайла.Свойство("Автор") Тогда 
		
		Если НЕ ЗначениеЗаполнено(ПараметрыФайла.Автор) Тогда
			
			ПараметрыФайла.Автор = ПользователиКлиентСервер.ТекущийПользователь();
			
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецВставки
	
	Если ЗначениеЗаполнено(ГруппаФайлов) Тогда
		ПараметрыФайла.ГруппаФайлов = ГруппаФайлов;
	КонецЕсли;

	// Создание карточки Файла в базе данных.
	ПрисоединенныйФайл = РаботаСФайламиСлужебныйВызовСервера.ДобавитьФайл(
	ПараметрыФайла, Адрес);

	ВыполнитьОбработкуОповещения(Обработчик, ПрисоединенныйФайл);

КонецПроцедуры
