
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
Параметры.СформироватьПриОткрытии = Истина;	

Отчет.Номенклатура = Параметры.Номенклатура;
Отчет.РежимРасшифровки = Истина;
Отчет.НачалоПериода = Параметры.НачалоПериода;
Отчет.КонецПериода = Параметры.КонецПериода;


СхемаКомпоновкиДанных = Отчеты.ПокупкиПоНоменклатуре.ПолучитьМакет("Макет");

	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	Отчет.РежимРасшифровки = Истина;
	
СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);	
	
КонецПроцедуры

////Двойной клик - отключена обработка
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	СтандартнаяОбработка = Ложь;
	
	ДокументСсылка = ДокументРасшифровки(Расшифровка);
	
   	ПараметрыФормы = Новый Структура("Ключ", ДокументСсылка.ДокСсылка);

	Если ТипЗнч(ДокументСсылка.ДокСсылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда	

		Если ДокументСсылка.ДокКоличествоАгентскиеУслуги > 0 ИЛИ (ДокументСсылка.ДокКоличествоТовары > 0 И ДокументСсылка.ДокКоличествоУслуги > 0) Тогда
			ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаОбщая", ПараметрыФормы);
		ИначеЕсли ДокументСсылка.ДокКоличествоТовары > 0 Тогда
			ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары", ПараметрыФормы);
		ИначеЕсли ДокументСсылка.ДокКоличествоУслуги > 0 Тогда
			ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаУслуги", ПараметрыФормы);
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(ДокументСсылка.ДокСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда 
		ОткрытьФорму("Документ.КорректировкаПоступления.Форма.ФормаДокумента", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ДокументРасшифровки(Расшифровка)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Отчет");
 
 	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);

    Группировки = Данные.Элементы.Получить(Расшифровка).ПолучитьРодителей();
	
	Если Группировки.Количество() > 0 Тогда
		
		ИдентификаторГруппировки = Группировки[0].Идентификатор;
		
		ПоляГруппировки = Данные.Элементы.Получить(ИдентификаторГруппировки).ПолучитьПоля();
		
		Для Каждого ПолеГруппировка Из ПоляГруппировки Цикл //находим нужную группировку  по строке
			
			Если ПолеГруппировка.Поле = "Документ" Тогда
				
				НоменклатураРасш = ПолеГруппировка.Значение;  
				
			КонецЕсли;  
			
		КонецЦикла; 
		
	КонецЕсли;      
	
	Док = Новый Структура;
	Док.Вставить("ДокСсылка",НоменклатураРасш); 
	
	Если ТипЗнч(НоменклатураРасш) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Док.Вставить("ДокКоличествоУслуги",НоменклатураРасш.Услуги.Количество());
		Док.Вставить("ДокКоличествоТовары",НоменклатураРасш.Товары.Количество()); 
		Док.Вставить("ДокКоличествоАгентскиеУслуги",НоменклатураРасш.АгентскиеУслуги.Количество());
	КонецЕсли;
	
	 Возврат Док;
	
 
КонецФункции




// Клик правой кнопкой мышки - отключена обработка
&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	Название = ?(ЗначениеЗаполнено(Форма.ПредставлениеТекущегоВарианта), Форма.ПредставлениеТекущегоВарианта, "Расшифровка по прокупкам номенклатуры");
	
	ЗаголовокОтчета = Название + БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, Отчет.КонецПериода);
	
	//Если ЗначениеЗаполнено(Отчет.Организация) И Форма.ИспользуетсяНесколькоОрганизаций Тогда
	//	ЗаголовокОтчета = ЗаголовокОтчета + " " + БухгалтерскиеОтчетыВызовСервера.ПолучитьТекстОрганизация(Отчет.Организация, Отчет.ВключатьОбособленныеПодразделения);
	//КонецЕсли;
	
	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьТекстЗаголовка(ЭтотОбъект);
КонецПроцедуры
