
&НаСервере
Процедура СохранитьНаСервере()

	НЗ = РегистрыСведений.СоответствиеЛинийИАгентЛиний.СоздатьНаборЗаписей();
	
	НЗ.Записать();
	
	Для Каждого Стр Из ЭтотОбъект.НастройкаСоответствия Цикл
		
		МЗ = РегистрыСведений.СоответствиеЛинийИАгентЛиний.СоздатьМенеджерЗаписи();
		
		МЗ.Линия = Стр.Линия;
		МЗ.АгентЛинии = Стр.АгентЛинии;
		
		МЗ.Записать();
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НЗ = РегистрыСведений.СоответствиеЛинийИАгентЛиний.СоздатьНаборЗаписей();
	
	НЗ.Прочитать();
	
	Для Каждого Запись Из НЗ Цикл
		
		Стр = ЭтотОбъект.НастройкаСоответствия.Добавить();
		Стр.АгентЛинии = Запись.АгентЛинии;
		Стр.Линия = Запись.Линия;
		
	КонецЦикла;
	
КонецПроцедуры
