
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Квартал = НачалоКвартала(ТекущаяДата());
	
	УстановитьОтборСписка();

КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборСписка()
	
	Список.Отбор.Элементы.Очистить();
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Вывезен); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Доставлен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.СданПорожний); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Выгружен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыставленыВсеРасходы);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ДокументыПодготовлены);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Закрыта);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Отменена);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Задержана);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ПретензияСуд);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Задержана);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыходИзПорта);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.SWBОформлен);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов; 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квартал"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = КонецКвартала(ЭтотОбъект.Квартал);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квартал"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = НачалоКвартала(ЭтотОбъект.Квартал); 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВсеФайлыДобавлены"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОтборКонтрагент) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
		
		ЭлементОтбора.ПравоеЗначение = ЭтотОбъект.ОтборКонтрагент;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОтборОтветственный) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
		
		ЭлементОтбора.ПравоеЗначение = ЭтотОбъект.ОтборОтветственный;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КварталНазад(Команда)     
	
	ЭтотОбъект.Квартал = ДобавитьМесяц(НачалоМесяца(ЭтотОбъект.Квартал), -3);
	
	УстановитьОтборСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура КварталВперед(Команда)
	
	ЭтотОбъект.Квартал = ДобавитьМесяц(НачалоМесяца(ЭтотОбъект.Квартал), 3);
	
	УстановитьОтборСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаФайловСделок(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	

	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлыСделок(Команда)
				
				СтруктураВозврата = ПолучитьФайлыНаСервере();
				
				РасширениеПодключено = Истина;
				
				#Если ВебКлиент Тогда
					
					ПодключитьРасширениеРаботыСФайламиНаКлиенте(Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Истина, СтруктураВозврата.МассивФайлов));
					
				#КонецЕсли
				
				#Если НЕ ВебКлиент Тогда
				
				Если СтруктураВозврата.МассивФайлов.Количество() > 0 Тогда
											
						Попытка
							
							СсылкаНаФайл = ПолучитьСсылкуНаФайл(СтруктураВозврата.МассивФайлов);
							
							Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
								
								ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
								
								Возврат; 
								
							КонецЕсли;
							
							ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
							ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
							ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
							
							
							НачатьПолучениеФайлаССервера(СсылкаНаФайл, "Документы по сделкам.zip", ПараметрыДиалогаПолученияФайлов);
							
						Исключение	
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
							Сообщение.Сообщить();  
							
						КонецПопытки;
											
				КонецЕсли;
					
				#КонецЕсли					
																
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияРасширения(Подключено, ДопПараметры) Экспорт
	
	Если Подключено Тогда
		
		Попытка
			
			СсылкаНаФайл = ПолучитьСсылкуНаФайл(ДопПараметры.МассивФайлов);
			
			Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
				
				ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
				
				Возврат; 
				
			КонецЕсли;
			
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
			
			НачатьПолучениеФайлаССервера(СсылкаНаФайл, "Документы по сделкам.zip", ПараметрыДиалогаПолученияФайлов);
			
		Исключение	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
			Сообщение.Сообщить();  
			
		КонецПопытки;	
		
	ИначеЕсли ДопПараметры.УстановитьЕслиНеПодключено Тогда
		
		НачатьУстановкуРасширенияРаботыСФайлами(
            Новый ОписаниеОповещения(
                "ПодключитьРасширениеРаботыСФайламиНаКлиенте",
                ЭтотОбъект,
                Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Ложь, ДопПараметры.МассивФайлов)));
		
	Иначе
		
		ПоказатьПредупреждение( , НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодключитьРасширениеРаботыСФайламиНаКлиенте(ДопПараметры) Экспорт
	
	ОповещениеОПодключенииРасширенияРаботыСФайлами = Новый ОписаниеОповещения("ПослеПодключенияРасширения", ЭтотОбъект, ДопПараметры);
	
	НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеОПодключенииРасширенияРаботыСФайлами);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаФайл(МассивФайлов)
		
	ЗаписьZIP = Новый ЗаписьZipФайла(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip",,,,,);	
	
	Для Каждого СтрФайл Из МассивФайлов Цикл
				
		ДвоичныеДанныеФайла = СтрФайл.ДвоичныеДанные;
		ДвоичныеДанныеФайла.Записать(СтрФайл.ИмяФайла);	
		
		ЗаписьZIP.Добавить(СтрФайл.ИмяФайла, РежимСохраненияПутейZIP.СохранятьПолныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
				
	КонецЦикла;   
		
	ЗаписьZIP.Записать(); 
	
	Для Каждого СтрФайл Из МассивФайлов Цикл 
		
		УдалитьФайлы(СтрФайл.ИмяФайла);
		
		УдалитьФайлы(СтрФайл.ПутьФайла);
		
	КонецЦикла;
	
	Файл = Новый Файл(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip");  
	
	Если Файл.Существует() Тогда  
		
        Данные = Новый ДвоичныеДанные(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip");  
		
		СсылкаНаФайл = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
		
		УдалитьФайлы(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip"); 
		
        Возврат СсылкаНаФайл;
		
	Иначе
		
        Возврат Неопределено;
		
    КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьФайлыНаСервере()
	
	МассивФайлов = Новый Массив;
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументСделка.Ссылка КАК Ссылка,
	               |	ИнформацияОДокументах.ВсеФайлыДобавлены КАК ВсеФайлыДобавлены
	               |ИЗ
	               |	Документ.Сделка КАК ДокументСделка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СделкаСборДокументов.Ссылка КАК СсылкаСделка,
	               |			МИНИМУМ(ВЫБОР
	               |					КОГДА СделкаПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
	               |						ТОГДА ВЫБОР
	               |								КОГДА ЕСТЬNULL(ЕстьПоручениеРавноПриложениеВЗ.ЕстьПоручениеРавноПриложение, ЛОЖЬ) = ИСТИНА
	               |									ТОГДА ВЫБОР
	               |											КОГДА СделкаСборДокументов.ВидДокумента = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ПоручениеЭкспедитораСПодписью)
	               |													ИЛИ СделкаСборДокументов.ВидДокумента = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ПриложениеСПодписьюСДвухСторон)
	               |													ИЛИ СделкаСборДокументов.ВидДокумента = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ЭкспедиторскаяРасписка)
	               |												ТОГДА ЕСТЬNULL(ЕстьПоручениеРавноПриложениеВЗ.ЕстьПоручениеРавноПриложение, ЛОЖЬ)
	               |											ИНАЧЕ ВЫБОР
	               |													КОГДА СделкаСборДокументов.ВидДокумента = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ПОРУЧЕНИЕРАВНОПРИЛОЖЕНИЕ)
	               |														ТОГДА ЕСТЬNULL(ЕстьПоручениеЭкспедитораСПодписьюВЗ.ЕстьПоручениеЭкспедитораСПодписью, ЛОЖЬ)
	               |																И ЕСТЬNULL(ЕстьПриложениеСПодписьюСДвухСторонВЗ.ЕстьПриложениеСПодписьюСДвухСторон, ЛОЖЬ)
	               |																И ЕСТЬNULL(ЕстьЭкспедиторскаяРаспискаВЗ.ЕстьЭкспедиторскаяРасписка, ЛОЖЬ)
	               |													ИНАЧЕ ЛОЖЬ
	               |												КОНЕЦ
	               |										КОНЕЦ
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА СделкаСборДокументов.ВидДокумента = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ПОРУЧЕНИЕРАВНОПРИЛОЖЕНИЕ)
	               |											ТОГДА ЕСТЬNULL(ЕстьПоручениеЭкспедитораСПодписьюВЗ.ЕстьПоручениеЭкспедитораСПодписью, ЛОЖЬ)
	               |													И ЕСТЬNULL(ЕстьПриложениеСПодписьюСДвухСторонВЗ.ЕстьПриложениеСПодписьюСДвухСторон, ЛОЖЬ)
	               |													И ЕСТЬNULL(ЕстьЭкспедиторскаяРаспискаВЗ.ЕстьЭкспедиторскаяРасписка, ЛОЖЬ)
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА СделкаСборДокументов.ВидДокумента = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ПоручениеЭкспедитораСПодписью)
	               |														ИЛИ СделкаСборДокументов.ВидДокумента = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ПриложениеСПодписьюСДвухСторон)
	               |														ИЛИ СделкаСборДокументов.ВидДокумента = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ЭкспедиторскаяРасписка)
	               |													ТОГДА ЕСТЬNULL(ЕстьПоручениеРавноПриложениеВЗ.ЕстьПоручениеРавноПриложение, ЛОЖЬ)
	               |												ИНАЧЕ ЛОЖЬ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК ВсеФайлыДобавлены
	               |		ИЗ
	               |			Документ.Сделка.СборДокументов КАК СделкаСборДокументов
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
	               |				ПО СделкаСборДокументов.ВидДокумента = СделкаПрисоединенныеФайлы.ВидФайла
	               |					И СделкаСборДокументов.Ссылка = СделкаПрисоединенныеФайлы.ВладелецФайла
	               |					И (СделкаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ)
	               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					МАКСИМУМ(ВЫБОР
	               |							КОГДА СделкаПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
	               |								ТОГДА ЛОЖЬ
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ) КАК ЕстьПоручениеРавноПриложение,
	               |					СделкаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайлаСделкаСсылка
	               |				ИЗ
	               |					Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
	               |				ГДЕ
	               |					СделкаПрисоединенныеФайлы.ВидФайла = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ПОРУЧЕНИЕРАВНОПРИЛОЖЕНИЕ)
	               |					И СделкаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					СделкаПрисоединенныеФайлы.ВладелецФайла) КАК ЕстьПоручениеРавноПриложениеВЗ
	               |				ПО СделкаСборДокументов.Ссылка = ЕстьПоручениеРавноПриложениеВЗ.ВладелецФайлаСделкаСсылка
	               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					МАКСИМУМ(ВЫБОР
	               |							КОГДА СделкаПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
	               |								ТОГДА ЛОЖЬ
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ) КАК ЕстьПоручениеЭкспедитораСПодписью,
	               |					СделкаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайлаСделкаСсылка
	               |				ИЗ
	               |					Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
	               |				ГДЕ
	               |					СделкаПрисоединенныеФайлы.ВидФайла = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ПоручениеЭкспедитораСПодписью)
	               |					И СделкаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					СделкаПрисоединенныеФайлы.ВладелецФайла) КАК ЕстьПоручениеЭкспедитораСПодписьюВЗ
	               |				ПО СделкаСборДокументов.Ссылка = ЕстьПоручениеЭкспедитораСПодписьюВЗ.ВладелецФайлаСделкаСсылка
	               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					МАКСИМУМ(ВЫБОР
	               |							КОГДА СделкаПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
	               |								ТОГДА ЛОЖЬ
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ) КАК ЕстьПриложениеСПодписьюСДвухСторон,
	               |					СделкаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайлаСделкаСсылка
	               |				ИЗ
	               |					Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
	               |				ГДЕ
	               |					СделкаПрисоединенныеФайлы.ВидФайла = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ПриложениеСПодписьюСДвухСторон)
	               |					И СделкаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					СделкаПрисоединенныеФайлы.ВладелецФайла) КАК ЕстьПриложениеСПодписьюСДвухСторонВЗ
	               |				ПО СделкаСборДокументов.Ссылка = ЕстьПриложениеСПодписьюСДвухСторонВЗ.ВладелецФайлаСделкаСсылка
	               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					МАКСИМУМ(ВЫБОР
	               |							КОГДА СделкаПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
	               |								ТОГДА ЛОЖЬ
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ) КАК ЕстьЭкспедиторскаяРасписка,
	               |					СделкаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайлаСделкаСсылка
	               |				ИЗ
	               |					Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
	               |				ГДЕ
	               |					СделкаПрисоединенныеФайлы.ВидФайла = ЗНАЧЕНИЕ(СПРАВОЧНИК.ВИДЫПРИСОЕДИНЕННЫХФАЙЛОВСДЕЛКИ.ЭкспедиторскаяРасписка)
	               |					И СделкаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					СделкаПрисоединенныеФайлы.ВладелецФайла) КАК ЕстьЭкспедиторскаяРаспискаВЗ
	               |				ПО СделкаСборДокументов.Ссылка = ЕстьЭкспедиторскаяРаспискаВЗ.ВладелецФайлаСделкаСсылка
	               |		ГДЕ
	               |			СделкаСборДокументов.Необходим = ИСТИНА
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СделкаСборДокументов.Ссылка) КАК ИнформацияОДокументах
	               |		ПО ДокументСделка.Ссылка = ИнформацияОДокументах.СсылкаСделка
	               |ГДЕ
	               |	ДокументСделка.Проведен = ИСТИНА
	               |	И ИнформацияОДокументах.ВсеФайлыДобавлены = ИСТИНА
	               |	И ДокументСделка.Квартал МЕЖДУ &НачалоПериода И &КонецПериода";
	
	
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(ЭтотОбъект.Квартал));
	Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(ЭтотОбъект.Квартал));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ОтборОтветственный) И ЭтотОбъект.ОтборКонтрагент <> Выборка.Ссылка.Ответственный Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ОтборКонтрагент) И ЭтотОбъект.ОтборКонтрагент <> Выборка.Ссылка.Контрагент Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЗапросФайлов = Новый Запрос;
		
		ЗапросФайлов.Текст = "ВЫБРАТЬ
		                     |	СделкаПрисоединенныеФайлы.Ссылка КАК Ссылка,
		                     |	СделкаПрисоединенныеФайлы.ВидФайла КАК ВидФайла
		                     |ИЗ
		                     |	Документ.Сделка.СборДокументов КАК СделкаСборДокументов
		                     |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
		                     |		ПО СделкаСборДокументов.Ссылка = СделкаПрисоединенныеФайлы.ВладелецФайла
		                     |			И СделкаСборДокументов.ВидДокумента = СделкаПрисоединенныеФайлы.ВидФайла
		                     |ГДЕ
		                     |	СделкаСборДокументов.Ссылка = &Ссылка
		                     |	И СделкаСборДокументов.Необходим = ИСТИНА
		                     |
		                     |УПОРЯДОЧИТЬ ПО
		                     |	ВидФайла
		                     |АВТОУПОРЯДОЧИВАНИЕ";
		
		ЗапросФайлов.УстановитьПараметр("Ссылка", Выборка.Ссылка);
		
		ВыборкаФайлов = ЗапросФайлов.Выполнить().Выбрать();
		
		ВидФайлаПредыдущий = Неопределено;
		
		Пока ВыборкаФайлов.Следующий() Цикл 
										
				Если ВыборкаФайлов.ВидФайла = ВидФайлаПредыдущий Тогда
					
					НумераторДокумента = НумераторДокумента + 1;
					
				Иначе
					
					НумераторДокумента = 1;  
					
				КонецЕсли;
				
				ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаФайлов.Ссылка);  
				
				Если НумераторДокумента = 1 Тогда
					
					ИмяФайла = Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделка №" + Выборка.Ссылка.Номер + " от " + Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy") + "\" + Строка(ВыборкаФайлов.ВидФайла) + "." + ВыборкаФайлов.Ссылка.Расширение;
					
				Иначе
					
					ИмяФайла = Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделка №" + Выборка.Ссылка.Номер + " от " + Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy") + "\" + Строка(ВыборкаФайлов.ВидФайла) + Строка(НумераторДокумента) + "." + ВыборкаФайлов.Ссылка.Расширение;
					
				КонецЕсли;	
				
				ПутьФайла = Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделка №" + Выборка.Ссылка.Номер + " от " + Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy");
				
				СтруктураФайла = Новый Структура;
				СтруктураФайла.Вставить("ДвоичныеДанные", ДвоичныеДанныеФайла);
				СтруктураФайла.Вставить("ИмяФайла", ИмяФайла);
				СтруктураФайла.Вставить("ПутьФайла", ПутьФайла);
				СтруктураФайла.Вставить("ВидФайла", Строка(ВыборкаФайлов.ВидФайла));
				СтруктураФайла.Вставить("Сделка", Выборка.Ссылка);
				
				МассивФайлов.Добавить(СтруктураФайла);
				
				ВидФайлаПредыдущий = ВыборкаФайлов.ВидФайла;
							
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивФайлов", МассивФайлов); 
	
	Возврат СтруктураВозврата;
	
КонецФункции      

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент) 
	
	УстановитьОтборСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	
	УстановитьОтборСписка();

КонецПроцедуры
