
&ИзменениеИКонтроль("СформироватьДвиженияСтатусовДокументов")
Процедура ЛГС_СформироватьДвиженияСтатусовДокументов(ТаблицаСтатусов, ТаблицаРеквизитов)
	
	Если Не ЗначениеЗаполнено(ТаблицаРеквизитов)
		Или Не ЗначениеЗаполнено(ТаблицаСтатусов) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыСтатусовДокументов(ТаблицаСтатусов, ТаблицаРеквизитов);
	Реквизиты = Параметры.Реквизиты[0];
	
	Для Каждого СтрокаСтатуса Из Параметры.СтатусыДокументов Цикл
		
		// При записи набора, удаляем статусы, относящиеся к другой организации
		НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Документ.Установить(СтрокаСтатуса.Документ);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Организация = Реквизиты.Организация;
		Запись.Документ    = СтрокаСтатуса.Документ;
		Запись.Статус      = СтрокаСтатуса.Статус;
		Запись.ДополнительныйСтатус = СтрокаСтатуса.ДополнительныйСтатус;
		
		НаборЗаписей.Записать(); 
		
		#Вставка 
		
		Если ТипЗнч(СтрокаСтатуса.Документ) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		
			Если ЗначениеЗаполнено(СтрокаСтатуса.Документ.Сделка) Тогда 
				
				РассчитатьСтатусСвязаннойСделки(СтрокаСтатуса.Документ.Сделка); 
				
			КонецЕсли;
			
		КонецЕсли;
					
		#КонецВставки
		
		Если СтрокаСтатуса.ОтправитьОповещениеОбИзмененииСтатуса Тогда
			РегистрыСведений.ДокументыИнтеграцииCRM.ЗарегистрироватьКОтправке(СтрокаСтатуса.Документ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  

Процедура РассчитатьСтатусСвязаннойСделки(Ссыл)
	
	МассивСчетов = Новый Массив;
	
	Для Каждого Стр Из Ссыл.РасходыКлиента Цикл
		
		Если Стр.Выставлено И НЕ Стр.Аннулирован Тогда 
			
			Если ТипЗнч(Стр.СчетНаОплату) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
				
				МассивСчетов.Добавить(Стр.СчетНаОплату);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтатусыДокументов.Статус КАК Статус,
	|	СчетНаОплатуПокупателю.Ссылка КАК СчетНаОплату
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|		ПО СчетНаОплатуПокупателю.Ссылка = СтатусыДокументов.Документ.Ссылка
	|ГДЕ
	|	СчетНаОплатуПокупателю.Ссылка В(&МассивСчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыДокументов.Статус,
	|	СчетНаОплатуПокупателю.Ссылка";
	
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	СделкаОплачена = Истина;
	
	СделкаОплаченаЧастично = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Статус = Перечисления.СтатусОплатыСчета.Оплачен Тогда
			
			СделкаОплачена = Ложь;
			
		ИначеЕсли НЕ Выборка.Статус = Перечисления.СтатусОплатыСчета.НеОплачен Тогда	
			
			СделкаОплаченаЧастично = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СделкаОплачена Тогда
		
		НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
		
		НЗ.Отбор.Сделка.Установить(Ссыл);
		
		НЗ.Прочитать();
		
		Если НЗ.Количество() = 0 Тогда 
			
			МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
			
			МЗ.Сделка = Ссыл;
			МЗ.Статус = Перечисления.СтатусыСделок.Новая;
			МЗ.ПодстатусФинОтдел = Перечисления.ПодстатусыФинОтделСделок.ОплатаПолучена;
			МЗ.ДатаВремяПоследнейСменыПодстатусаФинОтдел = ТекущаяДата();
			
			МЗ.Записать();
			
		Иначе
			
			Для Каждого Запись ИЗ НЗ Цикл 
				
				Запись.ПодстатусФинОтдел = Перечисления.ПодстатусыФинОтделСделок.ОплатаПолучена;
				Запись.ДатаВремяПоследнейСменыПодстатусаФинОтдел = ТекущаяДата();
				
			КонецЦикла; 
			
			НЗ.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СделкаОплаченаЧастично И НЕ СделкаОплачена Тогда
		
		НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
		
		НЗ.Отбор.Сделка.Установить(Ссыл);
		
		НЗ.Прочитать();
		
		Если НЗ.Количество() = 0 Тогда 
			
			МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
			
			МЗ.Сделка = Ссыл;
			МЗ.Статус = Перечисления.СтатусыСделок.Новая;
			МЗ.ПодстатусФинОтдел = Перечисления.ПодстатусыФинОтделСделок.ОплаченаЧастично;
			МЗ.ДатаВремяПоследнейСменыПодстатусаФинОтдел = ТекущаяДата();
			
			МЗ.Записать();
			
		Иначе
			
			Для Каждого Запись ИЗ НЗ Цикл 
				
				Запись.ПодстатусФинОтдел = Перечисления.ПодстатусыФинОтделСделок.ОплаченаЧастично;
				Запись.ДатаВремяПоследнейСменыПодстатусаФинОтдел = ТекущаяДата();
				
			КонецЦикла; 
			
			НЗ.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ СделкаОплаченаЧастично И НЕ СделкаОплачена Тогда
		
		НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
		
		НЗ.Отбор.Сделка.Установить(Ссыл);
		
		НЗ.Прочитать();
		
		Если НЗ.Количество() = 0 Тогда 
			
			МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
			
			МЗ.Сделка = Ссыл;
			МЗ.Статус = Перечисления.СтатусыСделок.Новая;
			МЗ.ПодстатусФинОтдел = Перечисления.ПодстатусыФинОтделСделок.НеОплачена;
			МЗ.ДатаВремяПоследнейСменыПодстатусаФинОтдел = ТекущаяДата();
			
			МЗ.Записать();
			
		Иначе
			
			Для Каждого Запись ИЗ НЗ Цикл 
				
				Запись.ПодстатусФинОтдел = Перечисления.ПодстатусыФинОтделСделок.НеОплачена;
				Запись.ДатаВремяПоследнейСменыПодстатусаФинОтдел = ТекущаяДата();
				
			КонецЦикла; 
			
			НЗ.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   

Функция НайтиСчетНаОсновании(Отчет)
	
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	                 |ИЗ
	                 |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	                 |ГДЕ
	                 |	СчетНаОплатуПокупателю.Проведен = ИСТИНА
	                 |	И СчетНаОплатуПокупателю.ДокументОснование = &Отчет";
	  
	  Запрос.УстановитьПараметр("Отчет", Отчет);
	  
	  Выборка = Запрос.Выполнить().Выбрать();
	  
	  Если Выборка.Следующий() Тогда
		  
		  Возврат Выборка.Ссылка;
		  
	  КонецЕсли; 
	  
	  Возврат Неопределено;
	
КонецФункции

&ИзменениеИКонтроль("АвтоматическиИзменяемыеСтатусыОплаты")
Функция ЛГС_АвтоматическиИзменяемыеСтатусыОплаты()

	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.СтатусОплатыСчета.НеОплачен);
	Статусы.Добавить(Перечисления.СтатусОплатыСчета.ОплаченЧастично);
	#Вставка
	Статусы.Добавить(Перечисления.СтатусОплатыСчета.СогласованДляОплаты);
	Статусы.Добавить(Перечисления.СтатусОплатыСчета.ДобавленВПлатежныйКалендарь);  
	#КонецВставки

	Возврат Статусы;

КонецФункции

&ИзменениеИКонтроль("ПодготовитьТаблицуСтатусовПоступленияПоСчетам")
Функция ЛГС_ПодготовитьТаблицуСтатусовПоступленияПоСчетам(ТаблицаТоварыУслуги, ТаблицаВозвратнаяТара, ТаблицаРеквизитов)

	Если Не ЗначениеЗаполнено(ТаблицаРеквизитов)
		Или Не ЗначениеЗаполнено(ТаблицаТоварыУслуги) И Не ЗначениеЗаполнено(ТаблицаВозвратнаяТара) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Реквизиты = ТаблицаРеквизитов[0];
	Если Не ЗначениеЗаполнено(Реквизиты.СчетНаОплатуПоставщика) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТекущиеСтатусы = РегистрыСведений.СтатусыДокументов.ПолучитьСтатусыДокумента(
	Реквизиты.СчетНаОплатуПоставщика, Реквизиты.Организация);

	ТекущийСтатусОплаты      = ТекущиеСтатусы.Статус;
	ТекущийСтатусПоступления = ТекущиеСтатусы.ДополнительныйСтатус;
	
	#Удаление
	Если ЗначениеЗаполнено(ТекущийСтатусПоступления)
		И АвтоматическиИзменяемыеСтатусыПоступленияПоСчету().Найти(ТекущийСтатусПоступления) = Неопределено Тогда
		// Статус автоматически не меняется.
		Возврат Неопределено;
	КонецЕсли;
	#КонецУдаления

	Параметры = ПодготовитьПараметрыТаблицыСтатусовПоступленияПоСчетам(
	ТаблицаТоварыУслуги, ТаблицаВозвратнаяТара, ТаблицаРеквизитов);

	Реквизиты      = Параметры.Реквизиты[0]; 
	#Вставка
	 РеквизитыПоступления = Параметры.Реквизиты[0][1];
	 РеквизитыСчета1 = Параметры.Реквизиты[0][3];
	#КонецВставки
	ТоварыУслуги   = Параметры.ТоварыУслуги;
	ВозвратнаяТара = Параметры.ВозвратнаяТара;

	ТаблицаСтатусов = НоваяТаблицаСтатусов();

	// Установка управляемой блокировки
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыДокументов");
	ЭлементБлокировки.УстановитьЗначение("Организация", Реквизиты.Организация);
	ЭлементБлокировки.УстановитьЗначение("Документ",    Реквизиты.СчетНаОплатуПоставщика);
	Блокировка.Заблокировать();

	ПоступленияПоСчету = Документы.ПоступлениеТоваровУслуг.ПоступленияПоСчету(Реквизиты.СчетНаОплатуПоставщика);

	ТекущееПоступление = ПоступленияПоСчету.Найти(Реквизиты.Регистратор);
	Если ТекущееПоступление <> Неопределено Тогда
		ПоступленияПоСчету.Удалить(ТекущееПоступление);
	КонецЕсли;

	СтатусПоступления = Перечисления.СтатусыПоступленияПоСчету.Получен;

	// Товары и услуги
	ТоварыУслугиКПоступлению = Документы.ПоступлениеТоваровУслуг.ТоварыУслугиКПоступлениюПоСчету(
	Реквизиты.СчетНаОплатуПоставщика, ПоступленияПоСчету);
	Для Каждого СтрокаТаблицы Из ТоварыУслугиКПоступлению Цикл
		Если СтрокаТаблицы.ЭтоУслуга И СтрокаТаблицы.Количество = 0 Тогда
			// Если количество не указано, считаем, что услуга получается один раз.
			СтрокаТаблицы.Количество = 1;
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрокаТаблицы Из ТоварыУслуги Цикл
		НоваяСтрока = ТоварыУслугиКПоступлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, , "Количество");
		НоваяСтрока.Количество = -СтрокаТаблицы.Количество;
	КонецЦикла;

	ТоварыУслугиКПоступлению.Свернуть("ЭтоУслуга, Номенклатура, Содержание", "Количество");
	Для Каждого СтрокаТаблицы Из ТоварыУслугиКПоступлению Цикл
		Если СтрокаТаблицы.Количество > 0 Тогда
			СтатусПоступления = Перечисления.СтатусыПоступленияПоСчету.ПолученЧастично;
			Прервать;
		КонецЕсли;
	КонецЦикла;
    #Вставка
	Если РеквизитыПоступления.СуммаДокумента = РеквизитыСчета1.СуммаДокумента Тогда
		
		СтатусПоступления = Перечисления.СтатусыПоступленияПоСчету.Получен;
		
	ИначеЕсли  РеквизитыПоступления.СуммаДокумента < РеквизитыСчета1.СуммаДокумента  И РеквизитыПоступления.СуммаДокумента <> 0  Тогда
		
		СтатусПоступления = Перечисления.СтатусыПоступленияПоСчету.ПолученЧастично;   
		
	ИначеЕсли  РеквизитыПоступления.СуммаДокумента > РеквизитыСчета1.СуммаДокумента Тогда
		
		СтатусПоступления = Перечисления.СтатусыПоступленияПоСчету.ПолученЧастично;   
		
		
	Иначе
		
		СтатусПоступления = Перечисления.СтатусыПоступленияПоСчету.НеПолучен; 
		
	КонецЕсли;
	#КонецВставки
	// Возвратная тара
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВозвратнуюТару")
		И СтатусПоступления <> Перечисления.СтатусыПоступленияПоСчету.ПолученЧастично Тогда

		ВозвратнаяТараКПоступлению = Документы.ПоступлениеТоваровУслуг.ВозвратнаяТараКПоступлениюПоСчету(
		Реквизиты.СчетНаОплатуПоставщика, ПоступленияПоСчету);

		Для Каждого СтрокаТаблицы Из ВозвратнаяТара Цикл
			НоваяСтрока = ВозвратнаяТараКПоступлению.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, , "Количество");
			НоваяСтрока.Количество = -СтрокаТаблицы.Количество;
		КонецЦикла;

		ВозвратнаяТараКПоступлению.Свернуть("Номенклатура", "Количество");
		Для Каждого СтрокаТаблицы Из ВозвратнаяТараКПоступлению Цикл
			Если СтрокаТаблицы.Количество > 0 Тогда
				СтатусПоступления = Перечисления.СтатусыПоступленияПоСчету.ПолученЧастично;
				Прервать;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	НоваяСтрока = ТаблицаСтатусов.Добавить();
	НоваяСтрока.Документ = Реквизиты.СчетНаОплатуПоставщика;
	НоваяСтрока.Статус = ТекущийСтатусОплаты;
	НоваяСтрока.ДополнительныйСтатус = СтатусПоступления;

	Возврат ТаблицаСтатусов;

КонецФункции

