&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрКоманды);
	
	ОбъектыПечати = Новый СписокЗначений; 
	ИмяМакета = "Заявка автоперевозчику"; 
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Заявка автоперевозчику");
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Заявка автоперевозчику"; 
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуЗаявкаАвтоперевозчику(МассивОбъектов, ОбъектыПечати, ИмяМакета); 
	
	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуЗаявкаАвтоперевозчику(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаАвтоперевозчику"; 
	ТабличныйДокумент.Защита = Истина;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументЗаявкаАвтоперевозчику(ТабличныйДокумент, МассивОбъектов[0]); 	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументЗаявкаАвтоперевозчику(ТабДок, Док)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаАвтоперевозчику";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаАвтоперевозчику.Ссылка КАК Ссылка,
	|	ЗаявкаАвтоперевозчику.ВерсияДанных КАК ВерсияДанных,
	|	ЗаявкаАвтоперевозчику.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаявкаАвтоперевозчику.Номер КАК Номер,
	|	ЗаявкаАвтоперевозчику.Дата КАК Дата,
	|	ЗаявкаАвтоперевозчику.Проведен КАК Проведен,
	|	ЗаявкаАвтоперевозчику.ДокументОснование КАК ДокументОснование,
	|	ЗаявкаАвтоперевозчику.Перевозчик КАК Перевозчик,
	|	ЗаявкаАвтоперевозчику.Направление КАК Направление,
	|	ЗаявкаАвтоперевозчику.АдресЗагрузки КАК АдресЗагрузки,
	|	ЗаявкаАвтоперевозчику.АдресВыгрузки КАК АдресВыгрузки,
	|	ЗаявкаАвтоперевозчику.СпособВыгрузки КАК СпособВыгрузки,
	|	ЗаявкаАвтоперевозчику.СпособЗагрузки КАК СпособЗагрузки,
	|	ЗаявкаАвтоперевозчику.Тариф КАК Тариф,
	|	ЗаявкаАвтоперевозчику.Груз КАК Груз,
	|	ЗаявкаАвтоперевозчику.Вес КАК Вес,
	|	ЗаявкаАвтоперевозчику.ФИОВодителя КАК ФИОВодителя,
	|	ЗаявкаАвтоперевозчику.ПаспортныеДанныеВодителя КАК ПаспортныеДанныеВодителя,
	|	ЗаявкаАвтоперевозчику.НомерТелефонаВодителя КАК НомерТелефонаВодителя,
	|	ЗаявкаАвтоперевозчику.Комментарий КАК Комментарий,
	|	ЗаявкаАвтоперевозчику.Ответственный КАК Ответственный,
	|	ЗаявкаАвтоперевозчику.Организация КАК Организация,
	|	ЗаявкаАвтоперевозчику.МаркаГосномерАвтомобиля КАК МаркаГосномерАвтомобиля,
	|	ЗаявкаАвтоперевозчику.Контейнеры КАК Контейнеры,
	|	ЗаявкаАвтоперевозчику.ВидТранспорта КАК ВидТранспорта,
	|	ЗаявкаАвтоперевозчику.ДатаЗагрузки КАК ДатаЗагрузки,
	|	ЗаявкаАвтоперевозчику.ДатаВыгрузки КАК ДатаВыгрузки
	|ИЗ
	|	Документ.ЗаявкаАвтоперевозчику КАК ЗаявкаАвтоперевозчику
	|ГДЕ
	|	ЗаявкаАвтоперевозчику.Ссылка = &Док";
	
	Запрос.УстановитьПараметр("Док", Док);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявкаАвтоперевозчику.Заявка");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		
		ОбластьМакета = Макет.ПолучитьОбласть("Область");
		
		ОбластьМакета.Параметры.Номер = Выборка.Номер;
		ОбластьМакета.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=ДД"); 
		
		ОбластьМакета.Параметры.Перевозчик = Выборка.Перевозчик.НаименованиеПолное; 
		
		ЮрАдрПеревозчик = "";
		
		ФактАдрПеревозчик = ""; 
		
		НомТелПеревозчик = "";
		
		Для Каждого Стр Из Выборка.Перевозчик.КонтактнаяИнформация Цикл
			
			Если Стр.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда
				
				ЮрАдрПеревозчик = Стр.Представление;
				
			ИначеЕсли Стр.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
				
				ФактАдрПеревозчик = Стр.Представление;
				
			ИначеЕсли Стр.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
				
				НомТелПеревозчик = Стр.Представление;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьМакета.Параметры.ЮрАдресПеревозчика = ЮрАдрПеревозчик;
		ОбластьМакета.Параметры.ФактАдресПеревозчика = ФактАдрПеревозчик;
		ОбластьМакета.Параметры.ИННКПППеревозчика = Строка(Выборка.Перевозчик.ИНН) + ?(ЗначениеЗаполнено(Выборка.Перевозчик.КПП),"/" + Выборка.Перевозчик.КПП,"");
		ОбластьМакета.Параметры.ОГРНПеревозчика = Выборка.Перевозчик.РегистрационныйНомер;
		
		ОбластьМакета.Параметры.Организация = Выборка.Организация.НаименованиеПолное;
		ОбластьМакета.Параметры.ИННКППОрганизации = Строка(Выборка.Организация.ИНН) + "/" + Строка(Выборка.Организация.КПП); 
		
		ЮрАдрОрг = "";
		
		ФактАдрОрг = "";
		
		Для Каждого Стр Из Выборка.Организация.КонтактнаяИнформация Цикл
			
			Если Стр.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
				
				ЮрАдрОрг = Стр.Представление;
				
			ИначеЕсли Стр.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации Тогда
				
				ФактАдрОрг = Стр.Представление;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьМакета.Параметры.ЮрАдресОрганизации = ЮрАдрОрг;
		ОбластьМакета.Параметры.ФактАдресОрганизации = ФактАдрОрг;
		
		ОбластьМакета.Параметры.ПеревозчикСокращенно = Выборка.Перевозчик.НаименованиеПолное;
		ОбластьМакета.Параметры.НомерТелефонаПеревозчика = НомТелПеревозчик;
		
		ОбластьМакета.Параметры.Направление = Выборка.Направление; 
		
		ОбластьМакета.Параметры.ДатаЗагрузки = Формат(Выборка.ДатаЗагрузки,"ДФ='dd.MM.yyyy""г.""'");
		ОбластьМакета.Параметры.АдресЗагрузки = Выборка.АдресЗагрузки;
		
		ОбластьМакета.Параметры.ДатаВыгрузки = Формат(Выборка.ДатаВыгрузки,"ДФ='dd.MM.yyyy""г.""'");
		ОбластьМакета.Параметры.АдресВыгрузки = Выборка.АдресВыгрузки; 
		
		ОбластьМакета.Параметры.Груз = Выборка.Груз;
		ОбластьМакета.Параметры.Вес = Выборка.Вес;	
		ОбластьМакета.Параметры.Контейнеры = Выборка.Контейнеры;
		ОбластьМакета.Параметры.ТипКузова = Выборка.ВидТранспорта;
		ОбластьМакета.Параметры.СпособВыгрузки = Выборка.СпособВыгрузки;
		ОбластьМакета.Параметры.СпособЗагрузки = Выборка.СпособЗагрузки;
		ОбластьМакета.Параметры.Тариф = Выборка.Тариф; 
		ОбластьМакета.Параметры.ТарифПрописью = ЧислоПрописью(Выборка.Тариф, "Л = ru_RU; ДП = Истина");
		
		ОбластьМакета.Параметры.МаркаГосномерАвто = Выборка.МаркаГосномерАвтомобиля;
		ОбластьМакета.Параметры.ФИОВодителя = Выборка.ФИОВодителя;
		ОбластьМакета.Параметры.ПаспортныеДанныеВодителя = Выборка.ПаспортныеДанныеВодителя;
		ОбластьМакета.Параметры.НомерТелефонаВодителя = Выборка.НомерТелефонаВодителя;
		
		ОбластьМакета.Параметры.ОрганизацияСокращенно = Выборка.Организация;
		ОбластьМакета.Параметры.ПеревозчикСокращенно = Выборка.Перевозчик;
		
		ЗапросКонтакта = Новый Запрос;
		ЗапросКонтакта.Текст = "ВЫБРАТЬ
		                       |	КонтактныеЛица.Ссылка КАК Ссылка,
		                       |	КонтактныеЛица.Фамилия КАК Фамилия,
		                       |	КонтактныеЛица.Имя КАК Имя,
		                       |	КонтактныеЛица.Отчество КАК Отчество
		                       |ИЗ
		                       |	Справочник.КонтактныеЛица КАК КонтактныеЛица
		                       |ГДЕ
		                       |	КонтактныеЛица.ОбъектВладелец = &Контрагент
		                       |	И КонтактныеЛица.ВидКонтактногоЛица = &ВидКонтактногоЛица";
		
		ЗапросКонтакта.УстановитьПараметр("Контрагент", Выборка.Перевозчик);
		ЗапросКонтакта.УстановитьПараметр("ВидКонтактногоЛица", Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента);
		
		ВыборкаКонтакта = ЗапросКонтакта.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ОбластьМакета.Параметры.КонтактноеЛицоПеревозчика = Строка(ВыборкаКонтакта.Фамилия)	+ " " + Лев(ВыборкаКонтакта.Имя, 1) + "." + Лев(ВыборкаКонтакта.Отчество, 1) + ".";
			
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
	
КонецФункции  
