
&НаКлиенте
Процедура ОК(Команда)

	ЕстьНезаполненные = Ложь;
	
	Для Каждого Стр Из ЭтотОбъект.РаспределениеПоСделкам Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Сделка) ИЛИ НЕ ЗначениеЗаполнено(Стр.Сумма) Тогда
			
			ЕстьНезаполненные = Истина;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ЕстьНезаполненные Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения();
		
		ПоказатьПредупреждение(ОписаниеОповещения, "Заполнены не все значения в списке", 60, "Ошибка при сохранении");
		
		Отказ = Истина;
		
		Возврат;   
		
	КонецЕсли;
	
	Если РаспределениеПоСделкам.Итог("Сумма") < Сумма Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения();
		
		ПоказатьПредупреждение(ОписаниеОповещения, "Сумма распределения меньше суммы строки в документе", 60, "Ошибка при сохранении");
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	ТекстовоеПредставление = "";
	МассивДобавляемыхСтрокРаспределения = Новый Массив;
	
	Для Каждого Стр Из ЭтотОбъект.РаспределениеПоСделкам Цикл
		
		Если ТекстовоеПредставление = "" Тогда
			
			ТекстовоеПредставление = ПолучитьНомерДокумента(Стр.Сделка) + " - " + Формат(Стр.Сумма,"ЧДЦ=2; ЧГ=");	
			
		Иначе
			
			ТекстовоеПредставление = ТекстовоеПредставление + Символы.ПС + ПолучитьНомерДокумента(Стр.Сделка) + " - " + Формат(Стр.Сумма,"ЧДЦ=2; ЧГ=");
			
		КонецЕсли; 
		
		СтруктураДобавляемыхСтрокРаспределения = Новый Структура;
		СтруктураДобавляемыхСтрокРаспределения.Вставить("Сделка", Стр.Сделка);
		СтруктураДобавляемыхСтрокРаспределения.Вставить("Сумма", Стр.Сумма);
		
		МассивДобавляемыхСтрокРаспределения.Добавить(СтруктураДобавляемыхСтрокРаспределения);
		
	КонецЦикла; 
	
	СтруктураВозвратаПараметров = Новый Структура;
	СтруктураВозвратаПараметров.Вставить("ТекстовоеПредставление", ТекстовоеПредставление); 
	СтруктураВозвратаПараметров.Вставить("КлючСвязи", КлючСвязи);
	СтруктураВозвратаПараметров.Вставить("МассивДобавляемыхСтрокРаспределения", МассивДобавляемыхСтрокРаспределения);
	
		
		Оповестить("ВыполненоРаспределениеСтрокиПоСделкамСчетПоставщикаТовары", СтруктураВозвратаПараметров, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор); 
		
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьНомерДокумента(Док)
	
	Возврат Док.Номер;
	
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючСвязи = Параметры.КлючСвязи;
	Номенклатура = Параметры.Номенклатура;
	Сумма = Параметры.Сумма; 
	ВидТЧ = Параметры.ВидТЧ;  
	СуммаОсталось = Параметры.Сумма - ЭтотОбъект.РаспределениеПоСделкам.Итог("Сумма");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаспределениеПоСделкам()
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", КлючСвязи);
	
	НайденныеСтроки = ВладелецФормы.Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
		
		СтрРаспределение = РаспределениеПоСделкам.Добавить(); 
		СтрРаспределение.Сделка = НайденнаяСтрока.Сделка;
		СтрРаспределение.Сумма = НайденнаяСтрока.СуммаРаспределения;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоСделкамСуммаПриИзменении(Элемент)
	
	Если ЭтотОбъект.РаспределениеПоСделкам.Итог("Сумма") > Сумма Тогда
		
		Элементы.РаспределениеПоСделкам.ТекущиеДанные.Сумма = 0;
		
		СуммаОсталось = Сумма - ЭтотОбъект.РаспределениеПоСделкам.Итог("Сумма");
		
		ОписаниеОповещения = Новый ОписаниеОповещения();
		
		ПоказатьПредупреждение(ОписаниеОповещения, "Сумма распределения по сделкам не может быть больше суммы услуги", 60, "Ошибка при вводе суммы");
			
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоСделкамПриИзменении(Элемент)
	
		Элементы.РаспределениеПоСделкамСумма.ТекстПодвала = "Итого " + Формат(РаспределениеПоСделкам.Итог("Сумма"),"ЧДЦ=2; ЧГ="); 
		
		СуммаОсталось = Сумма - ЭтотОбъект.РаспределениеПоСделкам.Итог("Сумма");
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    ЗаполнитьРаспределениеПоСделкам();
	
	СуммаОсталось = Сумма - ЭтотОбъект.РаспределениеПоСделкам.Итог("Сумма");

КонецПроцедуры
