Процедура ВключитьРегистрациюАктивностиПользователя() Экспорт
	ПодключитьОбработчикОжидания("ПроверитьАктивностьПользователя", 60); // Проверка каждые 60 секунд
КонецПроцедуры       

// Процедура для проверки активности пользователя
Процедура ПроверитьАктивностьПользователя() Экспорт
	
	ИсторияАктивности = ИсторияРаботыПользователя.Получить();
	
	ДатаВремяАктивности = Дата(1,1,1);
	
	ЗавершитьСеанс = Ложь;
	
	АктивныйЭлемент = Неопределено;
	
	Для Каждого СтрИсторияАктивности Из ИсторияАктивности Цикл
		
		Если СтрИсторияАктивности.Дата > ДатаВремяАктивности Тогда
			
			ДатаВремяАктивности = СтрИсторияАктивности.Дата;
			
			АктивныйЭлемент = СтрИсторияАктивности.НавигационнаяСсылка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПредыдущееЗначениеТекущегоЭлемента = АктивностьПользователейСервер.ПолучитьПредыдущееЗначениеТекущегоЭлемента();
	
	ТекущееОкно = АктивноеОкно();
	
	Если ТекущееОкно <> Неопределено Тогда
		
		Если ТекущееОкно.Содержимое.Количество() > 0 Тогда
			
			ТекущаяФорма = ТекущееОкно.Содержимое[0];
			
			ТекущийЭлемент = ТекущаяФорма.ТекущийЭлемент;
			
			Если ТекущийЭлемент <> Неопределено Тогда
				
				ТекущийЭлементСтрока = Строка(ТекущаяФорма.УникальныйИдентификатор) + "_";
				
				Если ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
					
					Попытка
						
						ТекущийЭлементСтрока = ТекущийЭлементСтрока + ТекущийЭлемент.ТекущийЭлемент.Имя;
						
					Исключение
						
						ТекущийЭлементСтрока = ТекущийЭлементСтрока + Строка(ТекущийЭлемент.ТекущийЭлемент);	
						
					КонецПопытки;
					
				ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") И ТекущийЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента Тогда
					
					ТекущийЭлементСтрока = ТекущийЭлементСтрока + ТекущийЭлемент.ТекущаяОбласть.Имя;
					
				Иначе
					
					ТекущийЭлементСтрока = ТекущийЭлементСтрока + ТекущаяФорма.ТекущийЭлемент.Имя;
					
				КонецЕсли;
				
				Если ТекущийЭлементСтрока <> ПредыдущееЗначениеТекущегоЭлемента Тогда
					
					АктивныйЭлемент = ТекущийЭлементСтрока;
					
					ДатаВремяАктивности = ТекущаяДата();
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗавершитьСеанс = АктивностьПользователейСервер.РегистрацияАктивностиПользователя(ДатаВремяАктивности,
		АктивныйЭлемент);
		
		ИсторияРаботыПользователя.Очистить();
		
	КонецЕсли;
	
	Если ЗавершитьСеанс Тогда 
		
		ОтключитьОбработчикОжидания("ПроверитьАктивностьПользователя");
		
		// 1. Создаем оповещение, куда вернется ответ
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПредупрежденияОЗавершении", ОбщегоНазначенияКлиент.ОбщийМодуль("АктивностьПользователейКлиент"));
		
		// 2. Настраиваем стандартный набор кнопок (Да / Нет)
		КнопкиДиалога = РежимДиалогаВопрос.ДаНет;
		
		// 3. Вызываем окно с таймаутом 60 секунд.
		// Если время выйдет, автоматически зафиксируется ответ "Нет"
		ПоказатьВопрос(
		ОписаниеОповещения, 
		"Внимание! Обнаружено отсутствие активности. Работа системы будет завершена через 60 секунд." + Символы.ПС + "Желаете продолжить работу?", 
		КнопкиДиалога, 
		60,                              // Таймаут в секундах
		КодВозвратаДиалога.Да,           // Кнопка по умолчанию
		"Бездействие сеанса", 			 // Заголовок окна
		КодВозвратаДиалога.Нет           // Кнопка, которая сработает по ТАЙМАУТУ
		);
		
		
	Иначе 
		
		ПодключитьОбработчикОжидания("ПроверитьАктивностьПользователя", 60); // Проверка каждые 60 секунд	
		
	КонецЕсли;
	
КонецПроцедуры