
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Квартал = НачалоКвартала(ТекущаяДата());
	
	УстановитьОтборСписка();

КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборСписка()
	
	Список.Отбор.Элементы.Очистить();
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Вывезен); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Доставлен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.СданПорожний); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Выгружен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыставленыВсеРасходы);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ДокументыПодготовлены);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Закрыта);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Отменена);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Задержана);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ПретензияСуд);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Задержана);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыходИзПорта);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.SWBОформлен);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов; 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квартал"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = КонецКвартала(ЭтотОбъект.Квартал);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квартал"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = НачалоКвартала(ЭтотОбъект.Квартал);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВсеФайлыДобавлены"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОтборКонтрагент) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
		
		ЭлементОтбора.ПравоеЗначение = ЭтотОбъект.ОтборКонтрагент;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОтборОтветственный) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
		
		ЭлементОтбора.ПравоеЗначение = ЭтотОбъект.ОтборОтветственный;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьИнформациюОДокументах(Команда)
	
	Если Элементы.ИнформацияОДокументах.Видимость = Ложь Тогда
		
		Элементы.ИнформацияОДокументах.Видимость = Истина;
		
		Элементы.СвернутьРазвернутьИнформациюОДокументах.Картинка = БиблиотекаКартинок.ПерейтиВперед; 
		
		ОбновитьИнформациюОДокументах();
		
	Иначе
		
		Элементы.ИнформацияОДокументах.Видимость = Ложь;
		Элементы.СвернутьРазвернутьИнформациюОДокументах.Картинка = БиблиотекаКартинок.ПерейтиНазад;
		
	КонецЕсли;
	
КонецПроцедуры      

&НаКлиенте
Процедура ОбновитьИнформациюОДокументах()	
	
	Если Элементы.ИнформацияОДокументах.Видимость Тогда
		
		 МассивЗначенийИнформацияДокументах = ПолучитьИнформациюОДокументахПоСделке(Элементы.Список.ТекущиеДанные.Ссылка);
		 
		 ЭтотОбъект.ИнформацияОДокументах.Очистить();
		 
		 Для Каждого СтрМассивЗначенийИнформацияДокументах ИЗ МассивЗначенийИнформацияДокументах Цикл 
			 
			   Стр = ЭтотОбъект.ИнформацияОДокументах.Добавить();
			   
			   ЗаполнитьЗначенияСвойств(Стр, СтрМассивЗначенийИнформацияДокументах);
			 
		 КонецЦикла;	
		 
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьИнформациюОДокументахПоСделке(Сделка)  
	
	МассивЗначенийИнформацияДокументах = Новый Массив;  
	
	Если Сделка.ТипДокументов <> Перечисления.ТипыДокументовСборДокументов.Неизвестно Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СделкаСборДокументов.ВидДокумента КАК ВидДокумента,
		|	СделкаСборДокументов.Необходим КАК Необходим,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА СделкаПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК Добавлен
		|ИЗ
		|	Документ.Сделка.СборДокументов КАК СделкаСборДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
		|		ПО СделкаСборДокументов.Ссылка = СделкаПрисоединенныеФайлы.ВладелецФайла
		|			И СделкаСборДокументов.ВидДокумента = СделкаПрисоединенныеФайлы.ВидФайла
		|ГДЕ
		|	СделкаСборДокументов.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкаСборДокументов.ВидДокумента,
		|	СделкаСборДокументов.Необходим";
		
		Запрос.УстановитьПараметр("Ссылка", Сделка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ЕстьЭкспедиторскаяРасписка = Ложь;
		ЕстьПриложениеСПодписьюСДвухСторон = Ложь;
		ЕстьПоручениеЭкспедитораСПодписью = Ложь;
		ЕстьПоручениеРавноПриложение = Ложь;
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураЗначенийИнформацияОДокументах = Новый Структура;
			
			СтруктураЗначенийИнформацияОДокументах.Вставить("ВидДокумента", Выборка.ВидДокумента); 
			СтруктураЗначенийИнформацияОДокументах.Вставить("Необходим", Выборка.Необходим);
			СтруктураЗначенийИнформацияОДокументах.Вставить("Добавлен", Выборка.Добавлен); 
			
			Если СтруктураЗначенийИнформацияОДокументах.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ЭкспедиторскаяРасписка И СтруктураЗначенийИнформацияОДокументах.Добавлен Тогда
				
				ЕстьЭкспедиторскаяРасписка = Истина;
				
			ИначеЕсли СтруктураЗначенийИнформацияОДокументах.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПриложениеСПодписьюСДвухСторон И СтруктураЗначенийИнформацияОДокументах.Добавлен Тогда
				
				ЕстьПриложениеСПодписьюСДвухСторон = Истина;	
				
			ИначеЕсли СтруктураЗначенийИнформацияОДокументах.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеЭкспедитораСПодписью И СтруктураЗначенийИнформацияОДокументах.Добавлен Тогда
				
				ЕстьПоручениеЭкспедитораСПодписью = Истина;
				
			ИначеЕсли СтруктураЗначенийИнформацияОДокументах.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеРавноПриложение И СтруктураЗначенийИнформацияОДокументах.Добавлен Тогда
				
				ЕстьПоручениеРавноПриложение = Истина;	
				
			КонецЕсли;
			
			МассивЗначенийИнформацияДокументах.Добавить(СтруктураЗначенийИнформацияОДокументах);
			
		КонецЦикла; 
		
		Для Каждого Стр Из МассивЗначенийИнформацияДокументах Цикл 
			
			Если (Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ЭкспедиторскаяРасписка ИЛИ Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПриложениеСПодписьюСДвухСторон
				ИЛИ Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеЭкспедитораСПодписью) И ЕстьПоручениеРавноПриложение Тогда
				
				Стр.Необходим = Ложь;
				
			ИначеЕсли Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеРавноПриложение И (ЕстьЭкспедиторскаяРасписка
				ИЛИ ЕстьПриложениеСПодписьюСДвухСторон ИЛИ ЕстьПоручениеЭкспедитораСПодписью) Тогда  
				
				Стр.Необходим = Ложь;
								
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивЗначенийИнформацияДокументах;
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	 ОбновитьИнформациюОДокументах();
	
КонецПроцедуры

&НаКлиенте
Процедура КварталНазад(Команда)     
	
	ЭтотОбъект.Квартал = ДобавитьМесяц(НачалоМесяца(ЭтотОбъект.Квартал), -3);
	
	УстановитьОтборСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура КварталВперед(Команда)
	
	ЭтотОбъект.Квартал = ДобавитьМесяц(НачалоМесяца(ЭтотОбъект.Квартал), 3);
	
	УстановитьОтборСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ОбновитьИнформациюОДокументах();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	 УстановитьОтборСписка();
	 
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	
	УстановитьОтборСписка();

КонецПроцедуры
