
&ИзменениеИКонтроль("ПечатьДокументов")
Процедура ЛГС_ПечатьДокументов(КоллекцияПечатныхФорм, Знач ОбъектыПечати, ДополнительныеПараметры)

	ПараметрыПечати = ПараметрыПечати();

	ВладелецФормы = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПечати, ДополнительныеПараметры);
		ВладелецФормы = ПараметрыПечати.ВладелецФормы;
		ПараметрыПечати.Удалить("ВладелецФормы");
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("ФормаКлиентскогоПриложения") Тогда 
		ВладелецФормы = ДополнительныеПараметры; // Поддержка обратной совместимости с 3.0.2.
	КонецЕсли;

	Если ОбъектыПечати = Неопределено Тогда
		ОбъектыПечати = Новый СписокЗначений;
	КонецЕсли;

	КлючУникальности = Строка(Новый УникальныйИдентификатор);

	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ПараметрыОткрытия.Вставить("ОбъектыПечати", ОбъектыПечати);
	ПараметрыОткрытия.Вставить("ПараметрыПечати", ПараметрыПечати);
	ПараметрыОткрытия.Вставить("ИменаМакетов", Новый Массив);

	Для Каждого ОписаниеПечатнойФормы Из КоллекцияПечатныхФорм Цикл
		ПараметрыОткрытия.ИменаМакетов.Добавить(ОписаниеПечатнойФормы.ИмяМакета);
	КонецЦикла;
	
	#Вставка
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда 
		
		Если ДополнительныеПараметры.Свойство("ОбъектыПечати") Тогда
			
			ПараметрыОткрытия.Вставить("ОбъектыПечати", ДополнительныеПараметры.ОбъектыПечати);
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ПараметрКоманды") Тогда
			
			ПараметрыОткрытия.Вставить("ПараметрКоманды", ДополнительныеПараметры.ПараметрКоманды);
			
		КонецЕсли;
		
	КонецЕсли;	
		
	#КонецВставки
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);

КонецПроцедуры
