Процедура ЗапросИсходящихДокументов()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	                      |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	                      |		КОНЕЦ) КАК СуммаБезНДССчета,
	                      |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
	                      |	СУММА(СчетНаОплатуПокупателюТовары.СуммаНДС) КАК СуммаНДССчета,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	                      |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	                      |		КОНЕЦ) КАК СуммаСНДССчета
	                      |ПОМЕСТИТЬ ВТ_СчетаПокупателям
	                      |ИЗ
	                      |	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	                      |ГДЕ
	                      |	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
	                      |	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	СчетНаОплатуПокупателюТовары.Ссылка,
	                      |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугТовары.Ссылка КАК Акт,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	                      |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	                      |		КОНЕЦ) КАК СуммаБезНДСАкта,
	                      |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
	                      |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
	                      |	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА РеализацияТоваровУслугТовары.Сумма
	                      |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	                      |		КОНЕЦ) КАК СуммаСНДСАкта
	                      |ПОМЕСТИТЬ ВТ_Реализации
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                      |ГДЕ
	                      |	РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	                      |	И РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугТовары.Ссылка,
	                      |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
	                      |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугУслуги.Ссылка,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	                      |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	                      |		КОНЕЦ),
	                      |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	                      |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	                      |	СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
	                      |	СУММА(ВЫБОР
	                      |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА РеализацияТоваровУслугУслуги.Сумма
	                      |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	                      |		КОНЕЦ)
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	                      |ГДЕ
	                      |	РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	                      |	И РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугУслуги.Ссылка,
	                      |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	                      |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	                      |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	                      |		КОНЕЦ),
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	                      |	СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
	                      |	СУММА(ВЫБОР
	                      |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
	                      |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	                      |		КОНЕЦ)
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	                      |ГДЕ
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	                      |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	                      |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	СделкаВнутренниеДоходы.НаименованиеДохода,
	                      |	СУММА(СделкаВнутренниеДоходы.Сумма),
	                      |	СделкаВнутренниеДоходы.Ссылка,
	                      |	СделкаВнутренниеДоходы.Ссылка,
	                      |	0,
	                      |	СделкаВнутренниеДоходы.Сумма
	                      |ИЗ
	                      |	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	                      |ГДЕ
	                      |	СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	                      |	И СделкаВнутренниеДоходы.Ссылка = &Сделка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	СделкаВнутренниеДоходы.НаименованиеДохода,
	                      |	СделкаВнутренниеДоходы.Сумма,
	                      |	СделкаВнутренниеДоходы.Ссылка,
	                      |	СделкаВнутренниеДоходы.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОтчетКомитентуОПродажахТовары.Ссылка,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	                      |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	                      |		КОНЕЦ),
	                      |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	                      |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	                      |	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                      |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
	                      |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
	                      |		КОНЕЦ)
	                      |ИЗ
	                      |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	                      |ГДЕ
	                      |	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	                      |	И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка = &Сделка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	                      |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	                      |	ОтчетКомитентуОПродажахТовары.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет) КАК Счет,
	                      |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка) КАК Сделка,
	                      |	ВТ_Реализации.Акт КАК Акт,
	                      |	СУММА(ВТ_Реализации.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	                      |	СУММА(ВТ_Реализации.СуммаНДСАкта) КАК СуммаНДСАкта,
	                      |	СУММА(ВТ_Реализации.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	                      |	СУММА(ВТ_СчетаПокупателям.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	                      |	СУММА(ВТ_СчетаПокупателям.СуммаНДССчета) КАК СуммаНДССчета,
	                      |	СУММА(ВТ_СчетаПокупателям.СуммаСНДССчета) КАК СуммаСНДССчета
	                      |ПОМЕСТИТЬ ВТ_Исходящие
	                      |ИЗ
	                      |	ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
	                      |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	                      |		ПО ВТ_СчетаПокупателям.Сделка = ВТ_Реализации.Сделка
	                      |			И ВТ_СчетаПокупателям.Счет = ВТ_Реализации.Счет
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет),
	                      |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка),
	                      |	ВТ_Реализации.Акт
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Исходящие.Счет КАК Счет,
	                      |	ВТ_Исходящие.Акт КАК Ссылка,
	                      |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	                      |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	                      |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	                      |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	                      |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	                      |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
	                      |	СтатусыДокументов.Статус КАК Статус
	                      |ИЗ
	                      |	ВТ_Исходящие КАК ВТ_Исходящие
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	                      |		ПО ВТ_Исходящие.Счет = СтатусыДокументов.Документ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_Исходящие.Счет,
	                      |	ВТ_Исходящие.Акт,
	                      |	СтатусыДокументов.Статус
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Счет");
	
	Запрос.УстановитьПараметр("Сделка", ЭтотОбъект);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
	КонецЕсли;
	
	
		
		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапросИсход = Новый Запрос();
	ЗапросВход = Новый Запрос();
	ЗапросАктСверки = Новый Запрос();
	
	ЗапросИсход.Текст = ТекстЗапросаИсходящиеСчета();
	ЗапросВход.Текст = ТекстЗапросаВходящиеСчета();
	ЗапросАктСверки.Текст = ТекстЗапросаАктСверки();
	
	ЗапросИсход.УстановитьПараметр("Сделка", Параметры.Сделка);
	ЗапросВход.УстановитьПараметр("Сделка", Параметры.Сделка);
	
	ЭтаФорма.Заголовок = "Документы по "+СтрЗаменить(Строка(Параметры.Сделка),"Сделка","сделке");
	
	РезультатИсход = ЗапросИсход.Выполнить().Выбрать();
	РезультатВход = ЗапросВход.Выполнить().Выбрать();
	
	ИмяРеквизитаАкт 		= "Акт";
	ИмяРеквизитаСчет 		= "Счет";
	ИмяРеквизитаСф 			= "СчетФактура";
	ИмяРеквизитаАктаСверки 	= "АктСверки";
	
	СтруктураИменГруппировок = Новый Структура;
	СтруктураИменГруппировок.Вставить("ИмяГруппыСтр","ГруппаСтр");
	СтруктураИменГруппировок.Вставить("ИмяГруппыАкт","ГруппаАкт");
	СтруктураИменГруппировок.Вставить("ИмяГруппыСчет","ГруппаСчет");
	СтруктураИменГруппировок.Вставить("ИмяГруппыСФ","ГруппаСФ");
	СтруктураИменГруппировок.Вставить("ИмяГруппыАктСверки","ГруппаАктСверки");
	
	Пока РезультатИсход.Следующий() Цикл
		
		ИмяГруппы = "ИсходящиеДокументы";
		
		ОбработатьДанныеЗапроса(ИмяГруппы, РезультатИсход, ИмяРеквизитаСчет, ИмяРеквизитаСф, ИмяРеквизитаАкт, ИмяРеквизитаАктаСверки, СтруктураИменГруппировок);
	
		ИмяРеквизитаСчет = ИмяРеквизитаСчет + 1;
		ИмяРеквизитаАкт = ИмяРеквизитаАкт + 1;
		ИмяРеквизитаСф = ИмяРеквизитаСф + 1;
		ИмяРеквизитаАктаСверки = ИмяРеквизитаАктаСверки + 1;
		
		СтруктураИменГруппировок.ИмяГруппыСтр = СтруктураИменГруппировок.ИмяГруппыСтр + 1;
		СтруктураИменГруппировок.ИмяГруппыАкт = СтруктураИменГруппировок.ИмяГруппыАкт + 1;
		СтруктураИменГруппировок.ИмяГруппыСчет = СтруктураИменГруппировок.ИмяГруппыСчет + 1;
		СтруктураИменГруппировок.ИмяГруппыСФ = СтруктураИменГруппировок.ИмяГруппыСФ + 1;
		СтруктураИменГруппировок.ИмяГруппыАктСверки = СтруктураИменГруппировок.ИмяГруппыАктСверки + 1;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьДанныеЗапроса(ИмяГруппы, Результат, ИмяРеквизитаСчет, ИмяРеквизитаСф, ИмяРеквизитаАкт, ИмяРеквизитаАктаСверки,  ИменаГрупп)

	СФ = Неопределено;
	
	Акт = Результат.Ссылка;
	Если Акт <> Null Тогда
		СФ = НайтиСФПоОснованию(Акт);
	КонецЕсли;
		
	Счет = Результат.Счет;
	
	Если Акт <> Null Тогда
		
		Если ТипЗнч(Акт) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
			Если Акт.ЭтоУниверсальныйДокумент Тогда
				СоздатьРеквизитИЭлемент(ИмяГруппы, ИмяРеквизитаАкт, "УПД №"+ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Акт.Номер),Акт, ИменаГрупп);
			Иначе
				СоздатьРеквизитИЭлемент(ИмяГруппы, ИмяРеквизитаАкт, "Акт №"+ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Акт.Номер),Акт, ИменаГрупп);
			КонецЕсли;
			
			Если СФ <> Неопределено Тогда
				СоздатьРеквизитИЭлемент(ИмяГруппы, ИмяРеквизитаСф, "Счет-фактура №"+ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СФ.Номер),СФ, ИменаГрупп);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Акт) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			
			СоздатьРеквизитИЭлемент(ИмяГруппы, ИмяРеквизитаАкт, "Отчет №"+ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Акт.Номер),Акт, ИменаГрупп);		
			
		КонецЕсли;
				
	КонецЕсли;
	
	Если Счет <> Null Тогда		
		СоздатьРеквизитИЭлемент(ИмяГруппы, ИмяРеквизитаСчет, "Счет №"+ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Счет.Номер),Счет, ИменаГрупп);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитИЭлемент(ИмяГруппы, ИмяРеквизита, ЗначениеСтроки, ЗначениеСсылки, ИменаГрупп)
	
	ГруппаФормы = ЭтаФорма.Элементы.Найти(ИмяГруппы);

	СписокТипов = Новый Массив;
    СписокТипов.Добавить(Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
    СписокТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	СписокТипов.Добавить(Тип("ДокументСсылка.СчетФактураВыданный"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	СписокТипов.Добавить(Тип("Строка"));
	
	ДобавляемыеРеквизиты	= Новый Массив;
	
	Реквизит_НаименованиеДляПечати = Новый РеквизитФормы(ИмяРеквизита,	Новый ОписаниеТипов(СписокТипов),, ИмяРеквизита);
	//Реквизит_НаименованиеДляПечати = Новый РеквизитФормы(ИмяРеквизита, ИмяРеквизита,,,Новый ОписаниеТипов(СписокТипов));
	ДобавляемыеРеквизиты.Добавить(Реквизит_НаименованиеДляПечати);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если ГруппаФормы <> Неопределено Тогда
		
		ГруппаСтр = ЭтаФорма.Элементы.Найти(ИменаГрупп.ИмяГруппыСтр);
		ГруппаСчет = ЭтаФорма.Элементы.Найти(ИменаГрупп.ИмяГруппыСчет);
		ГруппаАкт = ЭтаФорма.Элементы.Найти(ИменаГрупп.ИмяГруппыАкт);
		ГруппаСФ = ЭтаФорма.Элементы.Найти(ИменаГрупп.ИмяГруппыСФ);
		Если ГруппаСтр = Неопределено Тогда
			
			ГруппаСтр = ЭтаФорма.Элементы.Добавить(ИменаГрупп.ИмяГруппыСтр, Тип("ГруппаФормы"),ГруппаФормы);
			ГруппаСтр.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСтр.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСтр.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаСтр.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			ГруппаСчет = ЭтаФорма.Элементы.Добавить(ИменаГрупп.ИмяГруппыСчет, Тип("ГруппаФормы"),ГруппаСтр);
			ГруппаСчет.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСчет.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСчет.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаСчет.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			ГруппаАкт = ЭтаФорма.Элементы.Добавить(ИменаГрупп.ИмяГруппыАкт, Тип("ГруппаФормы"),ГруппаСтр);
			ГруппаАкт.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаАкт.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаАкт.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаАкт.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			ГруппаСФ = ЭтаФорма.Элементы.Добавить(ИменаГрупп.ИмяГруппыСФ, Тип("ГруппаФормы"),ГруппаСтр);
			ГруппаСФ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСФ.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСФ.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаСФ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;				
			
		КонецЕсли;	
					
		Если ЭтаФорма.Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
			
			Если СтрНайти(ЗначениеСтроки,"Счет №") <> 0 Тогда
				
				ЭлементФормы = ЭтаФорма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ГруппаСчет);
				ЭлементФормы.УстановитьДействие("Нажатие", "НажатиеСчет");	
				
			ИначеЕсли СтрНайти(ЗначениеСтроки,"Акт №") <> 0 Тогда
				
				ЭлементФормы = ЭтаФорма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ГруппаАкт);
				ЭлементФормы.УстановитьДействие("Нажатие", "НажатиеАкт");	
				
			ИначеЕсли СтрНайти(ЗначениеСтроки,"УПД №") <> 0 Тогда
				
				ЭлементФормы = ЭтаФорма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ГруппаАкт);
				ЭлементФормы.УстановитьДействие("Нажатие", "НажатиеУПД");
				
			ИначеЕсли СтрНайти(ЗначениеСтроки,"Счет-фактура №") <> 0 Тогда
				
				ЭлементФормы = ЭтаФорма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ГруппаСФ);
				ЭлементФормы.УстановитьДействие("Нажатие", "НажатиеСф");
				
			ИначеЕсли СтрНайти(ЗначениеСтроки,"Отчет №") <> 0 Тогда
				
				ЭлементФормы = ЭтаФорма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ГруппаАкт);
				ЭлементФормы.УстановитьДействие("Нажатие", "НажатиеОтчет");
				
			КонецЕсли;
			
			ЭлементФормы.Вид = ВидПоляФормы.ПолеНадписи;
			ЭлементФормы.ПутьКДанным = ИмяРеквизита;
			ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет; 
			ЭлементФормы.Гиперссылка = Истина;
			
		КонецЕсли;   
		
	КонецЕсли;
	
	ЭтаФорма[ИмяРеквизита] = ЗначениеСтроки;
	
	СтрСоотв = СоответствиеРеквизитовИСсылок.Добавить();
	СтрСоотв.ИмяРеквизита = ИмяРеквизита; 
	СтрСоотв.СсылкаНаДокумент = ЗначениеСсылки;
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеУПД(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
			
	ПараметрыОтбора = Новый Структура("ИмяРеквизита", Элемент.Имя);
	
	НайденныеСтроки = СоответствиеРеквизитовИСсылок.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Ссылка = СтрНайденнаяСтрока.СсылкаНаДокумент;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИмяФайла = ЭтотОбъект[Элемент.Имя];
	
	ТабличныйДокумент = ТабДокУПД(Ссылка);
	
	ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеСчет(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
			
	ПараметрыОтбора = Новый Структура("ИмяРеквизита", Элемент.Имя);
	
	НайденныеСтроки = СоответствиеРеквизитовИСсылок.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Ссылка = СтрНайденнаяСтрока.СсылкаНаДокумент;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИмяФайла = ЭтотОбъект[Элемент.Имя];
	
	ТабличныйДокумент = ТабДокСчет(Ссылка);
	
	ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеАкт(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
			
	ПараметрыОтбора = Новый Структура("ИмяРеквизита", Элемент.Имя);
	
	НайденныеСтроки = СоответствиеРеквизитовИСсылок.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Ссылка = СтрНайденнаяСтрока.СсылкаНаДокумент;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИмяФайла = ЭтотОбъект[Элемент.Имя];
	
	ТабличныйДокумент = ТабДокАкт(Ссылка);
	
	ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла);
	
КонецПроцедуры 

&НаКлиенте
Процедура НажатиеОтчет(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
			
	ПараметрыОтбора = Новый Структура("ИмяРеквизита", Элемент.Имя);
	
	НайденныеСтроки = СоответствиеРеквизитовИСсылок.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Ссылка = СтрНайденнаяСтрока.СсылкаНаДокумент;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИмяФайла = ЭтотОбъект[Элемент.Имя];
	
	ТабличныйДокумент = ТабДокОтчет(Ссылка);
	
	ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеСф(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
			
	ПараметрыОтбора = Новый Структура("ИмяРеквизита", Элемент.Имя);
	
	НайденныеСтроки = СоответствиеРеквизитовИСсылок.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Ссылка = СтрНайденнаяСтрока.СсылкаНаДокумент;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИмяФайла = ЭтотОбъект[Элемент.Имя];
	
	ТабличныйДокумент = ТабДокСФ(Ссылка);
	
	ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла)
	
	ТабличныйДокумент.Показать(ИмяФайла,,Ложь);
	
	//ВремФайл = ОбработатьИмяВремФайла(ПолучитьИмяВременногоФайла("pdf"), ИмяФайла);
	//
	//ТабличныйДокумент.Записать(ВремФайл,ТипФайлаТабличногоДокумента.PDF);
	//Файл = Новый Файл(ВремФайл);
	//
	//ДД = Новый ДвоичныеДанные(Файл.ПолноеИмя);
	//
	//СсылкаНаФайл = ПоместитьВоВременноеХранилище(ДД, Новый УникальныйИдентификатор);
	//
	//СтруктураФайла = Новый Структура;
	//СтруктураФайла.Вставить("ДвоичныеДанные", ДД);
	//СтруктураФайла.Вставить("ИмяФайла", Файл.Имя);
	//СтруктураФайла.Вставить("ПутьФайла", Файл.ПолноеИмя);
	//
	//МассивФайлов = Новый Массив;
	//МассивФайлов.Добавить(СтруктураФайла);
	//
	//СтруктураВозврата = Новый Структура;
	//СтруктураВозврата.Вставить("МассивФайлов",МассивФайлов);
	//
	//#Если ВебКлиент Тогда
	//	
	//	ПодключитьРасширениеРаботыСФайламиНаКлиенте(Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Истина, СтруктураВозврата.МассивФайлов));
	//	
	//#КонецЕсли
	//
	//#Если НЕ ВебКлиент Тогда
	//	
	//	Если СтруктураВозврата.МассивФайлов.Количество() > 0 Тогда
	//		
	//		Попытка
	//			
	//			//СсылкаНаФайл = ПолучитьСсылкуНаФайл(СтруктураВозврата.МассивФайлов);
	//			
	//			Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
	//				
	//				ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
	//				
	//				Возврат; 
	//				
	//			КонецЕсли;
	//			
	//			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
	//			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
	//			ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
	//			
	//			
	//			НачатьПолучениеФайлаССервера(СсылкаНаФайл, Файл.Имя, ПараметрыДиалогаПолученияФайлов);
	//			
	//		Исключение	
	//			
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
	//			Сообщение.Сообщить();  
	//			
	//		КонецПопытки;
	//		
	//	КонецЕсли;
	//	
	//#КонецЕсли	
	
КонецПроцедуры

&НаСервере
Функция ОбработатьИмяВремФайла(Стр, ИмяФайла)
	Массив = СтрРазделить(Стр,"\");
	ИтогСтр = "";
	Для Каждого Зн Из Массив Цикл
		
		Если СтрНайти(Зн,".pdf") Тогда
			
			Зн = ИмяФайла+".pdf";	
			
		КонецЕсли;
		
		ИтогСтр = ИтогСтр + "\" + Зн;
		
	КонецЦикла;
	
	Возврат ИтогСтр;
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаФайл(МассивФайлов)
		
	ЗаписьZIP = Новый ЗаписьZipФайла(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip",,,,,);	
	
	Для Каждого СтрФайл Из МассивФайлов Цикл
				
		ДвоичныеДанныеФайла = СтрФайл.ДвоичныеДанные;
		ДвоичныеДанныеФайла.Записать(СтрФайл.ИмяФайла);	
		
		ЗаписьZIP.Добавить(СтрФайл.ИмяФайла, РежимСохраненияПутейZIP.СохранятьПолныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
				
	КонецЦикла;   
		
	ЗаписьZIP.Записать(); 
	
	Для Каждого СтрФайл Из МассивФайлов Цикл 
		
		УдалитьФайлы(СтрФайл.ИмяФайла);
		
		УдалитьФайлы(СтрФайл.ПутьФайла);
		
	КонецЦикла;
	
	Файл = Новый Файл(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip");  
	
	Если Файл.Существует() Тогда  
		
        Данные = Новый ДвоичныеДанные(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip");  
		
		СсылкаНаФайл = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
		
		УдалитьФайлы(Константы.КаталогВременныхФайловДляWindows.Получить() + "Сделки.zip"); 
		
        Возврат СсылкаНаФайл;
		
	Иначе
		
        Возврат Неопределено;
		
    КонецЕсли;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаИсходящиеСчета()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	               |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	               |		КОНЕЦ) КАК СуммаБезНДССчета,
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
	               |	СУММА(СчетНаОплатуПокупателюТовары.СуммаНДС) КАК СуммаНДССчета,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	               |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	               |		КОНЕЦ) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_СчетаПокупателям
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	               |ГДЕ
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
	               |	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплатуПокупателюТовары.Ссылка,
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Акт,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ) КАК СуммаБезНДСАкта,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
	               |	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	               |		КОНЕЦ) КАК СуммаСНДСАкта
	               |ПОМЕСТИТЬ ВТ_Реализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Ссылка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	               |	СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СУММА(СделкаВнутренниеДоходы.Сумма),
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	0,
	               |	СделкаВнутренниеДоходы.Сумма
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	               |ГДЕ
	               |	СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	               |	И СделкаВнутренниеДоходы.Ссылка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СделкаВнутренниеДоходы.Сумма,
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	СделкаВнутренниеДоходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	               |		КОНЕЦ),
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	               |	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |ГДЕ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	               |	И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет) КАК Счет,
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка) КАК Сделка,
	               |	ВТ_Реализации.Акт КАК Акт,
	               |	СУММА(ВТ_Реализации.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	               |	СУММА(ВТ_Реализации.СуммаНДСАкта) КАК СуммаНДСАкта,
	               |	СУММА(ВТ_Реализации.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаНДССчета) КАК СуммаНДССчета,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаСНДССчета) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_Исходящие
	               |ИЗ
	               |	ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	               |		ПО ВТ_СчетаПокупателям.Сделка = ВТ_Реализации.Сделка
	               |			И ВТ_СчетаПокупателям.Счет = ВТ_Реализации.Счет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет),
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка),
	               |	ВТ_Реализации.Акт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Исходящие.Счет КАК Счет,
	               |	ВТ_Исходящие.Акт КАК Ссылка,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
	               |	СтатусыДокументов.Статус КАК Статус
	               |ИЗ
	               |	ВТ_Исходящие КАК ВТ_Исходящие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |		ПО ВТ_Исходящие.Счет = СтатусыДокументов.Документ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Исходящие.Счет,
	               |	ВТ_Исходящие.Акт,
	               |	СтатусыДокументов.Статус
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Счет";
	
	Возврат ТекстЗапроса;	
	
КонецФункции   

&НаСервере
Функция ТекстЗапросаВходящиеСчета()
	
	//ТекстЗапроса = "ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Ссылка,
	//|	СУММА(ВЫБОР
	//|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	//|					И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	//|				ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	//|			ИНАЧЕ ВЫБОР
	//|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	//|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	//|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	//|					ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	//|				КОНЕЦ
	//|		КОНЕЦ) КАК СуммаАкта,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика КАК Счет,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка
	//|ПОМЕСТИТЬ ВТ_Поступления
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	//|ГДЕ
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка = &Сделка
	//|	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	СделкаВнутренниеРасходы.НаименованиеРасхода,
	//|	СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	//|	ЗНАЧЕНИЕ(ДОКУМЕНТ.СЧЕТНАОПЛАТУПОСТАВЩИКА.ПУСТАЯССЫЛКА),
	//|	СделкаВнутренниеРасходы.Ссылка
	//|ИЗ
	//|	Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	//|ГДЕ
	//|	СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	//|	И СделкаВнутренниеРасходы.Ссылка.Ссылка = &Сделка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СделкаВнутренниеРасходы.НаименованиеРасхода,
	//|	СделкаВнутренниеРасходы.Ссылка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	//|	СУММА(ВЫБОР
	//|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	//|					И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	//|				ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	//|			ИНАЧЕ ВЫБОР
	//|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	//|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	//|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	//|					ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	//|				КОНЕЦ
	//|		КОНЕЦ),
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	//|ГДЕ
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
	//|	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	//|	СУММА(ВЫБОР
	//|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	//|					И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	//|				ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	//|			ИНАЧЕ ВЫБОР
	//|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	//|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	//|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	//|					ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	//|				КОНЕЦ
	//|		КОНЕЦ),
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	//|ГДЕ
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка = &Сделка
	//|	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	//|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Счет,
	//|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК Сделка,
	//|	СУММА(СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения) КАК СуммаСчета
	//|ПОМЕСТИТЬ ВТ_Счета
	//|ИЗ
	//|	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
	//|ГДЕ
	//|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	//|	И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка,
	//|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Поступления.Ссылка КАК Ссылка,
	//|	СУММА(ЕСТЬNULL(ВТ_Поступления.СуммаАкта, 0)) КАК СуммаАкта,
	//|	СУММА(ЕСТЬNULL(ВТ_Счета.СуммаСчета, 0)) КАК СуммаСчета,
	//|	ВТ_Счета.Счет КАК Счет,
	//|	ЕСТЬNULL(СтатусыДокументовСчета.Статус, СтатусыДокументовАкты.Статус) КАК Статус
	//|ИЗ
	//|	ВТ_Поступления КАК ВТ_Поступления
	//|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Счета КАК ВТ_Счета
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументовСчета
	//|			ПО ВТ_Счета.Счет = СтатусыДокументовСчета.Документ
	//|		ПО ВТ_Поступления.Счет = ВТ_Счета.Счет
	//|			И ВТ_Поступления.Сделка = ВТ_Счета.Сделка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументовАкты
	//|		ПО ВТ_Поступления.Счет = СтатусыДокументовАкты.Документ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Поступления.Ссылка,
	//|	ЕСТЬNULL(СтатусыДокументовСчета.Статус, СтатусыДокументовАкты.Статус),
	//|	ВТ_Счета.Счет
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Счет ВОЗР"; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Счет,
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	               |			ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	               |		КОНЕЦ) КАК СуммаБезНДССчета,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	               |			ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	               |		КОНЕЦ) КАК СуммаНДССчета,
	               |	СУММА(СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_СчетаПоставщиков
	               |ИЗ
	               |	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	               |		ПО СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения
	               |			И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка
	               |ГДЕ
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	               |	И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка,
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Акт,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК СуммаБезНДСАкта,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика КАК Счет,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |			ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |		КОНЕЦ) КАК СуммаНДСАкта,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК СуммаСНДСАкта
	               |ПОМЕСТИТЬ ВТ_Поступления
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	               |	СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	               |	NULL,
	               |	СделкаВнутренниеРасходы.Ссылка,
	               |	0,
	               |	СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0))
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	               |ГДЕ
	               |	СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	               |	И СделкаВнутренниеРасходы.Ссылка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	               |	СделкаВнутренниеРасходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |			ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |			ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	               |			И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СчетаПоставщиков.Счет КАК Счет,
	               |	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка) КАК Сделка,
	               |	ВТ_Поступления.Акт КАК Акт,
	               |	СУММА(ВТ_Поступления.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	               |	СУММА(ВТ_Поступления.СуммаНДСАкта) КАК СуммаНДСАкта,
	               |	СУММА(ВТ_Поступления.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	               |	СУММА(ВТ_СчетаПоставщиков.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	               |	СУММА(ВТ_СчетаПоставщиков.СуммаНДССчета) КАК СуммаНДССчета,
	               |	СУММА(ВТ_СчетаПоставщиков.СуммаСНДССчета) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_Входящие
	               |ИЗ
	               |	ВТ_Поступления КАК ВТ_Поступления
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
	               |		ПО ВТ_Поступления.Счет = ВТ_СчетаПоставщиков.Счет
	               |			И ВТ_Поступления.Сделка = ВТ_СчетаПоставщиков.Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СчетаПоставщиков.Счет,
	               |	ВТ_Поступления.Акт,
	               |	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Входящие.Счет КАК Счет,
	               |	ВТ_Входящие.Акт КАК Ссылка,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
	               |	СтатусыДокументов.Статус КАК Статус
	               |ИЗ
	               |	ВТ_Входящие КАК ВТ_Входящие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |		ПО ВТ_Входящие.Счет = СтатусыДокументов.Документ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Входящие.Счет,
	               |	ВТ_Входящие.Акт,
	               |	СтатусыДокументов.Статус";
	
	Возврат ТекстЗапроса;	
	
КонецФункции

&НаСервере
Функция ТекстЗапросаАктСверки()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	               |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	               |		КОНЕЦ) КАК СуммаБезНДССчета,
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
	               |	СУММА(СчетНаОплатуПокупателюТовары.СуммаНДС) КАК СуммаНДССчета,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	               |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	               |		КОНЕЦ) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_СчетаПокупателям
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	               |ГДЕ
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
	               |	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплатуПокупателюТовары.Ссылка,
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Акт,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ) КАК СуммаБезНДСАкта,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
	               |	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	               |		КОНЕЦ) КАК СуммаСНДСАкта
	               |ПОМЕСТИТЬ ВТ_Реализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Ссылка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	               |	СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СУММА(СделкаВнутренниеДоходы.Сумма),
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	0,
	               |	СделкаВнутренниеДоходы.Сумма
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	               |ГДЕ
	               |	СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	               |	И СделкаВнутренниеДоходы.Ссылка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СделкаВнутренниеДоходы.Сумма,
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	СделкаВнутренниеДоходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	               |		КОНЕЦ),
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	               |	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |ГДЕ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	               |	И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет) КАК Счет,
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка) КАК Сделка,
	               |	ВТ_Реализации.Акт КАК Акт,
	               |	СУММА(ВТ_Реализации.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	               |	СУММА(ВТ_Реализации.СуммаНДСАкта) КАК СуммаНДСАкта,
	               |	СУММА(ВТ_Реализации.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаНДССчета) КАК СуммаНДССчета,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаСНДССчета) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_Исходящие
	               |ИЗ
	               |	ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	               |		ПО ВТ_СчетаПокупателям.Сделка = ВТ_Реализации.Сделка
	               |			И ВТ_СчетаПокупателям.Счет = ВТ_Реализации.Счет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет),
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка),
	               |	ВТ_Реализации.Акт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Исходящие.Счет КАК Счет,
	               |	ВТ_Исходящие.Акт КАК Ссылка,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
	               |	СтатусыДокументов.Статус КАК Статус
	               |ИЗ
	               |	ВТ_Исходящие КАК ВТ_Исходящие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |		ПО ВТ_Исходящие.Счет = СтатусыДокументов.Документ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Исходящие.Счет,
	               |	ВТ_Исходящие.Акт,
	               |	СтатусыДокументов.Статус
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Счет";
	
	Возврат ТекстЗапроса;	
	
КонецФункции

&НаСервере
Функция НайтиСФПоОснованию(Основание)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетФактураВыданный.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	                      |ГДЕ
	                      |	СчетФактураВыданный.ДокументОснование = &Основание");
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли
КонецФункции

&НаСервере
Функция ТабДокУПД(Сф)	
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Сф);
	
	НастройкиПечати = УчетНДСВызовСервера.ПолучитьНастройкиПечатиУниверсальныхПередаточныхДокументов(
	МассивОбъектов);
	
	ЕстьСчетаФактурыВыданные   = Ложь;
	ЕстьСчетаФактурыПолученные = Ложь;
	
	Для каждого Объект Из НастройкиПечати.УниверсальныеПередаточныеДокументы Цикл
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ЕстьСчетаФактурыВыданные = Истина;
			Прервать;
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			ЕстьСчетаФактурыПолученные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(НастройкиПечати.СписокМакетов) = Тип("Строка") Тогда
		ИменаМакетов = СтрРазделить(НастройкиПечати.СписокМакетов,",");	
	КОнецЕсли;
	
	ТекстЗапроса = "";
	ОбъектыПечати = Новый СписокЗначений();
	ТаблицаМакетовУПД = УчетНДС.ТаблицаМакетовУПД(); 
	ПараметрыПечати = ПолучитьПараметрыПечати();
	ВременнаяКоллекцияДляОднойПечатнойФормы = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(НастройкиПечати.СписокМакетов);
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	Для Каждого МакетУПД ИЗ ТаблицаМакетовУПД Цикл 
		Если МакетУПД.Статус <> "1" Тогда
			Продолжить;
		КонецЕсли; 
		
		Если УправлениеПечатью.НужноПечататьМакет(ВременнаяКоллекцияДляОднойПечатнойФормы, МакетУПД.ИДМакета) Тогда
			Если ЕстьСчетаФактурыВыданные Тогда
				ТекстЗапроса = Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(
				МакетУПД.ВерсияПостановленияНДС1137, Истина, МакетУПД.ПрослеживаемыеТовары);
			Иначе
				ТекстЗапроса = Документы.СчетФактураПолученный.ТекстЗапросаПечатьСчетовФактур(
				МакетУПД.ВерсияПостановленияНДС1137, МакетУПД.ПрослеживаемыеТовары);
			КонецЕсли;
			
			СтруктураПараметровПечати = УчетНДС.НовыйСтруктураПараметровПечатиУПД_УКД();
			СтруктураПараметровПечати.МассивОбъектов              = НастройкиПечати.УниверсальныеПередаточныеДокументы;
			СтруктураПараметровПечати.ОбъектыПечати               = ОбъектыПечати;
			СтруктураПараметровПечати.ТекстЗапросаДокументам      = ТекстЗапроса;
			СтруктураПараметровПечати.ТолькоПередаточныйДокумент  = Ложь;
			СтруктураПараметровПечати.ТабДокумент                 = Неопределено;
			СтруктураПараметровПечати.ПараметрыПечати             = ПараметрыПечати;
			СтруктураПараметровПечати.КлючПараметровПечати        = МакетУПД.КлючПараметровПечати;
			СтруктураПараметровПечати.ПолныйПутьКМакету           = МакетУПД.ПолныйПутьКМакету;
			СтруктураПараметровПечати.ПараметрыВывода             = ПараметрыВывода;
			
			ТабличныйДокумент = УчетНДС.ПечатьУниверсальныхПередаточныхДокументов(СтруктураПараметровПечати);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
		
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокСчет(Сч)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	ПараметрыПечати.Вставить("ВыводитьКоносамент",Истина);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Сч);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	СоответствиеСчетовРеализациям = Неопределено;
	ДокументыБезСчетовНаОплату = Неопределено;
	ТаблицаСведенийСчетНаОплату = Документы.СчетНаОплатуПокупателю.ПолучитьТаблицуСведенийСчетаНаОплату(
			МассивОбъектов, СоответствиеСчетовРеализациям, ДокументыБезСчетовНаОплату);
	
	ТабличныйДокумент = ПечатьТорговыхДокументов.ПечатьСчетаНаОплату(ТаблицаСведенийСчетНаОплату,ОбъектыПечатиВрем,ПараметрыПечати);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокАкт(Акт)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВидДокументаПечати",  "РеализацияТоваровУслуг");
	ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Акт");
	ПараметрыПечати.Вставить("ИмяМакетаПечати",     "Документ.РеализацияТоваровУслуг.ПФ_MXL_Акт");
	ПараметрыПечати.Вставить("ВыводитьКоносамент", Истина);
	ПараметрыПечати.Вставить("ОтслеживатьОригинал", Истина); 
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Акт);
	
	ТаблицаСведенийАктаОбОказанииУслуг = Документы.РеализацияТоваровУслуг.ПолучитьТаблицуСведенийАктаОбОказанииУслуг(МассивОбъектов);
	
	ТабличныйДокумент = ПечатьТорговыхДокументов.ПечатьАктаОбОказанииУслуг(ТаблицаСведенийАктаОбОказанииУслуг, ОбъектыПечати, ПараметрыПечати);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокОтчет(Отчет)
		
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Отчет);
	
	ТабличныйДокумент = Документы.ОтчетКомитентуОПродажах.ЛГС_ПечатьОтчетаКомитенту1(МассивОбъектов, ОбъектыПечати);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокСФ(СФ)
	
	ПорядокПримененияФормСФ = 
		УчетНДСПереопределяемый.СоответствиеВерсийПостановленияФормамСчетовФактур();
		
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();	
		
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СФ);
	
	НастройкиПечати = УчетНДСВызовСервера.ПолучитьНастройкиПечатиСчетовФактур(МассивОбъектов);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	СоответствиеСчетовРеализациям = Неопределено;
	ДокументыБезСчетовНаОплату = Неопределено;
	ТаблицаСведенийСчетНаОплату = Документы.СчетНаОплатуПокупателю.ПолучитьТаблицуСведенийСчетаНаОплату(
			МассивОбъектов, СоответствиеСчетовРеализациям, ДокументыБезСчетовНаОплату);
	
	ТабличныйДокумент = УчетНДС.ПечатьСчетовФактур1096(
			МассивОбъектов,
			ОбъектыПечати,
			Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(ПорядокПримененияФормСФ["СчетФактура1096"]),
			ПараметрыПечати,
			ПараметрыВывода);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Процедура ОбработатьФаксимилеТабДок(ТабличныйДокумент)

	ФайлыПечатиИПодписи = Справочники.Организации.ПодписиИПечатиОрганизации(Справочники.Организации.ОрганизацияПоУмолчанию(), ТекущаяДата());
	
	Для Каждого Рис ИЗ ТабличныйДокумент.Рисунки Цикл
				
		Если СтрНайти(Рис.Имя,"Печать") <> 0 И ФаксимилеИспользуется Тогда
			Рис.Картинка = ФайлыПечатиИПодписи["ФаксимилеПечать"];
		ИначеЕсли СтрНайти(Рис.Имя,"Руководитель") <> 0 И ФаксимилеИспользуется Тогда
			Рис.Картинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"];
		Иначе
			Рис.ВыводитьНаПечать = Ложь;	
		КОнецЕсли;
		
		Рис.ГраницаСверху = Ложь;
		Рис.ГраницаСлева = Ложь;
		Рис.ГраницаСнизу = Ложь;
		Рис.ГраницаСправа = Ложь;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПечати()
	
	ПараметрыПечати = Новый Структура;
	
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", ЛОЖЬ);
	ПараметрыПечати.Вставить("ИдентификаторВКомплекте", "УниверсальныйПередаточныйДокументКомплект");
	ПараметрыПечати.Вставить("ОтслеживатьОригинал", Истина);
	
	Возврат ПараметрыПечати;
	
КонецФункции

&НаСервере
Функция ПолучитьРез()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |ГДЕ
	                      |	РеализацияТоваровУслуг.Номер = &Номер");
	Запрос.УстановитьПараметр("Номер", "ДЦ00-000003");
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;	
	КонецЕсли;	

КОнецФункции

&НаКлиенте
Процедура ПослеПодключенияРасширения(Подключено, ДопПараметры) Экспорт
	
	Если Подключено Тогда
		
		Попытка
			Если ДопПараметры.МассивФайлов.Количество <> 0 Тогда 
				ДанныеФайла = ДопПараметры.МассивФайлов[0];
				СсылкаНаФайл = ПоместитьВоВременноеХранилище(ДанныеФайла.ДвоичныеДанные, Новый УникальныйИдентификатор);
			КонецЕсли;
			
			//СсылкаНаФайл = ПолучитьСсылкуНаФайл(ДопПараметры.МассивФайлов);
			
			Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
				
				ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
				
				Возврат; 
				
			КонецЕсли;
			
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
			
			НачатьПолучениеФайлаССервера(СсылкаНаФайл, ДанныеФайла.ИмяФайла, ПараметрыДиалогаПолученияФайлов);
			
		Исключение	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
			Сообщение.Сообщить();  
			
		КонецПопытки;	
		
	ИначеЕсли ДопПараметры.УстановитьЕслиНеПодключено Тогда
		
		НачатьУстановкуРасширенияРаботыСФайлами(
            Новый ОписаниеОповещения(
                "ПодключитьРасширениеРаботыСФайламиНаКлиенте",
                ЭтотОбъект,
                Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Ложь, ДопПараметры.МассивФайлов)));
		
	Иначе
		
		ПоказатьПредупреждение( , НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодключитьРасширениеРаботыСФайламиНаКлиенте(ДопПараметры) Экспорт
	
	ОповещениеОПодключенииРасширенияРаботыСФайлами = Новый ОписаниеОповещения("ПослеПодключенияРасширения", ЭтотОбъект, ДопПараметры);
	
	НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеОПодключенииРасширенияРаботыСФайлами);
	
КонецПроцедуры



















