
&ИзменениеИКонтроль("УслугиНоменклатураПриИзменении")
Процедура ЛГС_УслугиНоменклатураПриИзменении(СтрокаТабличнойЧасти, Знач ДанныеОбъекта, Знач СчетаУчетаКЗаполнению)

	ЗаполненныеСчета = СчетаУчетаВДокументах.ЗаполнитьРеквизитыПриИзменении(
	Документы.ПоступлениеТоваровУслуг,
	СчетаУчетаКЗаполнению,
	ДанныеОбъекта,
	"Услуги",
	СтрокаТабличнойЧасти);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ЗаполненныеСчета);  
	
	#Вставка  
	СчетаПоНоменклатуреКонтрагенту = ЗаполнитьСчетаПоКонтрагентуИНоменклатуре(ЗаполненныеСчета, СтрокаТабличнойЧасти.Номенклатура, ДанныеОбъекта.ДоговорКонтрагента.Владелец);
	Если СчетаПоНоменклатуреКонтрагенту <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СчетаПоНоменклатуреКонтрагенту); 
	КонецЕсли;
	#КонецВставки
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.ТипЦен) Тогда
		ДанныеОбъекта.Вставить("СпособЗаполненияЦены", Перечисления.СпособыЗаполненияЦен.ПоЗакупочнымЦенам);
	КонецЕсли;	

	СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОНоменклатуре(
	СтрокаТабличнойЧасти.Номенклатура, ДанныеОбъекта, Ложь);

	Если СведенияОНоменклатуре = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтрокаТабличнойЧасти.Содержание      = СведенияОНоменклатуре.НаименованиеПолное;

	Если ДанныеОбъекта.ЕстьРасхождения Тогда
		СтрокаТабличнойЧасти.ЦенаПоДокументу = СведенияОНоменклатуре.Цена;
	КонецЕсли; 

	СтрокаТабличнойЧасти.Цена            = СведенияОНоменклатуре.Цена;
	СтрокаТабличнойЧасти.СтавкаНДС       = СведенияОНоменклатуре.СтавкаНДС;

	СтрокаТабличнойЧасти.ОтражениеВУСН	= ПоступлениеТоваровУслугФормыКлиентСервер.ОтражениеВУСН(
	ДанныеОбъекта.ВидОперации, ДанныеОбъекта.ЭтоКомиссия);

	ПоступлениеТоваровУслугФормыКлиентСервер.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, 1);
	ПоступлениеТоваровУслугФормыКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДанныеОбъекта.СуммаВключаетНДС);

	Если ДанныеОбъекта.ЕстьРасхождения Тогда
		ПоступлениеТоваровУслугФормыКлиентСервер.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, 1, "ПоДокументу");
		ПоступлениеТоваровУслугФормыКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДанныеОбъекта.СуммаВключаетНДС,,"ПоДокументу");
	КонецЕсли; 


КонецПроцедуры   

Функция ЗаполнитьСчетаПоКонтрагентуИНоменклатуре(ЗаполненныеСчета, Номенклатура, Контрагент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетаУчетаСтатьиРасходовПоступлений.Номенклатура КАК Номенклатура,
		|	СчетаУчетаСтатьиРасходовПоступлений.Контрагент КАК Контрагент,
		|	СчетаУчетаСтатьиРасходовПоступлений.СчетУчета КАК СчетУчета,
		|	СчетаУчетаСтатьиРасходовПоступлений.СтатьяЗатрат КАК СтатьяЗатрат
		|ПОМЕСТИТЬ ОтборПоКонтрагенту
		|ИЗ
		|	РегистрСведений.СчетаУчетаСтатьиРасходовПоступлений КАК СчетаУчетаСтатьиРасходовПоступлений
		|ГДЕ
		|	СчетаУчетаСтатьиРасходовПоступлений.Контрагент = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтборПоКонтрагенту.Номенклатура КАК Номенклатура,
		|	ОтборПоКонтрагенту.Контрагент КАК Контрагент,
		|	ОтборПоКонтрагенту.СчетУчета КАК СчетУчета,
		|	ОтборПоКонтрагенту.СтатьяЗатрат КАК СтатьяЗатрат
		|ИЗ
		|	ОтборПоКонтрагенту КАК ОтборПоКонтрагенту
		|ГДЕ
		|	ОтборПоКонтрагенту.Номенклатура = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтборПоКонтрагенту.Номенклатура КАК Номенклатура,
		|	ОтборПоКонтрагенту.Контрагент КАК Контрагент,
		|	ОтборПоКонтрагенту.СчетУчета КАК СчетУчета,
		|	ОтборПоКонтрагенту.СтатьяЗатрат КАК СтатьяЗатрат
		|ИЗ
		|	ОтборПоКонтрагенту КАК ОтборПоКонтрагенту";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	Если Не РезультатыЗапросов[1].Пустой() Тогда
		Выборка = РезультатыЗапросов[1].Выбрать(); 
		Выборка.Следующий();
	ИначеЕсли Не РезультатыЗапросов[2].Пустой() Тогда
		Выборка = РезультатыЗапросов[2].Выбрать();
	Иначе
		Возврат Неопределено;
	КонецЕсли;  
	
	Выборка.Следующий();
	СчетУчета = Выборка.СчетУчета; 
	СтатьяЗатрат = Выборка.СтатьяЗатрат; 
	
	СчетаПоНоменклатуреКонтрагенту = Новый Структура();
	
	Для Счетчик = 1 По 3 Цикл
		СчетаПоНоменклатуреКонтрагенту.Вставить("Субконто" + Строка(Счетчик), );  
		СчетаПоНоменклатуреКонтрагенту.Вставить("СубконтоНУ" + Строка(Счетчик), "");
	КонецЦикла;

	Для каждого Строка Из СчетУчета.ВидыСубконто Цикл
		Если Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
			НомерСубконто = Строка.НомерСтроки;  
			СчетаПоНоменклатуреКонтрагенту["Субконто" + Строка(НомерСубконто)] = СтатьяЗатрат;  
			СчетаПоНоменклатуреКонтрагенту["СубконтоНУ" + Строка(НомерСубконто)] = СтатьяЗатрат;
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	
	СчетаПоНоменклатуреКонтрагенту.Вставить("СчетЗатрат", СчетУчета);
	СчетаПоНоменклатуреКонтрагенту.Вставить("СчетЗатратНУ", СчетУчета);  
	
	Возврат СчетаПоНоменклатуреКонтрагенту;	
	
КонецФункции

