
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Новая); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВРаботе);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВПорту); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыходИзПорта);    
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.SWBОформлен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ДокументыПодготовлены); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ПретензияСуд);
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Перечисления.ВидыСделок.Экспорт; 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюСделку(Команда)
	
	ПараметрыОткрытия = Новый Структура("Вид", "Экспорт");
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСделку(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СсылкаНаСделку", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаКопирования", ПараметрыОткрытия, ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	     	
	Если ИмяСобытия = "ВыбраныПараметрыКопированияСделки"
		И Источник.ВладелецФормы = ЭтаФорма Тогда
				
		ОткрытьФорму("Документ.Сделка.Форма.ФормаДокумента", Параметр);
			
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаПрисоединенныеФайлы.ВидФайла КАК ВидФайла,
	               |	СделкаПрисоединенныеФайлы.ВладелецФайла.Ссылка КАК ВладелецФайлаСсылка
	               |ИЗ
	               |	Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
	               |ГДЕ
	               |	СделкаПрисоединенныеФайлы.ВладелецФайла.Ссылка В(&Сделка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаПрисоединенныеФайлы.ВидФайла,
	               |	СделкаПрисоединенныеФайлы.ВладелецФайла.Ссылка";
	
	Запрос.УстановитьПараметр("Сделка", Строки.ПолучитьКлючи());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Попытка
			
			СтрокаСписка = Строки[Выборка.ВладелецФайлаСсылка]; 
			
			Если СтрокаСписка.Данные.ВидыФайлов = Null Тогда
				
				СтрокаСписка.Данные.ВидыФайлов = Строка(Выборка.ВидФайла);
				
			Иначе
				
				СтрокаСписка.Данные.ВидыФайлов = СтрокаСписка.Данные.ВидыФайлов + ", " + Строка(Выборка.ВидФайла);
				
			КонецЕсли;
			
		Исключение 
			
		КонецПопытки
		 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПроверкаСредствДляРелиза(Команда)
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		СменитьСтатусНаПроверкаСредствДляРелиза(Элементы.Список.ДанныеСтроки(Стр).Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура СменитьСтатусНаПроверкаСредствДляРелиза(Ссыл)  
	
	НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Сделка.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 Тогда
		
		МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
		
		МЗ.Сделка = Ссыл;
		МЗ.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.ПроверкаСредствДляРелиза;
		МЗ.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
		МЗ.Записать();
		
	Иначе
		
		Для Каждого Запись ИЗ НЗ Цикл 
			
			Запись.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.ПроверкаСредствДляРелиза;
			Запись.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусБалансПодтвержден(Команда)
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		СменитьСтатусНаБалансПодтвержден(Элементы.Список.ДанныеСтроки(Стр).Ссылка);
		
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура СменитьСтатусНаБалансПодтвержден(Ссыл)  
	
	НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Сделка.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 Тогда
		
		МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
		
		МЗ.Сделка = Ссыл;
		МЗ.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.БалансПодтвержден;
		МЗ.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
		МЗ.Записать();
		
	Иначе
		
		Для Каждого Запись ИЗ НЗ Цикл 
			
			Запись.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.БалансПодтвержден;
			Запись.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)   
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПуть(Ссыл)
	
	Возврат Ссыл.ПутьКПапке;
	
КонецФункции
