Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпановкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыОтчета = Настройки.ПараметрыДанных.Элементы; 
	Период = ПараметрыОтчета.Найти("Период").Значение;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпановкиДанных, Настройки, ДанныеРасшифровки);
	
	СделкиЗаПериод = СделкиЗаПериод(Период.ДатаНачала, Период.ДатаОкончания); 
	ТЗПрофитыСделокДляПроверки = ТЗПрофитыСделокДляПроверки(СделкиЗаПериод);
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц; 
	
	ПодготовитьВТДляОтчета(МенеджерВТ, ТЗПрофитыСделокДляПроверки);  
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки,,, МенеджерВТ);  
	
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры    

Функция ПрофитСделки(Сделка)
	
	// Суммы БезНДС Итоговые
	СуммаБезНДСИтогоИсходящиеСчета = 0;
	СуммаБезНДСИтогоВходящиеСчета = 0; 
	
	СуммаНДСИтогоИсходящиеАкты = 0;	
	СуммаНДСИтогоВходящиеАкты = 0;
	//СуммаНДСИтогоВходящиеАктыПеревыставляемый = 0;
	
	СуммаСНДСИтогоИсходящиеАкты = 0;
	СуммаСНДСИтогоВходящиеАкты = 0;
	СуммаБезНДСИтогоИсходящиеАкты = 0;	
	СуммаБезНДСИтогоВходящиеАкты = 0;  
	
	// Структура НДС по входящим документам
	СтруктураНДСВходящие = Новый Структура;
	СтруктураНДСВходящие.Вставить("АктВходящийВсегоНДС",0);
	СтруктураНДСВходящие.Вставить("АктВходящийНеПеревыставляемыйНДС",0);
	СтруктураНДСВходящие.Вставить("АктВходящийПеревыставляемыйНДС",0);
	СтруктураНДСВходящие.Вставить("СчетВходящийВсегоНДС",0);
	СтруктураНДСВходящие.Вставить("СчетВходящийНеПеревыставляемыйНДС",0);
	СтруктураНДСВходящие.Вставить("СчетВходящийПеревыставляемыйНДС",0); 
	
	// Структура НДС по исходящим документам
	СтруктураНДСИсходящие = Новый Структура;
	СтруктураНДСИсходящие.Вставить("АктИсходящийВсегоНДС",0);
	СтруктураНДСИсходящие.Вставить("АктИсходящийНеПеревыставляемыйНДС",0);
	СтруктураНДСИсходящие.Вставить("АктИсходящийПеревыставляемыйНДС",0);
	СтруктураНДСИсходящие.Вставить("СчетИсходящийВсегоНДС",0);
	СтруктураНДСИсходящие.Вставить("СчетИсходящийНеПеревыставляемыйНДС",0);
	СтруктураНДСИсходящие.Вставить("СчетИсходящийПеревыставляемыйНДС",0);
	
	ПониженнаяСтавка = УчетНДС.ПрименяетсяПониженнаяСтавкаНДС(Сделка.Организация, ТекущаяДата());

	Если Сделка.Организация.ИНН = "5074080761" Тогда // Декларант
		
		Номенклатура1 = Справочники.Номенклатура.НайтиПоКоду("00-00000025");   // Таможенные платежи
		НоменклатураВозмещаемыеРасходы = Справочники.Номенклатура.НайтиПоКоду("00-00000026"); 
		
		
	ИначеЕсли Сделка.Организация.ИНН = "2315213101" Тогда // Логист 
		
		Номенклатура1 = Справочники.Номенклатура.НайтиПоКоду("00-00000389"); // Таможенные платежи
		
	КонецЕсли;

	ЗапросИсходящиеСчета = Новый Запрос;
	ЗапросИсходящиеСчета.Текст = РасчетПрофитаСделокСервер.ТекстЗапросаИсходящиеСчета(); 	
	ЗапросИсходящиеСчета.УстановитьПараметр("Сделка", Сделка); 
	ЗапросИсходящиеСчета.УстановитьПараметр("Номенклатура", Номенклатура1); 
	
	ВыборкаИсходящиеСчета = ЗапросИсходящиеСчета.Выполнить().Выгрузить();
	
	ЗапросВходящиеСчета = Новый Запрос;
	ЗапросВходящиеСчета.Текст = РасчетПрофитаСделокСервер.ТекстЗапросаВходящиеСчета(); 	
	ЗапросВходящиеСчета.УстановитьПараметр("Сделка", Сделка);
	ЗапросВходящиеСчета.УстановитьПараметр("Номенклатура", Номенклатура1);
	
	ВыборкаВходящиеСчета = ЗапросВходящиеСчета.Выполнить().Выгрузить();
	
	Индекс = 0;
	
	Если ВыборкаИсходящиеСчета.Количество() > ВыборкаВходящиеСчета.Количество() Тогда
		
		Пока Индекс < ВыборкаИсходящиеСчета.Количество() Цикл
						
			Если Индекс < ВыборкаВходящиеСчета.Количество() Тогда
				
				СуммаНДСИтогоВходящиеАкты = СуммаНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта; 
				
				СуммаСНДСИтогоВходящиеАкты = СуммаСНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаСНДСАкта;
				
			КонецЕсли;
			
			СуммаБезНДСИтогоИсходящиеАкты = СуммаБезНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаБезНДСАкта;
			СуммаСНДСИтогоИсходящиеАкты = СуммаСНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаСНДСАкта;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	ИначеЕсли ВыборкаИсходящиеСчета.Количество() = ВыборкаВходящиеСчета.Количество() Тогда
		
		Пока Индекс < ВыборкаИсходящиеСчета.Количество() Цикл
			
			СуммаБезНДСИтогоВходящиеАкты = СуммаБезНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаБезНДСАкта;
			СуммаНДСИтогоВходящиеАкты = СуммаНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта;  
			СуммаСНДСИтогоВходящиеАкты = СуммаСНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаСНДСАкта;
			СуммаБезНДСИтогоИсходящиеАкты = СуммаБезНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаБезНДСАкта;
			СуммаНДСИтогоИсходящиеАкты = СуммаНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаНДСАкта;
			СуммаСНДСИтогоИсходящиеАкты = СуммаСНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаСНДСАкта;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	ИначеЕсли ВыборкаИсходящиеСчета.Количество() < ВыборкаВходящиеСчета.Количество() Тогда
		
		Пока Индекс < ВыборкаВходящиеСчета.Количество() Цикл
			
			Если Индекс < ВыборкаИсходящиеСчета.Количество() Тогда
				
				СуммаБезНДСИтогоИсходящиеАкты = СуммаБезНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаБезНДСАкта;
				СуммаНДСИтогоИсходящиеАкты = СуммаНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаНДСАкта;
				СуммаСНДСИтогоИсходящиеАкты = СуммаСНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаСНДСАкта;
				
			КонецЕсли;
			
			СуммаБезНДСИтогоВходящиеАкты = СуммаБезНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаБезНДСАкта;
			СуммаНДСИтогоВходящиеАкты = СуммаНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта; 
			СуммаСНДСИтогоВходящиеАкты = СуммаСНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаСНДСАкта;

			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВычитатьНДСВходящийПеревыставляемый = Константы.ВычитатьПолнуюСуммуВходящихСНДСИзПрофитаБезНДС.Получить();
	
	//+ Получение Исходящих НДС 
	РасчетПрофитаСделокСервер.ПолучитьНДСИсходящие(СтруктураНДСИсходящие, Сделка, Номенклатура1);
	
	//+ Получение Входящего НДС по перевыставляемым позициям
	СуммаНДСИтогоВходящиеСчетаПеревыставляемый = 0;
	СуммаНДСИтогоВходящиеАктыПеревыставляемый = 0;
	
	ТЗ = ВыборкаВходящиеСчета.Скопировать(,"Ссылка");
	АктыВходящие = ТЗ.СкопироватьКолонки("Ссылка");
	
	Для каждого стрТЗ из ТЗ Цикл
		
		Если ТипЗнч(стрТЗ.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			
			стрАктыВходящие = АктыВходящие.Добавить();
			стрАктыВходящие.Ссылка = стрТЗ.Ссылка;
			
		КонецЕсли;
		
	КонецЦикла;	 
	
	АктыВходящие.Свернуть("Ссылка");
	
	ТЗ.Очистить();
	ТЗ = ВыборкаВходящиеСчета.Скопировать(,"Счет");
	СчетаВходящие = ТЗ.СкопироватьКолонки("Счет");
	
	Для каждого стрТЗ из ТЗ Цикл
		
		Если ТипЗнч(стрТЗ.Счет) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			
			стрСчетаВходящие = СчетаВходящие.Добавить();
			стрСчетаВходящие.Счет = стрТЗ.Счет;
			
		КонецЕсли;
		
	КонецЦикла;	 
	
	СчетаВходящие.Свернуть("Счет");
	
	ТЗ.Очистить();
	
	//- Получение Входящего НДС по перевыставляемым позициям
	РасчетПрофитаСделокСервер.ПолучитьНДСВходящиеПеревыставляемые(АктыВходящие,СчетаВходящие,СуммаНДСИтогоВходящиеАктыПеревыставляемый,СуммаНДСИтогоВходящиеСчетаПеревыставляемый,СтруктураНДСВходящие);
	
	Если ПониженнаяСтавка Тогда  
		
		ПрофитБезНДСПоАктам = СуммаСНДСИтогоИсходящиеАкты - СтруктураНДСИсходящие.АктИсходящийНеПеревыставляемыйНДС - СуммаСНДСИтогоВходящиеАкты;
		
	Иначе  
		
		ПрофитБезНДСПоАктам = СуммаБезНДСИтогоИсходящиеАкты - СуммаБезНДСИтогоВходящиеАкты;
		
	КонецЕсли; 
	
	Возврат ПрофитБезНДСПоАктам;

КонецФункции // ()

Процедура ПодготовитьВТДляОтчета(МенеджерВТ, ТЗПрофитыСделокДляПроверки, ТЗПрофитыСделок=Неопределено)

	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрофитыСделокДляПроверки.Сделка КАК Сделка,
	|	ПрофитыСделокДляПроверки.Профит КАК Профит
	|ПОМЕСТИТЬ Вт_ПрофитыСделокДляПроверки
	|ИЗ
	|	&ПрофитыСделокДляПроверки КАК ПрофитыСделокДляПроверки"; 
	
	Запрос.УстановитьПараметр("ПрофитыСделокДляПроверки", ТЗПрофитыСделокДляПроверки); 
	
	РезультатЗапроса = Запрос.Выполнить();

КонецПроцедуры

Функция СделкиЗаПериод(НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сделка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	НЕ Сделка.ПометкаУдаления
	|	И Сделка.Проведен
	|	И Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗСделки = РезультатЗапроса.Выгрузить(); 
	
	Возврат ТЗСделки.ВыгрузитьКолонку("Ссылка");
	
КонецФункции 

Функция ТЗПрофитыСделокДляПроверки(СделкиЗаПериод)
	
	ТЗПрофитыСделокДляПроверки = Новый ТаблицаЗначений();
	ТЗПрофитыСделокДляПроверки.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
	ТЗПрофитыСделокДляПроверки.Колонки.Добавить("Профит", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 4, ДопустимыйЗнак.Любой))); 
	
	Для Индекс = 0 По СделкиЗаПериод.Количество() - 1 Цикл
	
		НоваяСтрока = ТЗПрофитыСделокДляПроверки.Добавить();
		НоваяСтрока.Сделка = СделкиЗаПериод[Индекс];
		НоваяСтрока.Профит = ПрофитСделки(СделкиЗаПериод[Индекс]);
	
	КонецЦикла;
	
	Возврат ТЗПрофитыСделокДляПроверки; 

КонецФункции
  