
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаНаКонтрагента") Тогда
		
		Если ЗначениеЗаполнено(Параметры.СсылкаНаКонтрагента) Тогда
			
			Объект.Контрагент = Параметры.СсылкаНаКонтрагента; 
			
			Элементы.Контрагент.Доступность = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Стр = Объект.Доверенности.Добавить(); 
		
		Объект.Доверенности[0].Контрагент = Объект.Контрагент;
		
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		
	Иначе
		
		Если Объект.ЦепочкаДоверенностей Тогда
			
			Элементы.ДоверенностиГруппа.Видимость = Истина;
			
			Элементы.Грузополучатель.Видимость = Ложь;
			Элементы.СрокДействия.Видимость = Ложь;
			Элементы.Сдана.Видимость = Ложь;
			Элементы.ДатаСдачи.Видимость = Ложь;
			
		Иначе
			
			Элементы.ДоверенностиГруппа.Видимость = Ложь;
			
			Элементы.Грузополучатель.Видимость = Истина;
			Элементы.СрокДействия.Видимость = Истина;
			Элементы.Сдана.Видимость = Истина;
			Элементы.ДатаСдачи.Видимость = Истина;
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СданаПриИзменении(Элемент)
	
	Если НЕ Объект.ЦепочкаДоверенностей Тогда
		
		Объект.Доверенности[0].Сдана = ЭтотОбъект.Сдана;	
		
		Если ЭтотОбъект.Сдана Тогда
			
			Объект.Доверенности[0].ДатаСдачи = ТекущаяДата();
			ЭтотОбъект.ДатаСдачи = ТекущаяДата();
			
		Иначе                                                         
			
			Объект.Доверенности[0].ДатаСдачи = "";
			ЭтотОбъект.ДатаСдачи = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЦепочкаДоверенностейПриИзменении(Элемент)
	
	Если Объект.ЦепочкаДоверенностей Тогда
		
		Элементы.ДоверенностиГруппа.Видимость = Истина;
		
		Элементы.Грузополучатель.Видимость = Ложь;
		Элементы.СрокДействия.Видимость = Ложь;
		Элементы.Сдана.Видимость = Ложь;
		Элементы.ДатаСдачи.Видимость = Ложь;
		
		ЭтотОбъект.Грузополучатель = "";
		ЭтотОбъект.СрокДействия = "";
		ЭтотОбъект.Сдана = "";
		ЭтотОбъект.ДатаСдачи = "";
		
	Иначе 
		
		Объект.Доверенности.Очистить();
		
		Элементы.ДоверенностиГруппа.Видимость = Ложь;
		
		Элементы.Грузополучатель.Видимость = Истина;
		Элементы.СрокДействия.Видимость = Истина;
		Элементы.Сдана.Видимость = Истина;
		Элементы.ДатаСдачи.Видимость = Истина;
		
		ЭтотОбъект.Грузополучатель = "";
		ЭтотОбъект.СрокДействия = "";
		ЭтотОбъект.Сдана = "";
		ЭтотОбъект.ДатаСдачи = "";
		
		Стр = Объект.Доверенности.Добавить(); 
		
		Объект.Доверенности[0].Контрагент = Объект.Контрагент;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если НЕ Объект.ЦепочкаДоверенностей Тогда
		
		Объект.Доверенности[0].Контрагент = Объект.Контрагент;	
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	
	Если НЕ Объект.ЦепочкаДоверенностей Тогда
		
		Объект.Доверенности[0].Грузополучатель = ЭтотОбъект.Грузополучатель;	
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ДатаСдачиПриИзменении(Элемент)
	
	Если НЕ Объект.ЦепочкаДоверенностей Тогда
		
		Объект.Доверенности[0].ДатаСдачи = ЭтотОбъект.ДатаСдачи;	
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	
Если НЕ Объект.ЦепочкаДоверенностей Тогда
		
		Объект.Доверенности[0].СрокДействия = ЭтотОбъект.СрокДействия;	
		
	КонецЕсли;

КонецПроцедуры

