
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ЗаявкаПолучена); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ДокументыПолучены);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.МакетОтправлен); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.СертификатВыпущен); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ПретензияСуд);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов; 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Перечисления.ВидыСделок.Сертификация; 
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюСделку(Команда)
	
	ПараметрыОткрытия = Новый Структура("Вид", "Сертификация");
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСделку(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СсылкаНаСделку", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаКопирования", ПараметрыОткрытия, ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	     	
	Если ИмяСобытия = "ВыбраныПараметрыКопированияСделки"
		И Источник.ВладелецФормы = ЭтаФорма Тогда
				
		ОткрытьФорму("Документ.Сделка.Форма.ФормаДокумента", Параметр);
			
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусВРаботе(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусВывезен(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусВыгружен(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусВыставленыВсеРасходы(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусДоставлен(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусЗакрыта(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусНаПодходе(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусСданПорожний(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаПрисоединенныеФайлы.ВидФайла КАК ВидФайла,
	               |	СделкаПрисоединенныеФайлы.ВладелецФайла.Ссылка КАК ВладелецФайлаСсылка
	               |ИЗ
	               |	Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
	               |ГДЕ
	               |	СделкаПрисоединенныеФайлы.ВладелецФайла.Ссылка В(&Сделка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаПрисоединенныеФайлы.ВидФайла,
	               |	СделкаПрисоединенныеФайлы.ВладелецФайла.Ссылка";
	
	Запрос.УстановитьПараметр("Сделка", Строки.ПолучитьКлючи());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Попытка
			
			СтрокаСписка = Строки[Выборка.ВладелецФайлаСсылка]; 
			
			Если СтрокаСписка.Данные.ВидыФайлов = Null Тогда
				
				СтрокаСписка.Данные.ВидыФайлов = Строка(Выборка.ВидФайла);
				
			Иначе
				
				СтрокаСписка.Данные.ВидыФайлов = СтрокаСписка.Данные.ВидыФайлов + ", " + Строка(Выборка.ВидФайла);
				
			КонецЕсли;
			
		Исключение 
			
		КонецПопытки
		 
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьПуть(Ссыл)
	
	Возврат Ссыл.ПутьКПапке;
	
КонецФункции

&НаСервере
Процедура УстановитьДатуВывозаИзПортаНаСервере(Ссыл, ДатаРезультат)
	
	Об = Ссыл.ПолучитьОбъект();
	
	Для Каждого Стр Из Об.Контейнеры Цикл
		
		Стр.ДатаВывозаИзПорта = ДатаРезультат;
		
	КонецЦикла;
	
	Об.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВывозаИзПортаПослеВводаЗначения(Результат, ДопПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл 	
			
			УстановитьДатуВывозаИзПортаНаСервере(Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Ссылка, Результат);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВывозаИзПорта(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьДатуВывозаИзПортаПослеВводаЗначения", ЭтотОбъект);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КД);
	
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущаяДата(), "Укажите дату", ОписаниеТипов);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуВыгрузкиСуднаДОНаСервере(Ссыл, ДатаРезультат)
	
	Об = Ссыл.ПолучитьОбъект();
	
	Для Каждого Стр Из Об.Контейнеры Цикл
		
		Стр.ДатаВыгрузкиСуднаДО = ДатаРезультат;
		
	КонецЦикла;
	
	Об.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВыгрузкиСуднаДОПослеВводаЗначения(Результат, ДопПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл 	
			
			УстановитьДатуВыгрузкиСуднаДОНаСервере(Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Ссылка, Результат);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВыгрузкиСуднаДО(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьДатуВыгрузкиСуднаДОПослеВводаЗначения", ЭтотОбъект);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КД);
	
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущаяДата(), "Укажите дату", ОписаниеТипов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуВыгрузкиУКлиентаНаСервере(Ссыл, ДатаРезультат)
		
	Об = Ссыл.ПолучитьОбъект();
	
	Для Каждого Стр Из Об.Контейнеры Цикл
		
		Стр.ДатаВыгрузкиУКлиента = ДатаРезультат;
		
	КонецЦикла;
	 	
	Об.Записать();

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДатуВыгрузкиУКлиентаПослеВводаЗначения(Результат, ДопПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл 	
			
			УстановитьДатуВыгрузкиУКлиентаНаСервере(Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Ссылка, Результат);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВыгрузкиУКлиента(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьДатуВыгрузкиУКлиентаПослеВводаЗначения", ЭтотОбъект);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КД);
	
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущаяДата(), "Укажите дату", ОписаниеТипов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуОкончанияДействияРелизаНаСервере(Ссыл, ДатаРезультат)
		
	Об = Ссыл.ПолучитьОбъект();
	
	Для Каждого Стр Из Об.Контейнеры Цикл
		
		Стр.ДатаОкончанияДействияРелиза = ДатаРезультат;
		
	КонецЦикла;
	 	
	Об.Записать();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуОкончанияДействияРелизаПослеВводаЗначения(Результат, ДопПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл 	
			
			УстановитьДатуОкончанияДействияРелизаНаСервере(Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Ссылка, Результат);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуОкончанияДействияРелиза(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьДатуОкончанияДействияРелизаПослеВводаЗначения", ЭтотОбъект);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КД);
	
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущаяДата(), "Укажите дату", ОписаниеТипов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуСдачиПорожнегоКонтейнераНаСервере(Ссыл, ДатаРезультат)
		
	Об = Ссыл.ПолучитьОбъект();
	
	Для Каждого Стр Из Об.Контейнеры Цикл
		
		Стр.ДатаСдачиПорожнегоКонтейнера = ДатаРезультат;
		
	КонецЦикла;
		
	Об.Записать();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуСдачиПорожнегоКонтейнераПослеВводаЗначения(Результат, ДопПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл 	
			
			УстановитьДатуСдачиПорожнегоКонтейнераНаСервере(Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Ссылка, Результат);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуСдачиПорожнегоКонтейнера(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьДатуСдачиПорожнегоКонтейнераПослеВводаЗначения", ЭтотОбъект);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КД);
	
	ПоказатьВводЗначения(ОписаниеОповещения, ТекущаяДата(), "Укажите дату", ОписаниеТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПроверкаСредствДляРелиза(Команда)
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		СменитьСтатусНаПроверкаСредствДляРелиза(Элементы.Список.ДанныеСтроки(Стр).Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура СменитьСтатусНаПроверкаСредствДляРелиза(Ссыл)  
	
	НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Сделка.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 Тогда
		
		МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
		
		МЗ.Сделка = Ссыл;
		МЗ.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.ПроверкаСредствДляРелиза;
		МЗ.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
		МЗ.Записать();
		
	Иначе
		
		Для Каждого Запись ИЗ НЗ Цикл 
			
			Запись.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.ПроверкаСредствДляРелиза;
			Запись.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусБалансПодтвержден(Команда)
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		СменитьСтатусНаБалансПодтвержден(Элементы.Список.ДанныеСтроки(Стр).Ссылка);
		
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура СменитьСтатусНаБалансПодтвержден(Ссыл)  
	
	НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Сделка.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 Тогда
		
		МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
		
		МЗ.Сделка = Ссыл;
		МЗ.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.БалансПодтвержден;
		МЗ.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
		МЗ.Записать();
		
	Иначе
		
		Для Каждого Запись ИЗ НЗ Цикл 
			
			Запись.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.БалансПодтвержден;
			Запись.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры

