
&НаКлиенте
Процедура ЛГС_ТолькоНеРаспределенныеПриИзмененииПосле(Элемент)
	
	Если ТолькоНеРаспределенные Тогда        
		
		УстановитьОтборПоНераспределеннымНаСервере();
		
	Иначе
		
		Список.Отбор.Элементы.Очистить();	
		
	КонецЕсли;	  
	
	Элементы.Список.Обновить();

КонецПроцедуры                                  

&НаСервере
Процедура УстановитьОтборПоНераспределеннымНаСервере()  
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));    
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распределено");         
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;        
	ЭлементОтбора.Использование = Истина;    
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	СписокНоменклатуры = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыРасходовСделки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыРасходовСделки.Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокНоменклатуры.Добавить(Выборка.Номенклатура);
		
	КонецЦикла;

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));    
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Номенклатура");         
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;        
	ЭлементОтбора.Использование = Истина;    
	ЭлементОтбора.ПравоеЗначение = СписокНоменклатуры;
	 
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ++ ХАУНД Устинин 04.06.2026 ID: 4410
	Элементы.ФормаИзменитьСтатус.Доступность = ОбщегоНазначения.ПользовательМожетМенятьСтатусДокумента();
	// -- ХАУНД Устинин 04.06.2026 ID: 4410
	
КонецПроцедуры
