
//Двойной клик
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	Отчет.РежимРасшифровки = Истина;
	
	СтруктураПараметровРасшифровки = ВычислениеДанныхРасшифровки(Расшифровка); 
	
	Если СтруктураПараметровРасшифровки.Номенклатура = Неопределено Тогда
		
		 ПоказатьПредупреждение(,"Неверно выбрана ячейка для расшифровки",,"ОШИБКА!");
		 Возврат;
		
	КонецЕсли;	
	
	ОткрытьФорму("Отчет.ПокупкиПоНоменклатуре.Форма.ФормаРасшифровки",СтруктураПараметровРасшифровки,ЭтаФорма,Новый УникальныйИдентификатор()); 
 
КонецПроцедуры

&НаСервере
Функция ВычислениеДанныхРасшифровки(Расшифровка)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Отчет");
 
    
 
 	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);

    Группировки = Данные.Элементы.Получить(Расшифровка).ПолучитьРодителей();
	
	Если Группировки.Количество() > 0 Тогда
		
		ИдентификаторГруппировки0 = Группировки[0].Идентификатор;
		
		ПоляГруппировки = Данные.Элементы.Получить(ИдентификаторГруппировки0).ПолучитьПоля();
		
		Для Каждого ПолеГруппировка Из ПоляГруппировки Цикл //находим нужную группировку  по строке
			
			Если ПолеГруппировка.Поле = "Номенклатура" Тогда
				
				НоменклатураРасш = ПолеГруппировка.Значение;              
				
			КонецЕсли;  
			
		КонецЦикла; 
		
		
		Если Группировки.Количество() > 1 Тогда
			
			ИдентификаторГруппировки1 = Группировки[1].Идентификатор;
			
			ПоляГруппировки1 = Данные.Элементы.Получить(ИдентификаторГруппировки1).ПолучитьПоля();
			
			Для Каждого ПолеГруппировка1 Из ПоляГруппировки1 Цикл //находим нужную группировку по колонке
				
				Если ПолеГруппировка1.Поле = "Период.ЧастиДат.НазваниеМесяца" Тогда
										
					ПериодНачало = Дата(Формат(Отчет.НачалоПериода,"ДФ=yyyy") + Формат(ПолеГруппировка1.Значение,"ЧЦ=2; ЧВН=") + "01");
					ПериодОкончания = КонецМесяца(ПериодНачало);
					
				КонецЕсли;  
				
			КонецЦикла;                                           
			
		КонецЕсли;
		
		

	КонецЕсли;
	

	
 ТекущиеНастройкиОтчета = Отчет.КомпоновщикНастроек.ПолучитьНастройки();	

 ПараметрПериод=ТекущиеНастройкиОтчета.ПараметрыДанных.Элементы.Найти("Период");
	
 
 
 Если ПериодНачало = Неопределено  Тогда
	 
	ПериодНачало = Отчет.НачалоПериода;
	ПериодОкончания = Отчет.КонецПериода;
	
КонецЕсли;

   НачалоПериода = ПериодНачало;
   КонецПериода = ПериодОкончания;  
   
   ДанныеПраметровРасшифровки = Новый Структура;
   ДанныеПраметровРасшифровки.Вставить("НачалоПериода",НачалоПериода);
   ДанныеПраметровРасшифровки.Вставить("КонецПериода",КонецПериода);
   ДанныеПраметровРасшифровки.Вставить("Номенклатура",НоменклатураРасш);
   ДанныеПраметровРасшифровки.Вставить("ДанныеРасшифровки",ДанныеРасшифровки); 
   
   Отчет.Номенклатура = НоменклатураРасш;
   
   Возврат ДанныеПраметровРасшифровки;
 
КонецФункции

&НаСервере 
Функция ПолучитьЗначениеРасшифровки(Расшифровка) 
	
	Структура = Новый Структура;
	ДанныеРасшифровкиКомпоновки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ПоляРасшифровки = ДанныеРасшифровкиКомпоновки.Элементы[Расшифровка].ПолучитьПоля();

	Для каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
	    Структура.Вставить(ПолеРасшифровки.Поле, ПолеРасшифровки.Значение);
	КонецЦикла;	
	
	Возврат Структура;

КонецФункции


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	СтруктураРеквизитов = БухгалтерскиеОтчеты.БазовыеРеквизитыЗначенияПоУмолчанию();
	
	Отчет.Организация = СтруктураРеквизитов.Организация; 
	
	Отчет.РежимРасшифровки = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	
	Отчет.РежимРасшифровки = Ложь;
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);	
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)

	Отчет.НачалоПериода = Отчет.НачалоПериода;
	Отчет.КонецПериода = Отчет.КонецПериода;
	
КонецПроцедуры

// Клик правой кнопкой мышки - отключена обработка
&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Отчет.НачалоПериода, Отчет.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры   

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Отчет, РезультатВыбора, "НачалоПериода,КонецПериода");
	
	ОбновитьТекстЗаголовка(ЭтотОбъект); 
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	Название = ?(ЗначениеЗаполнено(Форма.ПредставлениеТекущегоВарианта), Форма.ПредставлениеТекущегоВарианта, "Покупки по номенклатуре");
	
	ЗаголовокОтчета = Название + БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, Отчет.КонецПериода);
	
	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ОбновитьТекстЗаголовка(ЭтотОбъект);
	
	//БухгалтерскиеОтчетыКлиент.ПриОткрытии(ЭтотОбъект, Отказ); 
	
	ПолеОрганизация = Отчет.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОрганизацияПриИзменении(Элемент)
	
	Отчет.Организация = ПолеОрганизация;
	
КонецПроцедуры


