Функция ПолучитьНомерСтатуса(Статус, ВидСделки) Экспорт
	
	Если ВидСделки = Перечисления.ВидыСделок.Автоперевозка Тогда   
		
		Если Статус = Перечисления.СтатусыСделок.ЗаявкаОтправлена Тогда
			Возврат 1;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ЗаявкаПодписана Тогда
			Возврат 2;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ПрибылНаПогрузку Тогда
			Возврат 3;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ПогруженВыехалНаВыгрузку Тогда
			Возврат 4;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.НаВыгрузке Тогда
			Возврат 5;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Выгружен Тогда
			Возврат 6;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ДокументыОтправлены Тогда
			Возврат 7;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Отменена ИЛИ Статус = Перечисления.СтатусыСделок.Удалена Тогда
			Возврат 8;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Завершена Тогда
			Возврат 10;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.КонтрольПередЗакрытием Тогда
			Возврат 9;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Закрыта Тогда
			Возврат 10;
		КонецЕсли;	
		
	ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Сертификация  Тогда
		
		Если Статус = Перечисления.СтатусыСделок.ЗаявкаПолучена Тогда
			Возврат 1;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ДокументыПолучены Тогда
			Возврат 2;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.МакетОтправлен Тогда
			Возврат 3;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.СертификатВыпущен Тогда
			Возврат 4;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Отменена ИЛИ Статус = Перечисления.СтатусыСделок.Удалена Тогда
			Возврат 7;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Завершена Тогда
			Возврат 10;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.КонтрольПередЗакрытием Тогда
			Возврат 9;
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Закрыта Тогда
			Возврат 10;
		КонецЕсли;	
		
	Иначе	
		
		Если Статус = Перечисления.СтатусыСделок.Новая Тогда
			
			Возврат 1;  
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ВРаботе ИЛИ Статус = Перечисления.СтатусыСделок.ВПорту 
			ИЛИ Статус = Перечисления.СтатусыСделок.ПодготовкаДТ Тогда
			
			Возврат 2;
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.НаПодходе ИЛИ Статус = Перечисления.СтатусыСделок.ПодачаДТ Тогда
			
			Возврат 3; 
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Выгружен ИЛИ Статус = Перечисления.СтатусыСделок.ВыходИзПорта 
			ИЛИ Статус = Перечисления.СтатусыСделок.ГотовКВывозу ИЛИ Статус = Перечисления.СтатусыСделок.ДТПодана Тогда
			
			Возврат 4; 
			
		ИначеЕсли  Статус = Перечисления.СтатусыСделок.ТаможенныйКонтроль Тогда
			
			Возврат 5;	
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Вывезен ИЛИ Статус = Перечисления.СтатусыСделок.SWBОформлен
			ИЛИ Статус = Перечисления.СтатусыСделок.Осмотр ИЛИ Статус = Перечисления.СтатусыСделок.МИДК ИЛИ Статус = Перечисления.СтатусыСделок.Досмотр
			ИЛИ Статус = Перечисления.СтатусыСделок.КТС Тогда
			
			Возврат 5; 
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Доставлен ИЛИ Статус = Перечисления.СтатусыСделок.ВыпускДТ Тогда
			
			Возврат 6;
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.СданПорожний ИЛИ Статус = Перечисления.СтатусыСделок.ППД ИЛИ Статус = Перечисления.СтатусыСделок.НТД Тогда
			
			Возврат 7; 
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ВыставленыВсеРасходы Тогда
			
			Возврат 8;
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ДокументыПодготовлены Тогда
			
			Возврат 8;
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.КонтрольПередЗакрытием Тогда
			
			Возврат 9;	
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Закрыта ИЛИ Статус = Перечисления.СтатусыСделок.Завершена Тогда
			
			Возврат 10;
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Отменена ИЛИ Статус = Перечисления.СтатусыСделок.Удалена Тогда
			
			Возврат 0;
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.Задержана Тогда
			
			Возврат 0;
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ПретензияСуд Тогда
			
			Возврат 0;
			
		ИначеЕсли Статус = Перечисления.СтатусыСделок.ПустаяСсылка() Тогда   // тестовая удалить
			
			Возврат 0;	
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции

Функция ЕстьРоль(ИмяРоли, Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		|		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
		|ГДЕ
		|	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
		|	И ГруппыДоступаПользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Роль", ИмяРоли);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;		
	Иначе	
		Возврат Истина;		
	КонецЕсли;
	
КонецФункции

Процедура ПроведениеСчетаНаОплатуПокупателюРеестрОплатыСчетов(Объект) Экспорт
	
	
	
КонецПроцедуры

Функция ПолучитьПрефиксДляСделки(ВидСделки) Экспорт
	
	Если ВидСделки = Перечисления.ВидыСделок.Экспорт Тогда
		
		Возврат "E";
		
	ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Декларирование Тогда
		
		Возврат "D";
		
	ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Автоперевозка Тогда	
		
		Возврат "A";
		
	ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Сертификация Тогда	
		
		Возврат "S";
		
	Иначе
		
		Возврат ПользователиКлиентСервер.ТекущийПользователь().ПрефиксДляСделок;;
		
	КонецЕсли;
		
	
КонецФункции

// Функция проверки наличия нераспределенной номенклатуры документов при налиичии
// этой номенклатуры в Видах расходов сделки
//
// ТабНоменклатура - Проверяемая таблица документа
// ТабРаспределениеСумм - Таблица распределения сумм по выдам услуг документа
// ВидыРасходов - Таблица из запроса к РС ВидыРасходовСделки
Функция ПолучитьРезультатПроверкиРаспределенные(ТабНоменклатура, ТабРаспределениеСумм, ВидыРасходов) Экспорт
	
	 НаличиеНераспределено = Ложь;
	
	 Для каждого стрТовар из ТабНоменклатура Цикл
		 
		 НомВидаРасхода = ВидыРасходов.Найти(стрТовар.Номенклатура);
		 
		 Если НомВидаРасхода <> Неопределено Тогда 
			 
			 ОтборРаспределено = Новый Структура;
			 ОтборРаспределено.Вставить("КлючСвязи",стрТовар.КлючСвязиРаспределения);
			 СтрокиРаспределено = ТабРаспределениеСумм.НайтиСтроки(ОтборРаспределено);
			 
			 Если СтрокиРаспределено.Количество() = 0 Тогда
				 
				 НаличиеНераспределено = Истина; 
				 
			 КонецЕсли;
			 
		 КонецЕсли;	 
		 
	 КонецЦикла;  
	 
	 Возврат  НаличиеНераспределено;

КонецФункции 

// <Описание функции>
// Функция для расчета суммы НДС для отчета Продажи С НДС
//  
Функция РасчетНДСДляПродажиСНДС(Сумма, СтавкаНДС) Экспорт

	СуммаНДС = ОКР(Сумма / (1+(СтавкаНДС/100)) * (СтавкаНДС/100), 2);

	Возврат СуммаНДС
 
КонецФункции 

Функция ПолучитьСтатусыСделки(Сделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	СтатусыСделок.Сделка КАК Сделка,
		|	СтатусыСделок.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыСделок КАК СтатусыСделок
		|ГДЕ
		|	СтатусыСделок.Сделка = &Сделка
		|";     
	Запрос.УстановитьПараметр("Сделка",Сделка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Статус;

КонецФункции 

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    // перед удалением реквизита из массива необходимо проверить, что он там есть
    // (не был удален ранее платформой или в коде).
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры

Функция ДублируетПоВходящимРеквизитам(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЕстьДубли
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	СчетНаОплатуПоставщика.НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И СчетНаОплатуПоставщика.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		|	И СчетНаОплатуПоставщика.Ссылка <> &Ссылка
		|	И СчетНаОплатуПоставщика.Контрагент = &Контрагент";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетНаОплатуПоставщика", Объект.Метаданные().Имя);
	
	Запрос.УстановитьПараметр("ДатаВходящегоДокумента", Объект.ДатаВходящегоДокумента);
	Запрос.УстановитьПараметр("НомерВходящегоДокумента", Объект.НомерВходящегоДокумента);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество() <> 0;

КонецФункции // ()

// Вызывается перед записью документов, у которых в структуре подчиненности мы ожидаем увидеть сделку.
// Устанавливает отказ записи, если статус сделки - Закрыта
//
Процедура ЛГС_ПередЗаписьюДокументаПоСделкеОбработчик(ОбъектДокумента, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если ОбъектДокумента.ОбменДанными.Загрузка Или ЕстьРоль("ЛогистикаАдминистратор") Тогда
		Возврат;
	КонецЕсли;
	
	ВсеРодительскиеСделки = СвязанныеСделки(ОбъектДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыСделок.Сделка) КАК Сделка,
		|	СтатусыСделок.Статус КАК Статус,
		|	СтатусыСделок.ПодстатусБухгалтерия КАК ПодстатусБухгалтерия,
		|	СтатусыСделок.ПодстатусФинОтдел КАК ПодстатусФинОтдел,
		|	СтатусыСделок.ПодстатусОплатаВЛинию КАК ПодстатусОплатаВЛинию,
		|	СтатусыСделок.ДатаВремяПоследнейСменыПодстатусаФинОтдел КАК ДатаВремяПоследнейСменыПодстатусаФинОтдел,
		|	СтатусыСделок.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию КАК ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию
		|ИЗ
		|	РегистрСведений.СтатусыСделок КАК СтатусыСделок
		|ГДЕ
		|	СтатусыСделок.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСделок.Закрыта)
		|	И СтатусыСделок.Сделка В(&ПроверяемыеСделки)";
	
	Запрос.УстановитьПараметр("ПроверяемыеСделки", ВсеРодительскиеСделки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("С документом %1 связана %2 в статусе ""Закрыта"", перезапись невозможна.", 
			ОбъектДокумента, Выборка.Сделка);
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

// Возвращает все связанные с документом сделки для дальнейшей проверки
//
// Параметры:
//  Документ  - ДокументОбъект - проверяемый документ
//
// Возвращаемое значение:
//   Массив из ДокументСсылка.Сделка - связанные сделки
//
Функция СвязанныеСделки(Документ)
	Результат = Новый Массив;
	ДеревоРодительскиеОбъекты = Новый ДеревоЗначений;
	ДеревоРодительскиеОбъекты.Колонки.Добавить("Ссылка");
	
	ВыведенныеОбъекты = Новый Соответствие;
	
	ЗаполнитьРодительскиеОбъекты(Документ, ДеревоРодительскиеОбъекты, ВыведенныеОбъекты,,, Документ);
	ЗаполнитьМассивСделокИзДереваРодителей(ДеревоРодительскиеОбъекты, Результат);
	Возврат Результат;
КонецФункции // СвязанныеСделки()

Процедура ЗаполнитьМассивСделокИзДереваРодителей(Дерево, МассивЗаполнения)
	Если ТипЗнч(Дерево) = Тип("СтрокаДереваЗначений") И ТипЗнч(Дерево.Ссылка) = Тип("ДокументСсылка.Сделка") Тогда
		МассивЗаполнения.Добавить(Дерево.Ссылка);
	КонецЕсли;
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		ЗаполнитьМассивСделокИзДереваРодителей(СтрокаДерева, МассивЗаполнения);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьМассивСделокИзДереваРодителей()

// Заполняет все документы выше в структуре подчиненности над объектом
//
Процедура ЗаполнитьРодительскиеОбъекты(ТекущийОбъект, ДеревоРодитель, ВыведенныеОбъекты, 
    СлужебныеОбъекты = Неопределено, ИндексСвязейОбъектов = Неопределено, ОсновнойОбъект)

	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	СписокРеквизитов  = Новый ТаблицаЗначений;
	СписокРеквизитов.Колонки.Добавить("Значение");
	СписокРеквизитов.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	Если СлужебныеОбъекты = Неопределено Тогда 
		СлужебныеОбъекты = Новый Соответствие;
	КонецЕсли;
	
	Если ИндексСвязейОбъектов = Неопределено Тогда 
		ИндексСвязейОбъектов = Новый Соответствие;
	КонецЕсли;
	
	ВестиУчетПоДоговорам = ПолучитьФункциональнуюОпцию("ВестиУчетПоДоговорам");
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		
		Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) 
			И Не Метаданные.КритерииОтбора.ЛГС_СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда	  
			
			Продолжить;
			
		КонецЕсли;
			
		Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл
			
			МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
			Если МетаданныеРеквизита = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеРеквизита)
				Или Не ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Метаданные.Документы.Содержит(МетаданныеРеквизита)
				И Не Метаданные.Справочники.Содержит(МетаданныеРеквизита)
				И Не Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекущийТип = Тип("СправочникСсылка.ДоговорыКонтрагентов")
				И (ТекущийОбъект <> ОсновнойОбъект
				Или Не ВестиУчетПоДоговорам) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеРеквизита = ТекущийОбъект[Реквизит.Имя];
			Если ЗначениеЗаполнено(ЗначениеРеквизита)
				И ТипЗнч(ЗначениеРеквизита) = ТекущийТип
				И ЗначениеРеквизита <> ТекущийОбъект
				И СписокРеквизитов.Найти(ЗначениеРеквизита, "Значение") = Неопределено Тогда
				
				ЯвляетсяДокументом  = ОбщегоНазначения.ЭтоДокумент(МетаданныеРеквизита) 
					Или МетаданныеРеквизита = Метаданные.Справочники.ДоговорыКонтрагентов;
				
				СтрокаРеквизита = СписокРеквизитов.Добавить();
				СтрокаРеквизита.Значение = ЗначениеРеквизита;
				Если ЯвляетсяДокументом Тогда
					ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеРеквизита, "Дата", Истина);
					СтрокаРеквизита.Дата = ДатаДокумента;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ТЧ Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		
		ИменаРеквизитов = "";
		СодержимоеТЧ = ТекущийОбъект[ТЧ.Имя].Выгрузить(); // ТаблицаЗначений
		Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
			
			Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда 
				
				
				Если Не Метаданные.КритерииОтбора.ЛГС_СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда	
					Продолжить;  			
				КонецЕсли;	
				
				
			КонецЕсли;
			
			Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл
				
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				Если МетаданныеРеквизита = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеРеквизита) 
					Или Не ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					Продолжить;
				КонецЕсли;
				
				Если Не Метаданные.Документы.Содержит(МетаданныеРеквизита)
					И Не Метаданные.Справочники.Содержит(МетаданныеРеквизита)
					И Не Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеРеквизита) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТекущийТип = Тип("СправочникСсылка.ДоговорыКонтрагентов")
					И (ТекущийОбъект <> ОсновнойОбъект
					Или Не ВестиУчетПоДоговорам) Тогда
					Продолжить;
				КонецЕсли;
				
				ИменаРеквизитов = ИменаРеквизитов + ?(ИменаРеквизитов = "", "", ", ") + Реквизит.Имя;
				Прервать;
				
			КонецЦикла;
			
		КонецЦикла;
		
		СодержимоеТЧ.Свернуть(ИменаРеквизитов);
		Для Каждого КолонкаТЧ Из СодержимоеТЧ.Колонки Цикл
			
			Для Каждого СтрокаТЧ Из СодержимоеТЧ Цикл
				
				ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеЗначения) 
					Или Не ПравоДоступа("Чтение", МетаданныеЗначения) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеРеквизита = ТекущийОбъект
					Или СписокРеквизитов.Найти(ЗначениеРеквизита, "Значение") <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ЯвляетсяДокументом  = ОбщегоНазначения.ЭтоДокумент(МетаданныеЗначения) 
					Или МетаданныеЗначения = Метаданные.Справочники.ДоговорыКонтрагентов;
				Если Не ЯвляетсяДокументом И Не Метаданные.Справочники.Содержит(МетаданныеЗначения)
					И Не Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеЗначения) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаРеквизита = СписокРеквизитов.Добавить();
				СтрокаРеквизита.Значение = ЗначениеРеквизита;
				Если ЯвляетсяДокументом Тогда
					ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеРеквизита, "Дата", Истина);
					СтрокаРеквизита.Дата = ДатаДокумента;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	СписокРеквизитов.Сортировать("Дата");
	
	Для каждого ЭлементСписка Из СписокРеквизитов Цикл
		
		Если ИндексСвязейОбъектов[ТекущийОбъект] = ЭлементСписка.Значение Тогда 
			Продолжить;
		КонецЕсли;
		
		ИндексСвязейОбъектов.Вставить(ТекущийОбъект, ЭлементСписка.Значение);
		
		НоваяСтрока = ДеревоРодитель.Строки.Добавить();
		НоваяСтрока.Ссылка = ЭлементСписка.Значение;
		
		Если Не ДобавляемыйОбъектИмеетсяСредиРодителей(ДеревоРодитель, ЭлементСписка.Значение, ОсновнойОбъект) Тогда
			
			ЗаполнитьРодительскиеОбъекты(ЭлементСписка.Значение, НоваяСтрока, ВыведенныеОбъекты,
			СлужебныеОбъекты, ИндексСвязейОбъектов, ОсновнойОбъект);
			
		ИначеЕсли СлужебныеОбъекты[ЭлементСписка.Значение] = Неопределено Тогда 
			
			СлужебныеОбъекты.Вставить(ЭлементСписка.Значение, Истина);
			Если ЭлементСписка.Значение = ОсновнойОбъект Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьРодительскиеОбъекты(ЭлементСписка.Значение, ДеревоРодитель, ВыведенныеОбъекты,
			СлужебныеОбъекты, ИндексСвязейОбъектов, ОсновнойОбъект);
			
		КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры

// Проверяет, есть ли объект в заполненной структуре подчиненности над основным объектом
Функция ДобавляемыйОбъектИмеетсяСредиРодителей(СтрокаРодитель, ИскомыйОбъект, ОсновнойОбъект)
	
	Если ИскомыйОбъект = ОсновнойОбъект Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаРодитель) = Тип("ДеревоЗначений") Тогда
		Возврат Ложь; 
	КонецЕсли;
	
	ТекущийРодитель = СтрокаРодитель;
	
	Пока ТекущийРодитель <> Неопределено Цикл
		
		Если ТекущийРодитель.Ссылка = ИскомыйОбъект Тогда
			Возврат Истина;
		КонецЕсли;
		
		ТекущийРодитель = ТекущийРодитель.Родитель;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает строка для описания содержания в ТЧ расходы клиента документа Сделка
// ++ Устинин С.А. 13.10.2026 ID 10258 
Функция СтрокаКонтейнер() Экспорт
	
	СтрокаКонтейнер = "к\р";
	ИННОрганизации = Справочники.Организации.ОрганизацияПоУмолчанию().ИНН; 
	Если ИННОрганизации = "5074080761" ИЛИ ИННОрганизации = "2315213101" Тогда
		СтрокаКонтейнер = "контейнер";
	КонецЕсли;
	
	Возврат СтрокаКонтейнер;
	
КонецФункции
// -- Устинин С.А. 13.10.2026 ID 10258