
&НаСервере
Процедура ЛГС_ПровереноПослеНаСервере(Ссыл) 
	
	НЗ = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.Проверено = Истина;
			Запись.Проверил = ПользователиКлиентСервер.ТекущийПользователь();
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Запись = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьМенеджерЗаписи();
		Запись.Документ = Ссыл;
		Запись.Проверено = Истина;
		Запись.Проверил = ПользователиКлиентСервер.ТекущийПользователь();
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ПровереноПосле(Команда) 
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		ЛГС_ПровереноПослеНаСервере(Ссыл);
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_НеПровереноПослеНаСервере(Ссыл) 
	
	НЗ = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.Проверено = Ложь;
			Запись.Проверил = Неопределено;
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Запись = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьМенеджерЗаписи();
		Запись.Документ = Ссыл;
		Запись.Проверено = Ложь;
		Запись.Проверил = Неопределено;
		Запись.Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛГС_НеПровереноПосле(Команда) 
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		ЛГС_НеПровереноПослеНаСервере(Ссыл);
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТолькоНеРаспределенныеПриИзмененииПосле(Элемент)
	
	Если ТолькоНеРаспределенные Тогда        
		
		УстановитьОтборПоНераспределеннымНаСервере();
		
	Иначе
		
		Список.Отбор.Элементы.Очистить();	
		
	КонецЕсли;	  
	
	Элементы.Список.Обновить();

КонецПроцедуры                                  

&НаСервере
Процедура УстановитьОтборПоНераспределеннымНаСервере()  
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));    
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распределено");         
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;        
	ЭлементОтбора.Использование = Истина;    
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	СписокНоменклатуры = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыРасходовСделки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыРасходовСделки.Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокНоменклатуры.Добавить(Выборка.Номенклатура);
		
	КонецЦикла;
	
	ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.Использование  = Истина;
	ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));    
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Номенклатура");         
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;        
	ЭлементОтбора.Использование = Истина;    
	ЭлементОтбора.ПравоеЗначение = СписокНоменклатуры;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));    
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Услуги.Номенклатура");         
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;        
	ЭлементОтбора.Использование = Истина;    
	ЭлементОтбора.ПравоеЗначение = СписокНоменклатуры;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));    
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АгентскиеУслуги.Номенклатура");         
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;        
	ЭлементОтбора.Использование = Истина;    
	ЭлементОтбора.ПравоеЗначение = СписокНоменклатуры; 
	
КонецПроцедуры
