
&После("ОбработкаПроведения")
Процедура ЛГС_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.РеестрОплатыСчетов.Записывать = Истина; 
	
	Для Каждого Стр Из ЭтотОбъект.РасшифровкаПлатежа Цикл 
		
		Если ЗначениеЗаполнено(Стр.СчетНаОплату) Тогда 
			
			СтрДвижение = Движения.РеестрОплатыСчетов.ДобавитьРасход();
			
			СтрДвижение.СчетНаОплату = Стр.СчетНаОплату;
			
			СтрДвижение.Сумма = Стр.СуммаПлатежа; 
			
			СтрДвижение.Период = ЭтотОбъект.Дата; 
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Движения.РеестрОплатыСчетов.Записать();
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура ЛГС_ОбработкаУдаленияПроведения(Отказ) 
	
	Движения.РеестрОплатыСчетов.Очистить();
	
	Движения.РеестрОплатыСчетов.Записать();
	
КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура ЛГС_ОбработкаПроведения1(Отказ, РежимПроведения) 
	
	Если Не ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда	
		
		Для Каждого Стр ИЗ ЭтотОбъект.РасшифровкаПлатежа Цикл
			
			Если ЗначениеЗаполнено(Стр.СчетНаОплату) Тогда
				
				Если ?(Стр.СуммаПлатежа = Стр.СуммаВзаиморасчетов, Стр.СуммаПлатежа, Стр.СуммаВзаиморасчетов) > Стр.СчетНаОплату.СуммаДокумента Тогда
					
					Отказ = Истина;
					
					Сообщение = Новый СообщениеПользователю;            
					Сообщение.Текст = "Сумма документа превышает оплату клиента по " + Строка(Стр.СчетНаОплату);
					Сообщение.Сообщить();
					
					Продолжить;
					
				КонецЕсли;
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = "ВЫБРАТЬ
				|	СУММА(ОплатаСчетовОбороты.СуммаОборот) КАК СуммаОборот
				|ИЗ
				|	РегистрНакопления.ОплатаСчетов.Обороты(, , Регистратор, СчетНаОплату = &СчетНаОплату) КАК ОплатаСчетовОбороты
				|ГДЕ
				|	ОплатаСчетовОбороты.Регистратор <> &Регистратор";
				
				Запрос.УстановитьПараметр("СчетНаОплату", Стр.СчетНаОплату);
				Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					
					Если Выборка.СуммаОборот <> Null И Выборка.СуммаОборот <> Неопределено Тогда
						
						Если ?(Стр.СуммаПлатежа = Стр.СуммаВзаиморасчетов, Стр.СуммаПлатежа, Стр.СуммаВзаиморасчетов) + Выборка.СуммаОборот > Стр.СчетНаОплату.СуммаДокумента Тогда
							
							Отказ = Истина;
							
							Сообщение = Новый СообщениеПользователю;            
							Сообщение.Текст = "Сумма документа превышает оплату клиента по " + Строка(Стр.СчетНаОплату);
							Сообщение.Сообщить();
							
						КонецЕсли;   
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
