
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Колонки") Тогда
		
		Для Каждого Эл Из Параметры.Колонки Цикл
			
			НСтр = ТЧ.Добавить();
			НСтр.ИмяКолонки = Эл.Ключ;
			НСтр.Использовать = Эл.Значение;
			НСтр.Порядок = Параметры.КолонкиПорядок[Эл.Ключ];
			
		КонецЦикла;
			
	КонецЕсли;
	
	ТЧ.Сортировать("Порядок Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	
	ТекКолонки = Новый Соответствие;
	
	Для каждого Стр ИЗ ТЧ Цикл
		
		ТекКолонки.Вставить(Стр.ИмяКолонки, Стр.Использовать);	
		
	КонецЦикла; 
	
	ЭтаФорма.Закрыть(ТЧ);
	
КонецПроцедуры

&НаСервере
Функция НаСервере()
	
    ТЗ = ДанныеФормыВЗначение(ТЧ, Тип("ТаблицаЗначений"));
	
	Массив = ТЗ.Выгрузить();
	
	Возврат Массив;
	
КонецФункции
