&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрКоманды);
	
	ОбъектыПечати = Новый СписокЗначений; 
	ИмяМакета = "ПоручениеЭкспедитору"; 
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПоручениеЭкспедитору");
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Поручение экспедитору"; 
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуПорученияЭкспедитору(МассивОбъектов, ОбъектыПечати, ИмяМакета); 
	
	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуПорученияЭкспедитору(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоручениеЭкспедитору"; 
	ТабличныйДокумент.Защита = Истина;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументПоручениеЭкспедитору(ТабличныйДокумент, МассивОбъектов[0]); 	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументПоручениеЭкспедитору(ТабДок, Док)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Поручение_Экспедитору";
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	//|	ПоручениеЭкспедитору.Номер КАК Номер,
	//|	ПоручениеЭкспедитору.Дата КАК Дата,
	//|	ПоручениеЭкспедитору.Проведен КАК Проведен,
	//|	ПоручениеЭкспедитору.Грузоотправитель КАК Грузоотправитель,
	//|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	//|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	//|	ПоручениеЭкспедитору.Грузополучатель КАК Грузополучатель,
	//|	ПоручениеЭкспедитору.Договор КАК Договор,
	//|	ПоручениеЭкспедитору.УведомитьСторонуОПрибытииГруза КАК УведомитьСторонуОПрибытииГруза,
	//|	ПоручениеЭкспедитору.СтранаПроисхожденияГруза КАК СтранаПроисхожденияГруза,
	//|	ПоручениеЭкспедитору.ТоварыГотовыеКОтправкеМестоИДата КАК ТоварыГотовыеКОтправкеМестоИДата,
	//|	ПоручениеЭкспедитору.ВидТранспорта КАК ВидТранспорта,
	//|	ПоручениеЭкспедитору.ПунктНазначения КАК ПунктНазначения,
	//|	ПоручениеЭкспедитору.Страхование КАК Страхование,
	//|	ПоручениеЭкспедитору.ТоварныйКод КАК ТоварныйКод,
	//|	ПоручениеЭкспедитору.Маркировка КАК Маркировка,
	//|	ПоручениеЭкспедитору.КоличествоМестВидУпаковки КАК КоличествоМестВидУпаковки,
	//|	ПоручениеЭкспедитору.ВесБруттоНетто КАК ВесБруттоНетто,
	//|	ПоручениеЭкспедитору.Объем КАК Объем,
	//|	ПоручениеЭкспедитору.СтоимостьГруза КАК СтоимостьГруза,
	//|	ПоручениеЭкспедитору.РазмерУпаковки КАК РазмерУпаковки,
	//|	ПоручениеЭкспедитору.ТребуемыеДокументы КАК ТребуемыеДокументы,
	//|	ПоручениеЭкспедиторуСоставНоменклатуры.Содержание КАК Содержание,
	//|	ПоручениеЭкспедиторуСоставНоменклатуры.Количество КАК Количество,
	//|	ПоручениеЭкспедиторуСоставНоменклатуры.Цена КАК Цена,
	//|	ПоручениеЭкспедиторуСоставНоменклатуры.Сумма КАК Сумма,
	//|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	//|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	//|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	//|	ПоручениеЭкспедитору.ОсобыеОтметки КАК ОсобыеОтметки,
	//|	ПоручениеЭкспедиторуСоставНоменклатуры.Валюта КАК Валюта,
	//|	ПоручениеЭкспедитору.НеПечататьСтоимостьУслугВПоручении КАК НеПечататьСтоимостьУслугВПоручении,
	//|	ПоручениеЭкспедиторуСоставНоменклатуры.СуммаНДС КАК СуммаНДС,
	//|	ПоручениеЭкспедиторуСоставНоменклатуры.СтавкаНДС КАК СтавкаНДС
	//|ИЗ
	//|	Документ.ПоручениеЭкспедитору.СоставНоменклатуры КАК ПоручениеЭкспедиторуСоставНоменклатуры
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	//|		ПО ПоручениеЭкспедиторуСоставНоменклатуры.Ссылка = ПоручениеЭкспедитору.Ссылка
	//|ГДЕ
	//|	ПоручениеЭкспедитору.Ссылка = &Док";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	|	ПоручениеЭкспедитору.Номер КАК Номер,
	|	ПоручениеЭкспедитору.Дата КАК Дата,
	|	ПоручениеЭкспедитору.Проведен КАК Проведен,
	|	ПоручениеЭкспедитору.Грузоотправитель КАК Грузоотправитель,
	|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	|	ПоручениеЭкспедитору.Грузополучатель КАК Грузополучатель,
	|	ПоручениеЭкспедитору.Договор КАК Договор,
	|	ПоручениеЭкспедитору.УведомитьСторонуОПрибытииГруза КАК УведомитьСторонуОПрибытииГруза,
	|	ПоручениеЭкспедитору.СтранаПроисхожденияГруза КАК СтранаПроисхожденияГруза,
	|	ПоручениеЭкспедитору.ТоварыГотовыеКОтправкеМестоИДата КАК ТоварыГотовыеКОтправкеМестоИДата,
	|	ПоручениеЭкспедитору.ВидТранспорта КАК ВидТранспорта,
	|	ПоручениеЭкспедитору.ПунктНазначения КАК ПунктНазначения,
	|	ПоручениеЭкспедитору.Страхование КАК Страхование,
	|	ПоручениеЭкспедитору.ТоварныйКод КАК ТоварныйКод,
	|	ПоручениеЭкспедитору.Маркировка КАК Маркировка,
	|	ПоручениеЭкспедитору.КоличествоМестВидУпаковки КАК КоличествоМестВидУпаковки,
	|	ПоручениеЭкспедитору.ВесБруттоНетто КАК ВесБруттоНетто,
	|	ПоручениеЭкспедитору.Объем КАК Объем,
	|	ПоручениеЭкспедитору.СтоимостьГруза КАК СтоимостьГруза,
	|	ПоручениеЭкспедитору.РазмерУпаковки КАК РазмерУпаковки,
	|	ПоручениеЭкспедитору.ТребуемыеДокументы КАК ТребуемыеДокументы,
	|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	|	ПоручениеЭкспедитору.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ПоручениеЭкспедитору.НеПечататьСтоимостьУслугВПоручении КАК НеПечататьСтоимостьУслугВПоручении
	|ИЗ
	|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	|ГДЕ
	|	ПоручениеЭкспедитору.Ссылка = &Док";
	
	Запрос.УстановитьПараметр("Док", Док);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.ПоручениеЭкспедитору");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		КонтИнформацияЭкспедитора = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Экспедитор,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,ТекущаяДата(),Истина);
		КонтИнформацияКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,ТекущаяДата(),Истина);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Страница");
		
		ОбластьМакета.Параметры.НомерДоговора = Выборка.НомерДоговора;
		ОбластьМакета.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=ДД");
		ОбластьМакета.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=ДД");
		ОбластьМакета.Параметры.НомерДокумента = Выборка.Номер;
		ОбластьМакета.Параметры.Грузоотправитель = Выборка.Грузоотправитель;
		ОбластьМакета.Параметры.Клиент = Строка(Выборка.Клиент) + " " + Строка(КонтИнформацияКлиента);
		ОбластьМакета.Параметры.Экспедитор = Строка(Выборка.Экспедитор) + " " + Строка(КонтИнформацияЭкспедитора);
		ОбластьМакета.Параметры.Грузополучатель = Выборка.Грузополучатель;
		ОбластьМакета.Параметры.УведомитьСторонуОПрибытииГруза = Выборка.УведомитьСторонуОПрибытииГруза;
		ОбластьМакета.Параметры.Страна = Выборка.СтранаПроисхожденияГруза;
		ОбластьМакета.Параметры.ТоварыГотовыеКОтправке = Выборка.ТоварыГотовыеКОтправкеМестоИДата;
		ОбластьМакета.Параметры.ВидТранспорта = Выборка.ВидТранспорта;
		ОбластьМакета.Параметры.ПунктНазначения = Выборка.ПунктНазначения;
		ОбластьМакета.Параметры.Страхование = Выборка.Страхование;
		ОбластьМакета.Параметры.ТоварныйКод = Выборка.ТоварныйКод;
		ОбластьМакета.Параметры.Маркировка = Выборка.Маркировка;
		ОбластьМакета.Параметры.КоличествоМестВидУпаковки = Выборка.КоличествоМестВидУпаковки;
		ОбластьМакета.Параметры.Вес = Выборка.ВесБруттоНетто;
		ОбластьМакета.Параметры.Объем = Выборка.Объем;
		ОбластьМакета.Параметры.СтоимостьГруза = Выборка.СтоимостьГруза;
		ОбластьМакета.Параметры.РазмерУпаковки = Выборка.РазмерУпаковки;
		ОбластьМакета.Параметры.ТребуемыеДокументы = Выборка.ТребуемыеДокументы;
		ОбластьМакета.Параметры.ОсобыеОтметки = Выборка.ОсобыеОтметки;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если НЕ Выборка.НеПечататьСтоимостьУслугВПоручении Тогда  
			
			Если Док.СоставНоменклатуры.Количество() > 0 Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ТабличныйДокумент.Вывести(ОбластьМакета);  
			
				Сч = 0;  
				
				Для каждого Стр Из Док.СоставНоменклатуры Цикл  
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
					Сч = Сч + 1;
					ОбластьМакета.Параметры.Сч = Сч;
					ОбластьМакета.Параметры.Содержание = Стр.Содержание;
					ОбластьМакета.Параметры.Количество = Стр.Количество;
					ОбластьМакета.Параметры.Цена = Строка(Стр.Цена) + " " + Строка(Стр.Валюта);
					ОбластьМакета.Параметры.Сумма = Строка(Стр.Сумма) + " " + Строка(Стр.Валюта);
					ОбластьМакета.Параметры.СтавкаНДС = Строка(Стр.СтавкаНДС);
					
					Если ЗначениеЗаполнено(Стр.СуммаНДС) Тогда
						ОбластьМакета.Параметры.СуммаНДС = Строка(Стр.СуммаНДС) + " " + Строка(Стр.Валюта);
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
	
КонецФункции  
