////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Поручение_Экспедитору";
	КомандаПечати.Представление = НСтр("ru = 'Поручение экспедитору'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 10;
	//УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ЭтоУниверсальныйДокумент", Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение_К_Договору_Транспортной_Экспедиции";
	КомандаПечати.Представление = НСтр("ru = 'Приложение к договору транспортной экспедиции'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 20;   
	
	//УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ЭтоУниверсальныйДокумент", Ложь);
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Поручение_Экспедитору") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Поручение_Экспедитору", "Поручение экспедитору", 
			ПечатьДокумента(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"Документ.ПоручениеЭкспедитору.Макет");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение_К_Договору_Транспортной_Экспедиции") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение_К_Договору_Транспортной_Экспедиции", "Приложение к договору транспортной экспедиции", 
			ПечатьПриложения(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"Документ.ПоручениеЭкспедитору.Приложение");
		КонецЕсли;
		
	ОбъектыПечати = Новый СписокЗначений;
	Сч = 1;	
	Для Каждого Элемент из МассивОбъектов Цикл
		
		ОбъектыПечати.Добавить(Элемент.Ссылка, "Документ_" + Строка(Сч));
		Сч = Сч + 1;
	КонецЦикла;
		
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода);
	
КонецПроцедуры

Функция ПечатьДокумента(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Поручение_Экспедитору";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	|	ПоручениеЭкспедитору.Номер КАК Номер,
	|	ПоручениеЭкспедитору.Дата КАК Дата,
	|	ПоручениеЭкспедитору.Проведен КАК Проведен,
	|	ПоручениеЭкспедитору.Грузоотправитель КАК Грузоотправитель,
	|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	|	ПоручениеЭкспедитору.Грузополучатель КАК Грузополучатель,
	|	ПоручениеЭкспедитору.Договор КАК Договор,
	|	ПоручениеЭкспедитору.УведомитьСторонуОПрибытииГруза КАК УведомитьСторонуОПрибытииГруза,
	|	ПоручениеЭкспедитору.СтранаПроисхожденияГруза КАК СтранаПроисхожденияГруза,
	|	ПоручениеЭкспедитору.ТоварыГотовыеКОтправкеМестоИДата КАК ТоварыГотовыеКОтправкеМестоИДата,
	|	ПоручениеЭкспедитору.ВидТранспорта КАК ВидТранспорта,
	|	ПоручениеЭкспедитору.ПунктНазначения КАК ПунктНазначения,
	|	ПоручениеЭкспедитору.Страхование КАК Страхование,
	|	ПоручениеЭкспедитору.ТоварныйКод КАК ТоварныйКод,
	|	ПоручениеЭкспедитору.Маркировка КАК Маркировка,
	|	ПоручениеЭкспедитору.КоличествоМестВидУпаковки КАК КоличествоМестВидУпаковки,
	|	ПоручениеЭкспедитору.ВесБруттоНетто КАК ВесБруттоНетто,
	|	ПоручениеЭкспедитору.Объем КАК Объем,
	|	ПоручениеЭкспедитору.СтоимостьГруза КАК СтоимостьГруза,
	|	ПоручениеЭкспедитору.РазмерУпаковки КАК РазмерУпаковки,
	|	ПоручениеЭкспедитору.ТребуемыеДокументы КАК ТребуемыеДокументы,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Содержание КАК Содержание,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Количество КАК Количество,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Цена КАК Цена,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Сумма КАК Сумма,
	|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	|	ПоручениеЭкспедитору.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Валюта КАК Валюта,
	|	ПоручениеЭкспедитору.НеПечататьСтоимостьУслугВПоручении КАК НеПечататьСтоимостьУслугВПоручении,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.СуммаНДС КАК СуммаНДС,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.ПоручениеЭкспедитору.СоставНоменклатуры КАК ПоручениеЭкспедиторуСоставНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	|		ПО ПоручениеЭкспедиторуСоставНоменклатуры.Ссылка = ПоручениеЭкспедитору.Ссылка
	|ГДЕ
	|	ПоручениеЭкспедитору.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
	
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.Макет");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		КонтИнформацияЭкспедитора = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Экспедитор,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,ТекущаяДата(),Истина);
		КонтИнформацияКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,ТекущаяДата(),Истина);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Страница");
		
		ОбластьМакета.Параметры.НомерДоговора = Выборка.НомерДоговора;
		ОбластьМакета.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=ДД");
		ОбластьМакета.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=ДД");
		ОбластьМакета.Параметры.НомерДокумента = Выборка.Номер;
		ОбластьМакета.Параметры.Грузоотправитель = Выборка.Грузоотправитель;
		ОбластьМакета.Параметры.Клиент = Строка(Выборка.Клиент) + " " + Строка(КонтИнформацияКлиента);
		ОбластьМакета.Параметры.Экспедитор = Строка(Выборка.Экспедитор) + " " + Строка(КонтИнформацияЭкспедитора);
		ОбластьМакета.Параметры.Грузополучатель = Выборка.Грузополучатель;
		ОбластьМакета.Параметры.УведомитьСторонуОПрибытииГруза = Выборка.УведомитьСторонуОПрибытииГруза;
		ОбластьМакета.Параметры.Страна = Выборка.СтранаПроисхожденияГруза;
		ОбластьМакета.Параметры.ТоварыГотовыеКОтправке = Выборка.ТоварыГотовыеКОтправкеМестоИДата;
		ОбластьМакета.Параметры.ВидТранспорта = Выборка.ВидТранспорта;
		ОбластьМакета.Параметры.ПунктНазначения = Выборка.ПунктНазначения;
		ОбластьМакета.Параметры.Страхование = Выборка.Страхование;
		ОбластьМакета.Параметры.ТоварныйКод = Выборка.ТоварныйКод;
		ОбластьМакета.Параметры.Маркировка = Выборка.Маркировка;
		ОбластьМакета.Параметры.КоличествоМестВидУпаковки = Выборка.КоличествоМестВидУпаковки;
		ОбластьМакета.Параметры.Вес = Выборка.ВесБруттоНетто;
		ОбластьМакета.Параметры.Объем = Выборка.Объем;
		ОбластьМакета.Параметры.СтоимостьГруза = Выборка.СтоимостьГруза;
		ОбластьМакета.Параметры.РазмерУпаковки = Выборка.РазмерУпаковки;
		ОбластьМакета.Параметры.ТребуемыеДокументы = Выборка.ТребуемыеДокументы;
		ОбластьМакета.Параметры.ОсобыеОтметки = Выборка.ОсобыеОтметки;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если НЕ Выборка.НеПечататьСтоимостьУслугВПоручении Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Сч = 0;
			Пока Выборка.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
				Сч = Сч + 1;
				ОбластьМакета.Параметры.Сч = Сч;
				ОбластьМакета.Параметры.Содержание = Выборка.Содержание;
				ОбластьМакета.Параметры.Количество = Выборка.Количество;
				ОбластьМакета.Параметры.Цена = Строка(Выборка.Цена) + " " + Строка(Выборка.Валюта);
				ОбластьМакета.Параметры.Сумма = Строка(Выборка.Сумма) + " " + Строка(Выборка.Валюта);
				ОбластьМакета.Параметры.СтавкаНДС = Строка(Выборка.СтавкаНДС);
				Если ЗначениеЗаполнено(Выборка.СуммаНДС) Тогда
					ОбластьМакета.Параметры.СуммаНДС = Строка(Выборка.СуммаНДС) + " " + Строка(Выборка.Валюта);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
			
			КонецЦикла;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		//ОбластьМакета.Параметры.ФИО = Выборка.ФИОКлиента;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
			
	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьПриложения(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Поручение_Экспедитору_Приложение";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	|	ПоручениеЭкспедитору.Номер КАК Номер,
	|	ПоручениеЭкспедитору.Дата КАК Дата,
	|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	|	ПоручениеЭкспедитору.Договор КАК Договор,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Содержание КАК Содержание,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Количество КАК Количество,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Цена КАК Цена,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Сумма КАК Сумма,
	|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Валюта КАК Валюта,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Должность КАК ДолжностьРуководителя,
	|	ПоручениеЭкспедитору.НомерПриложения КАК НомерПриложения,
	|	ПоручениеЭкспедитору.ДатаПриложения КАК ДатаПриложения,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.СуммаНДС КАК СуммаНДС,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.Дополнительно КАК Дополнительно,
	|	ПоручениеЭкспедиторуСоставНоменклатуры.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.ПоручениеЭкспедитору.СоставНоменклатуры КАК ПоручениеЭкспедиторуСоставНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	|		ПО ПоручениеЭкспедиторуСоставНоменклатуры.Ссылка = ПоручениеЭкспедитору.Ссылка
	|ГДЕ
	|	ПоручениеЭкспедитору.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	МассивРезультатов = Запрос.Выполнить();
	
	Выборка = МассивРезультатов.Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.Приложение");
	
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		ОбластьМакета.Параметры.НомерПриложения = Выборка.НомерПриложения;
		ОбластьМакета.Параметры.НомерДоговора = Выборка.НомерДоговора;
		ОбластьМакета.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=ДД");
		ОбластьМакета.Параметры.ДатаДокумента = Формат(Выборка.ДатаПриложения, "ДЛФ=ДД");
		ОбластьМакета.Параметры.Клиент = Выборка.Клиент;
		ОбластьМакета.Параметры.ФИОРуководителя = СклонениеПредставленийОбъектов.ПросклонятьФИО(Выборка.ФИОКлиента, 2);
		ОбластьМакета.Параметры.ДолжностьРуководителя = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьРуководителя, 2); //Выборка.Клиент;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Пункт1");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Пока Выборка.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
			СтрокаПункта = "- " + Строка(Выборка.Содержание) + " - " + Строка(Выборка.Сумма) + " " + Строка(Выборка.Валюта);
			Если Выборка.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
				СтрокаПункта = СтрокаПункта + ", в т.ч. НДС " + Строка(Выборка.СтавкаНДС) + " " + Строка(Выборка.СуммаНДС) + " " + Строка(Выборка.Валюта);
			Иначе
				СтрокаПункта = СтрокаПункта + ", " + Строка(Выборка.СтавкаНДС);
				
				
			КонецЕсли;
			//Если ЗначениеЗаполнено(Выборка.СуммаНДС) Тогда
			//	СтрокаПункта = СтрокаПункта + ", в т.ч. НДС " + Строка(Выборка.СтавкаНДС) + " " + Строка(Выборка.СуммаНДС) + " " + Строка(Выборка.Валюта);
			//Иначе
			//	Если Выборка.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			//		СтрокаПункта = СтрокаПункта + " " + Строка(Выборка.СтавкаНДС);
			//	Иначе
			//		СтрокаПункта = СтрокаПункта + ", в т.ч. НДС " + Строка(Выборка.СтавкаНДС);
			//	КонецЕсли;
			//КонецЕсли;
			
			//ОбластьМакета.Параметры.ПунктИзм = "- " + Строка(Выборка.Содержание) + " - " + Строка(Выборка.Сумма) + " " + Строка(Выборка.Валюта)
			//	+ " в т.ч. " + Строка(Выборка.СуммаНДС) + " " + Строка(Выборка.Валюта) + Символы.ПС;
			
			Если ЗначениеЗаполнено(Выборка.Дополнительно) Тогда
				СтрокаПункта = СтрокаПункта + " - " + Строка(Выборка.Дополнительно) + Символы.ПС;
			Иначе
				СтрокаПункта = СтрокаПункта + Символы.ПС;
			КонецЕсли;
			ОбластьМакета.Параметры.ПунктИзм = СтрокаПункта;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		Если Выборка.Ссылка.ИзменяемоеСодержимоеПриложения.Количество() > 0 Тогда
			
			Для Сч = 1 по 6 Цикл
				
				Отбор = Новый Структура();
				Отбор.Вставить("Пункт", Сч);
				НайденноеЗначение = Выборка.Ссылка.ИзменяемоеСодержимоеПриложения.НайтиСтроки(Отбор);
				
				Если НайденноеЗначение.Количество() > 0 Тогда
					Если Сч = 2 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "2. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 3 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "3. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 4 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "4. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 5 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "5. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 6 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "6. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
				Иначе
					Если Сч = 2 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Пункт2");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 3 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Пункт3");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 4 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Пункт4");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 5 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Пункт5");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 6 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Пункт6");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					
				КонецЕсли;
										
			КонецЦикла;
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("Пункт2");
			ТабличныйДокумент.Вывести(ОбластьМакета);
				
			ОбластьМакета = Макет.ПолучитьОбласть("Пункт3");
			ТабличныйДокумент.Вывести(ОбластьМакета);
				
			ОбластьМакета = Макет.ПолучитьОбласть("Пункт4");
			ТабличныйДокумент.Вывести(ОбластьМакета);
				
			ОбластьМакета = Макет.ПолучитьОбласть("Пункт5");
			ТабличныйДокумент.Вывести(ОбластьМакета);
				
			ОбластьМакета = Макет.ПолучитьОбласть("Пункт6");
			ТабличныйДокумент.Вывести(ОбластьМакета);					
				
		КонецЕсли;
				
		ОбластьМакета = Макет.ПолучитьОбласть("Пункт7");
		ОбластьМакета.Параметры.НомерДоговора = Выборка.НомерДоговора;
		ОбластьМакета.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=ДД");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
			
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Задает область печати объекта в табличном документе. Необходимо использовать при выводе нескольких печатных форм
// в одном табличном документе для возможности печати комплектов документов, а также для возможности сохранения
// печатных форм в отдельных файлах.
// Необходимо вызывать после формирования каждой печатной формы в табличном документе.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - печатная форма;
//  НомерСтрокиНачало - Число - позиция начала очередной области в документе;
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  Ссылка - ЛюбаяСсылка - объект печати.
//
// Пример:
//  Пока ВыборкаПоДокументам.Следующий() Цикл
//    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//    // ... вывод печатной формы в табличный документ ...
//    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
//  КонецЦикла;
//
Процедура ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка)
	
	Элемент = ОбъектыПечати.НайтиПоЗначению(Ссылка);
	Если Элемент = Неопределено Тогда
		ИмяОбласти = "Документ_" + Формат(ОбъектыПечати.Количество() + 1, "ЧН=; ЧГ=");
		ОбъектыПечати.Добавить(Ссылка, ИмяОбласти);
	Иначе
		ИмяОбласти = Элемент.Представление;
	КонецЕсли;
	
	НомерСтрокиОкончание = ТабличныйДокумент.ВысотаТаблицы;
	ТабличныйДокумент.Область(НомерСтрокиНачало, , НомерСтрокиОкончание, ).Имя = ИмяОбласти;
	
КонецПроцедуры

//функция ПолучитьНастройку(КлючНастроек) Экспорт
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	СтруктураНастроек = Новый Структура;
//	
//	СтруктураОтбора = Новый Структура("КлючОбъекта,КлючНастроек",
//	"ПоручениеЭкспедитору",КлючНастроек);
//	
//	Выборка = ХранилищеОбщихНастроек.Выбрать(СтруктураОтбора);
//	
//	Если Выборка.Следующий() Тогда
//		
//		Возврат Выборка.Настройки;
//		
//	Иначе
//		
//		Возврат Ложь;
//		
//	КонецЕсли;	
//	
//Конецфункции