&НаКлиенте
Процедура ВидПриИзменении(Элемент)  
	
	ОбновитьОтображениеЭлементовПоВидуСделки();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	//Попытка
	//	ЗаблокироватьДанныеФормыДляРедактирования();
	//	
	//	ЭтотОбъект.ДатаВремяОткрытияФормы = ТекущаяДата();
	//	
	//Исключение
	//	ЭтаФорма.ТолькоПросмотр = Истина;
	//	ЭтаФорма.Элементы.КонтейнерыУстановитьДатыДляВсехСтрокПоКолонкеКонтейнеры.Доступность = Ложь;
	//	ЭтаФорма.Элементы.РасходыКлиентаВыставитьСчетРасходыКлиента.Доступность = Ложь;
	//	ЭтаФорма.Элементы.РасходыКлиентаВыставитьОтчетКомитенту.Доступность = Ложь;
	//	ЭтаФорма.Элементы.РасходыКлиентаКонвертироватьСуммуUSDПоТекущемуКурсуРасходыКлиента.Доступность = Ложь;
	//	ЭтаФорма.Элементы.РасходыКлиентаАннулироватьРасходКлиента.Доступность = Ложь;
	//	ЭтаФорма.Элементы.РасходыКлиентаКонтейнеры.Доступность = Ложь;
	//	Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + ". Вам запрещено редактирование документа");
	//КонецПопытки;
	
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();  
		Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		ЭтотОбъект.Статус = Перечисления.СтатусыСделок.Новая;
		
		Объект.Квартал = НачалоКвартала(ТекущаяДата()); 
		Объект.ПодстатусСрочностьСборДокументов = Перечисления.СтатусыСрочностиСборДокументов.Нет;
		
		СтрСтатус = Объект.Статусы.Добавить(); 
		СтрСтатус.Статус = Перечисления.СтатусыСделок.Новая;
		СтрСтатус.Дата = ТекущаяДата();
		СтрСтатус.Пользователь = ПользователиКлиентСервер.ТекущийПользователь(); 
		
		Если Параметры.Свойство("Вид") Тогда
			
			Если Параметры.Вид = "Экспорт" Тогда
				
				Объект.Вид = Перечисления.ВидыСделок.Экспорт;
				Объект.ТипДокументов = Перечисления.ТипыДокументовСборДокументов.Экспорт;
				
			Иначе
				
				Объект.Вид = Перечисления.ВидыСделок[Параметры.Вид];
				Объект.ТипДокументов = Перечисления.ТипыДокументовСборДокументов.Импорт;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Параметры.Свойство("КопированиеСделки") Тогда
			
			Если Параметры.КопированиеСделки Тогда
				
				Если Параметры.Клиент Тогда    
					
					Объект.Контрагент = Параметры.СсылкаНаСделку.Контрагент;
					
				КонецЕсли;
				
				Если Параметры.ПортОтгрузки Тогда    
					
					Объект.ПортОтгрузки = Параметры.СсылкаНаСделку.ПортОтгрузки; 
					
				КонецЕсли; 
				
				Если Параметры.ПортПрибытия Тогда    
					
					Объект.ПортПрибытия = Параметры.СсылкаНаСделку.ПортПрибытия;
					
				КонецЕсли; 
				
				Если Параметры.АгентЛинии Тогда    
					
					Объект.Агент = Параметры.СсылкаНаСделку.Агент;
					
				КонецЕсли;
				
				Если Параметры.ВидТранспорта Тогда    
					
					Объект.ВидТранспорта = Параметры.СсылкаНаСделку.ВидТранспорта;
					
				КонецЕсли;
				
				Если Параметры.Груз Тогда    
					
					Объект.Груз = Параметры.СсылкаНаСделку.Груз;
					
				КонецЕсли;
				
				Если Параметры.Грузополучатель Тогда    
					
					Объект.Грузополучатель = Параметры.СсылкаНаСделку.Грузополучатель;
					
				КонецЕсли;
				
				Если Параметры.Демередж Тогда    
					
					Объект.Демередж = Параметры.СсылкаНаСделку.Демередж;
					
				КонецЕсли; 
				
				Если Параметры.КоличествоГрузовыхМест Тогда    
					
					Объект.КоличествоГрузовыхМест = Параметры.СсылкаНаСделку.КоличествоГрузовыхМест;
					
				КонецЕсли; 
				
				Если Параметры.Линия Тогда    
					
					Объект.Линия = Параметры.СсылкаНаСделку.Линия;
					
				КонецЕсли;
				
				Если Параметры.ПрипортовойТерминал Тогда    
					
					Объект.ПрипортовойТерминал = Параметры.СсылкаНаСделку.ПрипортовойТерминал;
					
				КонецЕсли;
				
				Если Параметры.РежимВывоза Тогда    
					
					Объект.РежимВывоза = Параметры.СсылкаНаСделку.РежимВывоза;
					
				КонецЕсли;
				
				Если Параметры.Судно Тогда    
					
					Объект.Судно = Параметры.СсылкаНаСделку.Судно;
					
				КонецЕсли;
				
				Если Параметры.ТерминальнаяОбработка Тогда    
					
					Объект.ТерминальнаяОбработка = Параметры.СсылкаНаСделку.ТерминальнаяОбработка;
					
				КонецЕсли;
				
				Если Параметры.УсловиеПоставки Тогда    
					
					Объект.УсловиеПоставки = Параметры.СсылкаНаСделку.УсловиеПоставки;
					
				КонецЕсли;
				
				Если Параметры.Фрахт Тогда    
					
					Объект.Фрахт = Параметры.СсылкаНаСделку.Фрахт;
					
				КонецЕсли;
				
				ДобавлятьНовыеСтроки = Ложь;
				
				Если Параметры.ТипКонтейнера ИЛИ Параметры.РазмерКонтейнера ИЛИ Параметры.ПеревозчикиКонтейнеров ИЛИ Параметры.НаправлениеКонтейнеров Тогда
					
					ДобавлятьНовыеСтроки = Истина;
					
				КонецЕсли;  
				
				Если ДобавлятьНовыеСтроки Тогда
					
					Для Каждого Стр Из Параметры.СсылкаНаСделку.Контейнеры Цикл
						
						СтрТЧ = Объект.Контейнеры.Добавить();
						
						Если Параметры.ТипКонтейнера Тогда   	
							
							СтрТЧ.Тип = Стр.Тип; 
							
						КонецЕсли;
						
						Если Параметры.РазмерКонтейнера Тогда
							
							СтрТЧ.Размер = Стр.Размер;
							
						КонецЕсли;
						
						КопированиеСтрокИнформацииОПеревозчике = Ложь;
						
						Если Параметры.ПеревозчикиКонтейнеров Тогда
							
							СтрТЧ.КлючСвязиИнформацияОПеревозчике = Стр.КлючСвязиИнформацияОПеревозчике;
							
							КопированиеСтрокИнформацииОПеревозчике = Истина;
							
						КонецЕсли;
						
						Если Параметры.НаправлениеКонтейнеров Тогда
							
							СтрТЧ.КлючСвязиИнформацияОПеревозчике = Стр.КлючСвязиИнформацияОПеревозчике; 
							
							КопированиеСтрокИнформацииОПеревозчике = Истина;
							
						КонецЕсли; 
						
						Если КопированиеСтрокИнформацииОПеревозчике Тогда
							
							ПараметрыОтбора = Новый Структура("КлючСвязи", Стр.КлючСвязиИнформацияОПеревозчике);
							
							НайденныеСтроки = Параметры.СсылкаНаСделку.ИнформацияОПеревозчиках.НайтиСтроки(ПараметрыОтбора); 
							
							Если НайденныеСтроки.Количество() > 0 Тогда
								
								Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
									
									СтрИнформацияОПеревозчиках = Объект.ИнформацияОПеревозчиках.Добавить();
									
									СтрИнформацияОПеревозчиках.КлючСвязи = СтрНайденнаяСтрока.КлючСвязи; 
									
									Если Параметры.ПеревозчикиКонтейнеров Тогда
										
										СтрИнформацияОПеревозчиках.Перевозчик = СтрНайденнаяСтрока.Перевозчик;
										
									КонецЕсли;
									
									Если Параметры.НаправлениеКонтейнеров Тогда
										
										СтрИнформацияОПеревозчиках.Направление = СтрНайденнаяСтрока.Направление; 
										
									КонецЕсли;
									
								КонецЦикла;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Объект.Вид = Параметры.СсылкаНаСделку.Вид;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;  
	
	Если ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") ИЛИ ЛогистикаСервер.ЕстьРоль("ЛогистикаБухгалтер") Тогда
		
		Элементы.РасходыКлиентаВыставитьОтчетКомитенту.Видимость = Истина;
		Элементы.РасходыКлиентаВыставитьСчетРасходыКлиента.Видимость = Истина;
		
	КонецЕсли;
	
	ОбновитьОтображениеЭлементовПоВидуСделки(); 
	
	ЗаполнитьВизуальноеОтображениеИнформацияОПеревозчиках(); 
	
	РассчитатьВходящиеРасходыПоСделке();  
	
	РасчитатьВходящиеСчетаПоСделке();
	
	ЗаполнитьНеобходимыеДокументы();
	
	ЗаполнитьСтатусыСделки();
	
	ЗаполнитьИсториюСтатусов();
	
	НомерСтатуса = ЛогистикаСервер.ПолучитьНомерСтатуса(ЭтотОбъект.Статус, Объект.Вид);
	
	Если НомерСтатуса > 2 И НомерСтатуса < 8 Тогда
		
		//Элементы.НетСтавки.Видимость = Истина;
		
	Иначе
		
		//Элементы.НетСтавки.Видимость = Ложь;
		
	КонецЕсли;
	
	ДоверенностьБулево = Объект.ЕстьДоверенность = Перечисления.СтатусыДоверенностей.Есть; 
	
	ОбработатьДоступностьЭлементаДатаЗакрытия();
	
	//Элементы.Статусы.ОтборСтрок = Новый ФиксированнаяСтруктура("СтатусыСтатус", Объект.Проживает);
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИсториюСтатусов()

	Для Каждого Стр ИЗ Объект.Статусы Цикл
		
		Если ТипЗнч(Стр.Статус) = Тип("ПеречислениеСсылка.СтатусыСделок") Тогда
			
			ЗаполнитьЗначенияСвойств(ИсторияСтатусовПросмортр.Добавить(),Стр);	
			
		КонецЕсли;
				
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура РасчитатьВходящиеСчетаПоСделке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПоставщикаТовары.Содержание КАК Содержание,
	|	ВЫБОР
	|		КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|				И НЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов ЕСТЬ NULL
	|			ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения * СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	//|						И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	//|					ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения * СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов
	|				ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения
	//|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения КАК СуммаРаспределения,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Документ,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.ВалютаДокумента КАК Валюта,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения КАК СуммаВВалюте
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	|		ПО СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения
	|			И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка
	|ГДЕ
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
	|	И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Сделка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Рубли = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Пока Выборка.Следующий() Цикл
		
		СтрТЧ = ЭтотОбъект.ВходящиеСчета.Добавить();
		СтрТЧ.ПоступлениеУслуг = Выборка.Документ;
		СтрТЧ.Сумма = Выборка.Сумма;
		СтрТЧ.СодержаниеУслуги = Выборка.Содержание;
		
		Если Выборка.Валюта <> Рубли Тогда            
			
			СтрТЧ.Валюта = Выборка.Валюта;
			
			СтрТЧ.СуммаВВалюте = Выборка.СуммаВВалюте;			
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ИтогоВходящиеСчетаСумма = ВходящиеСчета.Итог("Сумма");
	ИтогоВходящиеСчетаСуммаВВалюте = ВходящиеСчета.Итог("СуммаВВалюте");
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСтатусыСделки()
	
	НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Сделка.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Статус = НЗ[0].Статус;
		ПодстатусБухгалтерия = НЗ[0].ПодстатусБухгалтерия;
		ПодстатусФинОтдел = НЗ[0].ПодстатусФинОтдел;
		ПодстатусОплатаВЛинию = НЗ[0].ПодстатусОплатаВЛинию;
		
	КонецЕсли;
	
КонецПроцедуры                  

&НаСервере
Процедура ЗаполнитьНеобходимыеДокументы()
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Стр = Объект.СборДокументов.Добавить();
		Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеЭкспедитораСПодписью;
		Стр.Необходим = Истина;
		
		Стр = Объект.СборДокументов.Добавить();
		Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ЭкспедиторскаяРасписка;
		Стр.Необходим = Истина;
		
		Стр = Объект.СборДокументов.Добавить();
		Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПриложениеСПодписьюСДвухСторон;
		Стр.Необходим = Истина;
		
		Стр = Объект.СборДокументов.Добавить();
		Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеРавноПриложение;
		Стр.Необходим = Истина;
		
		Стр = Объект.СборДокументов.Добавить();
		Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.КоносаментСПечатью;
		Стр.Необходим = Истина;
		
		Стр = Объект.СборДокументов.Добавить();
		Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ДТ;
		Стр.Необходим = Истина;
		
		Если Объект.Вид = Перечисления.ВидыСделок.Экспорт Тогда
			
			Стр = Объект.СборДокументов.Добавить();
			Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПогрузПоручениеЭкспорт;
			Стр.Необходим = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Если Объект.ТипДокументов <> Перечисления.ТипыДокументовСборДокументов.Неизвестно Тогда
			
			Если Объект.СборДокументов.Количество() = 0 Тогда
				
				Стр = Объект.СборДокументов.Добавить();
				Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеЭкспедитораСПодписью;
				Стр.Необходим = Истина;
				
				Стр = Объект.СборДокументов.Добавить();
				Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ЭкспедиторскаяРасписка;
				Стр.Необходим = Истина;
				
				Стр = Объект.СборДокументов.Добавить();
				Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПриложениеСПодписьюСДвухСторон;
				Стр.Необходим = Истина;
				
				Стр = Объект.СборДокументов.Добавить();
				Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеРавноПриложение;
				Стр.Необходим = Истина;
				
				Если Объект.ТипДокументов <> Перечисления.ТипыДокументовСборДокументов.Экспедирование Тогда
					
					Стр = Объект.СборДокументов.Добавить();
					Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.КоносаментСПечатью;
					Стр.Необходим = Истина;
					
				КонецЕсли;
				
				Стр = Объект.СборДокументов.Добавить();
				Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ДТ;
				Стр.Необходим = Истина;
				
				Если Объект.Вид = Перечисления.ВидыСделок.Экспорт Тогда
					
					Стр = Объект.СборДокументов.Добавить();
					Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПогрузПоручениеЭкспорт;
					Стр.Необходим = Истина;
					
				КонецЕсли; 
				
			Иначе
				
				ЕстьЭкспедиторскаяРасписка = Ложь;
				ЕстьПриложениеСПодписьюСДвухСторон = Ложь;
				ЕстьПоручениеЭкспедитораСПодписью = Ложь;
				ЕстьПоручениеРавноПриложение = Ложь;
				
				Для Каждого Стр Из Объект.СборДокументов Цикл
					
					Запрос = Новый Запрос;
					
					Запрос.Текст = "ВЫБРАТЬ
					|	ВЫБОР
					|		КОГДА СделкаПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
					|			ТОГДА ЛОЖЬ
					|		ИНАЧЕ ИСТИНА
					|	КОНЕЦ КАК ЕстьФайл
					|ИЗ
					|	Справочник.СделкаПрисоединенныеФайлы КАК СделкаПрисоединенныеФайлы
					|ГДЕ
					|	СделкаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
					|	И СделкаПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
					|	И СделкаПрисоединенныеФайлы.ВидФайла = &ВидФайла";
					
					Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка); 
					Запрос.УстановитьПараметр("ВидФайла", Стр.ВидДокумента);
					
					Выборка = Запрос.Выполнить().Выбрать();
					
					Пока Выборка.Следующий() Цикл 
						
						Если Выборка.ЕстьФайл Тогда
							
							Стр.Добавлен = Истина;
							
							Если Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ЭкспедиторскаяРасписка Тогда
								
								ЕстьЭкспедиторскаяРасписка = Истина;
								
							ИначеЕсли Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПриложениеСПодписьюСДвухСторон Тогда
								
								ЕстьПриложениеСПодписьюСДвухСторон = Истина;	
								
							ИначеЕсли Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеЭкспедитораСПодписью Тогда
								
								ЕстьПоручениеЭкспедитораСПодписью = Истина;
								
							ИначеЕсли Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеРавноПриложение Тогда
								
								ЕстьПоручениеРавноПриложение = Истина;	
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
				Для Каждого Стр Из Объект.СборДокументов Цикл
					
					Если (Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ЭкспедиторскаяРасписка ИЛИ Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПриложениеСПодписьюСДвухСторон
						ИЛИ Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеЭкспедитораСПодписью) И ЕстьПоручениеРавноПриложение Тогда
						
						Стр.Необходим = Ложь;
						
					ИначеЕсли Стр.ВидДокумента = Справочники.ВидыПрисоединенныхФайловСделки.ПоручениеРавноПриложение И (ЕстьЭкспедиторскаяРасписка
						ИЛИ ЕстьПриложениеСПодписьюСДвухСторон ИЛИ ЕстьПоручениеЭкспедитораСПодписью) Тогда  
						
						Стр.Необходим = Ложь;
						
						
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьВходящиеРасходыПоСделке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПоступлениеТоваровУслугУслуги.Содержание КАК Содержание,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|				И НЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов ЕСТЬ NULL
	|			ТОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ ВЫБОР
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	//|						И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	//|					ТОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов
	|				ИНАЧЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения
	//|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Документ,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.ВалютаДокумента КАК Валюта,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения КАК СуммаВВалюте
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	|			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.Ссылка = &Сделка
	|	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Наименование,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|				И НЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов ЕСТЬ NULL
	|			ТОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	//|						И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	//|					ТОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов
	|				ИНАЧЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения
	//|			КОНЕЦ
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.ВалютаДокумента,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	|			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
	|	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура.Наименование,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|				И НЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|			ТОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	//|						И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	//|					ТОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов
	|				ИНАЧЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения
	//|			КОНЕЦ
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка.ВалютаДокумента,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	|		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	|			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка = &Сделка
	|	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Сделка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Рубли = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Пока Выборка.Следующий() Цикл
		
		СтрТЧ = ЭтотОбъект.ВходящиеРасходы.Добавить();
		СтрТЧ.ПоступлениеУслуг = Выборка.Документ;
		СтрТЧ.Сумма = Выборка.Сумма;
		СтрТЧ.СодержаниеУслуги = Выборка.Содержание;
		
		Если Выборка.Валюта <> Рубли Тогда            
			
			СтрТЧ.Валюта = Выборка.Валюта;
			
			СтрТЧ.СуммаВВалюте = Выборка.СуммаВВалюте;			
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ИтогоВходящиеРасходыСумма = ВходящиеРасходы.Итог("Сумма");
	ИтогоВходящиеРасходыСуммаВВалюте = ВходящиеРасходы.Итог("СуммаВВалюте");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВизуальноеОтображениеИнформацияОПеревозчиках()
	
	Для Каждого Стр Из Объект.Контейнеры Цикл
		
		ПараметрыОтбора = Новый Структура("КлючСвязи", Стр.КлючСвязиИнформацияОПеревозчике);
		
		НайденныеСтроки = Объект.ИнформацияОПеревозчиках.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ТекстовоеПредставление = "";
			
			Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
				
				Если ТекстовоеПредставление = "" Тогда
					
					ТекстовоеПредставление = Строка(СтрНайденнаяСтрока.Перевозчик) + " - " + Формат(СтрНайденнаяСтрока.СтавкаКлиенту,"ЧДЦ=2; ЧГ=") + " - " + Строка(СтрНайденнаяСтрока.Направление) + " - " + Формат(СтрНайденнаяСтрока.СтавкаАвтоперевозки,"ЧДЦ=2; ЧГ=");	
					
				Иначе
					
					ТекстовоеПредставление = ТекстовоеПредставление + Символы.ПС + Строка(СтрНайденнаяСтрока.Перевозчик) + " - " + Формат(СтрНайденнаяСтрока.СтавкаКлиенту,"ЧДЦ=2; ЧГ=") + " - " + Строка(СтрНайденнаяСтрока.Направление) + " - " + Формат(СтрНайденнаяСтрока.СтавкаАвтоперевозки,"ЧДЦ=2; ЧГ=");
					
				КонецЕсли;
				
			КонецЦикла;
			
			Стр.ИнформацияОПеревозчике = ТекстовоеПредставление;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Для Каждого Стр ИЗ Объект.Контейнеры Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.ИнформацияОПеревозчике) Тогда
			
			Стр.ИнформацияОПеревозчике = "не указан";
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеЭлементовПоВидуСделки()
	
	СделкаЭкспорт 			= Ложь;
	СделкаДекларирование 	= Ложь;
	СделкаАвтоперевозка 	= Ложь;       
	СделкаИмпорт 			= Ложь;
	СделкаСертификация      = Ложь;
	
	Элементы.Статус.СписокВыбора.Очистить();
	
	Если Объект.Вид = Перечисления.ВидыСделок.Экспорт Тогда
		
		СделкаЭкспорт = Истина;
		
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Новая, "Новая", Истина);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ВРаботе, "В работе");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ВПорту, "В порту");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ВыходИзПорта, "Выход из порта");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.SWBОформлен, "SWB оформлен");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ДокументыПодготовлены, "Документы подготовлены");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.КонтрольПередЗакрытием, "Контроль перед закрытием");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Закрыта, "Закрыта");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Отменена, "Отменена");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Задержана, "Задержана");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ПретензияСуд, "Претензия/суд");
		
		ЭтотОбъект.Статус = Перечисления.СтатусыСделок.Новая;
		
	ИначеЕсли Объект.Вид = Перечисления.ВидыСделок.Сертификация Тогда
		
		СделкаСертификация      = Истина;   
		
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ЗаявкаПолучена, "Заявка получена");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ДокументыПолучены, "Документы получены");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.МакетОтправлен, "Макет отправлен");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.СертификатВыпущен, "Сертификат выпущен");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.КонтрольПередЗакрытием, "Контроль перед закрытием");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Отменена, "Отменена");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Закрыта, "Закрыта");
		
		ЭтотОбъект.Статус = Перечисления.СтатусыСделок.ЗаявкаПолучена;
		
	ИначеЕсли Объект.Вид = Перечисления.ВидыСделок.Автоперевозка Тогда 
		
		СделкаАвтоперевозка = Истина;
		
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ЗаявкаОтправлена, "Заявка отправлена", Истина);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ЗаявкаПодписана, "Заявка подписана");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ПрибылНаПогрузку, "Прибыл на погрузку");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ПогруженВыехалНаВыгрузку, "Погружен выехал на выгрузку");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.НаВыгрузке, "На выгрузке");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Выгружен, "Выгружен");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ДокументыОтправлены, "Документы отправлены");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.КонтрольПередЗакрытием, "Контроль перед закрытием");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Завершена, "Завершена");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Отменена, "Отменена");
		
		ЭтотОбъект.Статус = Перечисления.СтатусыСделок.ЗаявкаОтправлена;
		
	ИначеЕсли Объект.Вид = Перечисления.ВидыСделок.Импорт Тогда 
		
		СделкаИмпорт = Истина;
		
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Новая, "Новая", Истина);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ВРаботе, "В работе");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.НаПодходе, "На подходе");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Выгружен, "Выгружен"); 
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ГотовКВывозу, "Готов к вывозу");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Вывезен, "Вывезен");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Доставлен, "Доставлен");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.СданПорожний, "Сдан порожний");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ВыставленыВсеРасходы, "Выставлены все расходы");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ДокументыПодготовлены, "Документы подготовлены");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.КонтрольПередЗакрытием, "Контроль перед закрытием");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Закрыта, "Закрыта");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Отменена, "Отменена");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Задержана, "Задержана");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ПретензияСуд, "Претензия/суд");	
		
		ЭтотОбъект.Статус = Перечисления.СтатусыСделок.Новая;
		
	ИначеЕсли Объект.Вид = Перечисления.ВидыСделок.Декларирование Тогда
		
		СделкаДекларирование = Истина;
		
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Новая, "Новая", Истина);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ПодготовкаДТ, "Подготовка ДТ");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ПодачаДТ, "Подача ДТ");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ДТПодана, "ДТ подана");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ТаможенныйКонтроль, "Таможенный контроль");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ВыпускДТ, "Выпуск ДТ");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.ПДТНТДПТД, "ПТД/НТД/ПТД");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.КонтрольПередЗакрытием, "Контроль перед закрытием");
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыСделок.Завершена, "Завершена"); 
		
		ЭтотОбъект.Статус = Перечисления.СтатусыСделок.Новая;
		
	КонецЕсли;
	
	Элементы.ПолученОригиналТелекс.Видимость					= СделкаЭкспорт ИЛИ СделкаИмпорт;
	Элементы.ПортОтгрузки.Видимость 							= СделкаИмпорт;
	Элементы.ПортПрибытия.Видимость 							= СделкаИмпорт; 
	
	Элементы.ПортОтгрузки1.Видимость 							= СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.ПортПрибытия1.Видимость 							= СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	
	Элементы.РежимВывоза.Видимость 								= НЕ СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.ВидТранспорта.Видимость 							= НЕ СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.ПрипортовойТерминал.Видимость 						= СделкаИмпорт;
	//Элементы.Фрахт.Видимость 									= СделкаИмпорт;
	Элементы.ТерминальнаяОбработка.Видимость 					= СделкаИмпорт;
	Элементы.УсловиеПоставки.Видимость 							= СделкаИмпорт;
	Элементы.ДатаПрибытия.Видимость 							= НЕ СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.ДатаВыходаИзПортаОтгрузки.Видимость 				= НЕ СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	
	Элементы.КонтейнерыДатаCutOff.Видимость 					= СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.КонтейнерыДатаETD.Видимость 						= СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.КонтейнерыДатаПолученияПорожнего.Видимость 		= СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.КонтейнерыДатаЗавозаКонтейнераВПорт.Видимость 		= СделкаЭкспорт И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	
	Элементы.КонтейнерыДатаВывозаИзПорта.Видимость 				= НЕ СделкаЭкспорт И НЕ СделкаСертификация;// И НЕ СделкаАвтоперевозка
	Элементы.КонтейнерыДатаВыгрузкиСуднаДО.Видимость 			= НЕ СделкаЭкспорт И НЕ СделкаСертификация;// И НЕ СделкаАвтоперевозка
	Элементы.КонтейнерыДатаВыгрузкиУКлиента.Видимость 			= НЕ СделкаЭкспорт И НЕ СделкаСертификация;// И НЕ СделкаАвтоперевозка
	Элементы.КонтейнерыДатаОкончанияДействияРелиза.Видимость 	= НЕ СделкаЭкспорт И НЕ СделкаСертификация;// И НЕ СделкаАвтоперевозка
	Элементы.КонтейнерыДатаСдачиПорожнегоКонтейнера.Видимость 	= НЕ СделкаЭкспорт И НЕ СделкаСертификация;// И НЕ СделкаАвтоперевозка
	Элементы.КонтейнерыПеревозчикВозвратВовремя.Видимость 		= НЕ СделкаЭкспорт И НЕ СделкаСертификация;// И НЕ СделкаАвтоперевозка
	
	Элементы.Линия.Видимость 									= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	//Элементы.ПодстатусОплатаВЛинию.Видимость 					= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.ПортПрибытия.Видимость 							= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.Агент.Видимость									= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.Демередж.Видимость									= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.Коносамент.Видимость								= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация; 
	Элементы.Судно.Видимость									= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	//Элементы.ТипДокументов.Видимость							= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	//Элементы.ПодстатусСрочностьСборДокументов.Видимость			= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.Сертификация.Видимость								= СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.МенеджерПоТаможне.Видимость						= СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.Контейнеры.Видимость								= НЕ СделкаДекларирование И НЕ СделкаСертификация; // И НЕ СделкаАвтоперевозка 
	Элементы.КоличествоКонтейнеров.Видимость					= НЕ СделкаДекларирование И НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	
	Элементы.ДеньгиНаЕЛС.Видимость                              = НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.КоличествоКодовТНВЭД.Видимость                     = НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.КоличествоАртикулов.Видимость                      = НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.НомерДТ.Видимость                                  = НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.КоличествоГрузовыхМест.Видимость                   = НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	//Элементы.КомментарийНДС.Видимость                           = НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	//Элементы.ГруппаКвартал.Видимость                            = НЕ СделкаАвтоперевозка И НЕ СделкаСертификация;
	Элементы.ГруппаАдресКонтактПогрузкаВыгрузка.Видимость       = СделкаАвтоперевозка;
	Элементы.ВесБрутто.Видимость                                = СделкаАвтоперевозка;
	Элементы.КлассОпасности.Видимость                           = СделкаАвтоперевозка;
	
	Элементы.ГруппаСертификаты.Видимость                        = СделкаСертификация; 
	
//// Заполнение поля выбора Условия поставки
//	Элементы.УсловиеПоставки.СписокВыбора.Очистить();
//	
//	Элементы.УсловиеПоставки.СписокВыбора.Добавить(Перечисления.УсловияПоставки.EXW, "EXW");
//	Элементы.УсловиеПоставки.СписокВыбора.Добавить(Перечисления.УсловияПоставки.FOB, "FOB");
//	Элементы.УсловиеПоставки.СписокВыбора.Добавить(Перечисления.УсловияПоставки.FCA, "FCA");
//	Элементы.УсловиеПоставки.СписокВыбора.Добавить(Перечисления.УсловияПоставки.CIF, "CIF");
//	Элементы.УсловиеПоставки.СписокВыбора.Добавить(Перечисления.УсловияПоставки.Экспедирование, "Экспедирование");
//	Если НЕ СделкаИмпорт Тогда
//		Элементы.УсловиеПоставки.СписокВыбора.Добавить(Перечисления.УсловияПоставки.Вывоз, "Вывоз");
//	КонецЕсли;
//	Элементы.УсловиеПоставки.СписокВыбора.Добавить(Перечисления.УсловияПоставки.Прочее, "Прочее");
//	Элементы.УсловиеПоставки.СписокВыбора.Добавить(Перечисления.УсловияПоставки.ЭкспедированиеНаСВХ, "Экспедирование на СВХ");
	

КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	
	Если НЕ ПолучитьРазрешениеПоРолиПользователя(ПользователиКлиентСервер.ТекущийПользователь()) Тогда
		
		ЭтотОбъект.Статус = ПолучитьСтатусСделки(); 
		
		ПоказатьПредупреждение(,"Нет прав для установки статуса <Закрыта>",,"ОШИБКА");
		
		Возврат;
		
	КонецЕсли; 
		
	Стр = Объект.Статусы.Добавить();  
	Стр.Статус = ЭтотОбъект.Статус;
	Стр.Дата = ТекущаяДата(); 
	
	Стр.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();        
	
	Если ЛогистикаСервер.ПолучитьНомерСтатуса(ЭтотОбъект.Статус, Объект.Вид) = 3 И Объект.Фрахт = ПредопределенноеЗначение("Перечисление.СтатусФрахта.Наш") Тогда
		
		ЭтотОбъект.ПодстатусБухгалтерия = ПредопределенноеЗначение("Перечисление.ПодстатусыБухгалтерияСделок.ВОбработке");
		
		Стр = Объект.Статусы.Добавить();  
		Стр.Статус = ЭтотОбъект.ПодстатусБухгалтерия;
		Стр.Дата = ТекущаяДата();
		Стр.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		
	ИначеЕсли ЛогистикаСервер.ПолучитьНомерСтатуса(ЭтотОбъект.Статус, Объект.Вид) > 3 И ЛогистикаСервер.ПолучитьНомерСтатуса(ЭтотОбъект.Статус, Объект.Вид)	< 8 Тогда
		
		ЭтотОбъект.ПодстатусБухгалтерия = ПредопределенноеЗначение("Перечисление.ПодстатусыБухгалтерияСделок.ВОбработке");
		
		Стр = Объект.Статусы.Добавить();  
		Стр.Статус = ЭтотОбъект.ПодстатусБухгалтерия;
		Стр.Дата = ТекущаяДата();
		Стр.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		
	КонецЕсли;
	
    ОбработатьДоступностьЭлементаДатаЗакрытия(Истина);  
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьРазрешениеПоРолиПользователя(ПользовательБазы)  
	
	Если ЭтотОбъект.Статус = Перечисления.СтатусыСделок.Закрыта Тогда
		
		ПравоИзменять = ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор");
		
		Возврат ПравоИзменять;
		
	Иначе	
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции 

&НаСервере
Процедура ОбработатьДоступностьЭлементаДатаЗакрытия(ИзмененСтатус = Ложь)

	Если ЭтотОбъект.Статус = Перечисления.СтатусыСделок.Закрыта ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыСделок.Завершена Тогда
		
		Элементы.ДатаЗакрытия.Видимость = Истина;
		
		Если ИзмененСтатус Тогда
			
			Объект.ДатаЗакрытия = ТекущаяДата();	
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ДатаЗакрытия.Видимость = Ложь; 
		
		Если ИзмененСтатус Тогда
			
			Объект.ДатаЗакрытия = Неопределено;	
			
		КонецЕсли;
		
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусСделки()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыСделок.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыСделок КАК СтатусыСделок
	|ГДЕ
	|	СтатусыСделок.Сделка = &Сделка";
	
	Запрос.УстановитьПараметр("Сделка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Выборка.Следующий(); 
		
		Возврат Выборка.Статус;
		
	Иначе
		
		Возврат Перечисления.СтатусыСделок.Новая;
		
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ЕстьДоверенность = ?(ДоверенностьБулево, 
	ПредопределенноеЗначение("Перечисление.СтатусыДоверенностей.Есть"),
	ПредопределенноеЗначение("Перечисление.СтатусыДоверенностей.Нет"));
	
	Если НЕ ЗаполнениеДанныхКорректно().Корректно Тогда 
		
		ОписаниеОповещения = Новый ОписаниеОповещения();
		
		ПоказатьПредупреждение(ОписаниеОповещения, ЗаполнениеДанныхКорректно().ТекстОшибки, 60, "Ошибка при сохранении");
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбязательныеПоляДекларирование()
	
	Результат = Новый Массив;
	Результат.Добавить("ДатаПрибытия");
	Результат.Добавить("МенеджерПоТаможне");
	Результат.Добавить("Сертификация");
	Результат.Добавить("ДеньгиНаЕЛС");
	Результат.Добавить("КоличествоКодовТНВЭД");
	Результат.Добавить("КоличествоАртикулов");
	Результат.Добавить("НомерДТ");
	Возврат Результат;
	
КонецФункции // ОбязательныеПоляДекларирование()

&НаСервере
Функция ЗаполнениеДанныхКорректно()
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Корректно", Истина);
	СтруктураВозврата.Вставить("ТекстОшибки", "");
	
	СделкаЭкспорт 	= Объект.Вид = Перечисления.ВидыСделок.Экспорт; 
	СделкаИмпорт	= Объект.Вид = Перечисления.ВидыСделок.Импорт;
	СделкаСертификация	= Объект.Вид = Перечисления.ВидыСделок.Сертификация; 
	СделкаДекларирование = Объект.Вид = Перечисления.ВидыСделок.Декларирование;
	СделкаАвтоперевозка = Объект.Вид = Перечисления.ВидыСделок.Автоперевозка;
	
	УсловиеПоставкиЭкспедированиеНаСВХ = Объект.УсловиеПоставки = Перечисления.УсловияПоставки.ЭкспедированиеНаСВХ;
	
	НомерСтатуса = ЛогистикаСервер.ПолучитьНомерСтатуса(ЭтотОбъект.Статус, Объект.Вид);
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		СтруктураВозврата.Корректно = Ложь;
		СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Контрагент>" + Символы.ПС;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		
		СтруктураВозврата.Корректно = Ложь;
		СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Договор>" + Символы.ПС;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКПапке) Тогда
		
		СтруктураВозврата.Корректно = Ложь;
		СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Путь к папке>" + Символы.ПС;
		
	КонецЕсли;
	
	Если СделкаАвтоперевозка Тогда   // === Проверка заполнения по сделкам Автоперевозок
		
		Если НЕ ЗначениеЗаполнено(Объект.Менеджер) Тогда
			
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Менеджер по продажам>" + Символы.ПС;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.МенеджерПоРаботеСКлиентами) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Менеджер по работе с клиентами>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Грузополучатель>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.АдресПогрузки) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Адрес погрузки>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.АдресВыгрузки) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Адрес выгрузки>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.КонтактНаПогрузке) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Контакт на погрузке>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.КонтактНаВыгрузке) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Контакт на выгрузке>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.КлассОпасности) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Класс опасности>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.ВесБрутто) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Вес брутто>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.ПутьКПапке) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Путь>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.Груз) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Груз>" + Символы.ПС;
		КонецЕсли;  
		
	ИначеЕсли СделкаСертификация Тогда // === Проверка заполнения по сделке СЕРТИФИКАЦИЯ
		
		Если НЕ ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Грузополучатель>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Грузополучатель>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.ПутьКПапке) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Путь>" + Символы.ПС;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидСертификата) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Вид сертификата>" + Символы.ПС;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Объект.КоличествоСертификатов) Тогда
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Количество сертификатов>" + Символы.ПС;
		КонецЕсли;    
		
	Иначе 	                                                       // === Проверка заполнения по сделкам Импорт Экспорт Декларирование
		
		Если НЕ ЗначениеЗаполнено(Объект.Менеджер) Тогда
			
			СтруктураВозврата.Корректно = Ложь;
			СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Менеджер по продажам>" + Символы.ПС;
			
		КонецЕсли;
		
		Если НЕ СделкаЭкспорт Тогда
			
			Если НЕ СделкаДекларирование  Тогда
				
				Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
					
					Если НЕ ЗначениеЗаполнено(Объект.Фрахт) Тогда
						
						СтруктураВозврата.Корректно = Ложь;
						СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Фрахт>" + Символы.ПС;
						
					КонецЕсли; 
					
				КонецЕсли;
				
				
				Если НЕ УсловиеПоставкиЭкспедированиеНаСВХ Тогда  
					
					Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
						
						Если НЕ ЗначениеЗаполнено(Объект.ПортОтгрузки) Тогда
							
							СтруктураВозврата.Корректно = Ложь;
							СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Порт отгрузки (POL)>" + Символы.ПС;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Объект.УсловиеПоставки) Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Условие поставки>" + Символы.ПС;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ УсловиеПоставкиЭкспедированиеНаСВХ Тогда
				
				Если НЕ ЗначениеЗаполнено(Объект.РежимВывоза) Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Режим вывоза>" + Символы.ПС;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СделкаИмпорт ИЛИ СделкаЭкспорт Тогда
			
			Если НЕ УсловиеПоставкиЭкспедированиеНаСВХ Тогда  
				
				Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
					
					Если НЕ ЗначениеЗаполнено(Объект.ПолученОригиналТелекс) Тогда
						
						СтруктураВозврата.Корректно = Ложь;
						СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Получен оригинал Телекс>" + Символы.ПС;
						
					КонецЕсли; 
					
				КонецЕсли;	
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.МенеджерПоРаботеСКлиентами) Тогда
				
				СтруктураВозврата.Корректно = Ложь;
				СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Менеджер по работе с клиентами>" + Символы.ПС;
				
			КонецЕсли; 
			
		КонецЕсли;
		
		Если НомерСтатуса > 1 Тогда //В РАБОТЕ, ПРОВЕРКА
			
			Если НЕ СделкаЭкспорт И НЕ СделкаДекларирование Тогда  
				
				Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
					
					Если НЕ ЗначениеЗаполнено(Объект.ДатаВыходаИзПортаОтгрузки) И 
						Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.ЭкспедированиеНаСВХ Тогда
						
						СтруктураВозврата.Корректно = Ложь;
						СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Выход из порта отгрузки>" + Символы.ПС;
						
					КонецЕсли; 
					
				КонецЕсли;
				
				Если СделкаДекларирование Тогда
					
					Если НЕ ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
						СтруктураВозврата.Корректно = Ложь;
						СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Грузополучатель>" + Символы.ПС;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НомерСтатуса > 2 И НЕ СделкаДекларирование Тогда //НА ПОДХОДЕ, ПРОВЕРКА    
			
			Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
				
				Если НЕ ЗначениеЗаполнено(Объект.Линия) И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.ЭкспедированиеНаСВХ  Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Линия>" + Символы.ПС;
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
				
				Если НЕ ЗначениеЗаполнено(Объект.Агент) И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.ЭкспедированиеНаСВХ Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Агент>" + Символы.ПС;
					
				КонецЕсли; 
				
			КонецЕсли;
			
			Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
				
				Если НЕ ЗначениеЗаполнено(Объект.Судно) И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.ЭкспедированиеНаСВХ Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Судно>" + Символы.ПС;
					
				КонецЕсли; 
				
			КонецЕсли;  
			
			Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
				
				
				Если НЕ ЗначениеЗаполнено(Объект.ПрипортовойТерминал) И НЕ СделкаЭкспорт Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Припортовой терминал>" + Символы.ПС;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Объект.ПортПрибытия) И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.ЭкспедированиеНаСВХ Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Порт прибытия>" + Символы.ПС;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Объект.Коносамент) Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Коносамент>" + Символы.ПС;
					
				КонецЕсли;
				
				Если НЕ УсловиеПоставкиЭкспедированиеНаСВХ Тогда
					
					Если НЕ ЗначениеЗаполнено(Объект.ДатаПрибытия) И НЕ СделкаЭкспорт Тогда
						
						СтруктураВозврата.Корректно = Ложь;
						СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <ETA>" + Символы.ПС;
						
					КонецЕсли;  
					
				КонецЕсли;   
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НомерСтатуса > 3 Тогда //ВЫГРУЖЕН, ПРОВЕРКА
			
			Если НЕ СделкаДекларирование Тогда
				Если НЕ СделкаЭкспорт Тогда
					
					Если НЕ УсловиеПоставкиЭкспедированиеНаСВХ Тогда
						
						Для Каждого Стр ИЗ Объект.Контейнеры Цикл  
							
					Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
							
							Если НЕ ЗначениеЗаполнено(Стр.ДатаВыгрузкиСуднаДО) Тогда
								
								СтруктураВозврата.Корректно = Ложь;
								СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "В таблице контейнеров не заполнено поле <Выгрузка судна/ДО>" + Символы.ПС;
								
								Прервать;
								
							КонецЕсли; 
							
					КонецЕсли;		
							
						КонецЦикла; 
						
					КонецЕсли;  
					
				Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
					
					Если НЕ ЗначениеЗаполнено(Объект.ТерминальнаяОбработка) Тогда
						
						СтруктураВозврата.Корректно = Ложь;
						СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Терминальная обработка>" + Символы.ПС;
						
					КонецЕсли; 
					
				КонецЕсли;
				
				
					
				КонецЕсли;
			Иначе
				Для каждого Поле Из ОбязательныеПоляДекларирование() Цикл
					
					Если НЕ ЗначениеЗаполнено(Объект[Поле]) Тогда
						
						СтруктураВозврата.Корректно = Ложь;
						СтруктураВозврата.ТекстОшибки = СтрШаблон("%1Не заполнено поле <%2>%3", СтруктураВозврата.ТекстОшибки, Поле, Символы.ПС);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НомерСтатуса > 4 Тогда //ВЫВЕЗЕН, ПРОВЕРКА ИЛИ СЕРТИФИКАТ ВЫПУЩЕН
			
			Если НЕ СделкаЭкспорт Тогда
				
				//Если НЕ ЗначениеЗаполнено(Объект.Направление) Тогда
				//	
				//	СтруктураВозврата.Корректно = Ложь;
				//	СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Направление>" + Символы.ПС;
				//	
				//КонецЕсли;
				
				Если НЕ УсловиеПоставкиЭкспедированиеНаСВХ Тогда
					
					Если НЕ ЗначениеЗаполнено(Объект.РежимВывоза) Тогда
						
						СтруктураВозврата.Корректно = Ложь;
						СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Режим вывоза>" + Символы.ПС;
						
					КонецЕсли;   
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Объект.ВидТранспорта) Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Вид транспорта>" + Символы.ПС;
					
				КонецЕсли;
				
				Если НЕ УсловиеПоставкиЭкспедированиеНаСВХ Тогда
					
					Для Каждого Стр ИЗ Объект.Контейнеры Цикл 
						
						Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
							
							Если НЕ ЗначениеЗаполнено(Стр.ДатаВывозаИзПорта) Тогда
								
								СтруктураВозврата.Корректно = Ложь;
								СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "В таблице контейнеров не заполнено поле <Вывоз из порта>" + Символы.ПС;
								
								Прервать;
								
							КонецЕсли; 
							
						КонецЕсли;		
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если СделкаСертификация Тогда
				
				Если НЕ ЗначениеЗаполнено(Объект.НомераСертификатов) Тогда
					
					СтруктураВозврата.Корректно = Ложь;
					СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "Не заполнено поле <Номера сертификатов>" + Символы.ПС; 
					
				КонецЕсли;                                                                                                                   
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Если НомерСтатуса > 5 Тогда //ДОСТАВЛЕН, ПРОВЕРКА
			
			Если НЕ СделкаЭкспорт Тогда
				
				Если НЕ УсловиеПоставкиЭкспедированиеНаСВХ Тогда
					
					Для Каждого Стр ИЗ Объект.Контейнеры Цикл 
						
						Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
							
							Если НЕ ЗначениеЗаполнено(Стр.ДатаВыгрузкиУКлиента) Тогда
								
								СтруктураВозврата.Корректно = Ложь;
								СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "В таблице контейнеров не заполнено поле <Выгрузка у клиента>" + Символы.ПС;
								
								Прервать;
								
							КонецЕсли; 
							
						КонецЕсли;		
						
					КонецЦикла; 
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Если НомерСтатуса > 6 Тогда //СДАН ПОРОЖНИЙ, ПРОВЕРКА
			
			Если НЕ СделкаЭкспорт Тогда
				
				Если НЕ УсловиеПоставкиЭкспедированиеНаСВХ Тогда
					
					Для Каждого Стр ИЗ Объект.Контейнеры Цикл  
						
						Если СделкаИмпорт И Объект.УсловиеПоставки <> Перечисления.УсловияПоставки.Вывоз Тогда    // Импорт и Вывоз
							
							Если НЕ ЗначениеЗаполнено(Стр.ДатаСдачиПорожнегоКонтейнера) Тогда
								
								СтруктураВозврата.Корректно = Ложь;
								СтруктураВозврата.ТекстОшибки = СтруктураВозврата.ТекстОшибки + "В таблице контейнеров не заполнено поле <Сдача порожнего контейнера>" + Символы.ПС;
								
								Прервать;
								
							КонецЕсли;
							
						КонецЕсли;		
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сделка.ПутьКПапке КАК ПутьКПапке,
	|	Сделка.Ссылка КАК Ссылка,
	|	Сделка.Вид КАК Вид
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.Ссылка <> &Ссылка
	|	И Сделка.ПутьКПапке = &ПутьКПапке
	|	И Сделка.Вид = &Вид";
	
	Запрос.УстановитьПараметр("ПутьКПапке", Объект.ПутьКПапке);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Вид", Объект.Вид);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Корректно = Ложь;
		ОшибкаПапки = СтрШаблон("Путь к папке %1 уже используется в документе %2", Объект.ПутьКПапке, Выборка.Ссылка);
		СтруктураВозврата.ТекстОшибки = СтрШаблон("%1%2%3", СтруктураВозврата.ТекстОшибки, ОшибкаПапки, Символы.ПС);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ДопРасходыПоАвтотранспортуОтсутствуютПриИзменении(Элемент)
	
	//Если Объект.ДопРасходыПоАвтотранспортуОтсутствуют Тогда
	//	
	//	Элементы.ДопРасходыАвтотранспорт.Доступность = Ложь;
	//	
	//Иначе  
	//	
	//	Элементы.ДопРасходыАвтотранспорт.Доступность = Истина;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыКоличествоПриИзменении(Элемент)
	
	//Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Сумма = Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Количество * Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыЦенаПриИзменении(Элемент)  
	
	//Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Сумма = Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Количество * Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Ставка;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыАвтотранспортКоличествоПриИзменении(Элемент) 
	
	//Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Сумма = Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Количество * Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыАвтотранспортЦенаПриИзменении(Элемент)
	
	//Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Сумма = Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Количество * Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Ставка;
	
КонецПроцедуры

&НаКлиенте
Процедура НетСтавкиПриИзменении(Элемент)
	
	Если Объект.НетСтавки Тогда
		
		Объект.СтавкаЗаполнена = Ложь;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаЗаполненаПриИзменении(Элемент)
	
	Если Объект.СтавкаЗаполнена Тогда
		
		Объект.НетСтавки = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиентаНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборПоВидуСделки = Новый Структура("ВидСделки",Объект.Вид); 
	ПараметрыФормы = Новый Структура("Отбор", ОтборПоВидуСделки);
	
	ОткрытьФорму("РегистрСведений.ВидыРасходовСделки.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиПеревыставляемыеПоСделке()
	
	ОтменаВыставленияСчета = Ложь;
	
	Для Каждого НомерСтроки ИЗ Элементы.РасходыКлиента.ВыделенныеСтроки Цикл 
		
		СтрокаРасходыКлиента = Объект.РасходыКлиента.НайтиПоИдентификатору(НомерСтроки);	
		
		Если СтрокаРасходыКлиента.Перевыставляемый И НЕ СтрокаРасходыКлиента.Выставлено И НЕ СтрокаРасходыКлиента.Аннулирован Тогда  
			
			Запрос = Новый Запрос;                                                 
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ЕСТЬNULL(ПеревыставляемыеТоварыУслугиОстатки.СуммаОстаток, 0)) КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.ПеревыставляемыеТоварыУслуги.Остатки(
			|			,
			|			Контрагент = &Контрагент
			|				И Номенклатура = &Номенклатура
			|				И Сделка = &Сделка) КАК ПеревыставляемыеТоварыУслугиОстатки";
			
			Запрос.УстановитьПараметр("Сделка", Объект.Ссылка);
			Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
			Запрос.УстановитьПараметр("Номенклатура", СтрокаРасходыКлиента.Номенклатура);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Если Выборка.СуммаОстаток < СтрокаРасходыКлиента.Сумма Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "По позиции " + СтрокаРасходыКлиента.Номенклатура + " недостаточно суммы остатка. Счет не может быть оформлен.";
					Сообщение.Сообщить();
					
					ОтменаВыставленияСчета = Истина;
					
				КонецЕсли;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "По позиции " + СтрокаРасходыКлиента.Номенклатура + " нет остатков. Счет не может быть оформлен.";
				Сообщение.Сообщить();
				
				ОтменаВыставленияСчета = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ОтменаВыставленияСчета;
	
	
КонецФункции	

&НаКлиенте
Процедура ВыставитьСчетРасходыКлиента(Команда)	
	
	ЕстьНевыставленныеУслуги = Ложь;
	ЕстьНДС = Ложь;
	
	ФормаДок = ПолучитьФорму("Документ.СчетНаОплатуПокупателю.ФормаОбъекта");
	
	ИндНДС = Истина;
	Для Каждого НомерСтроки ИЗ Элементы.РасходыКлиента.ВыделенныеСтроки Цикл
		
		СтрокаДляОбработки = Объект.РасходыКлиента.НайтиПоИдентификатору(НомерСтроки);
		
		Если (НЕ СтрокаДляОбработки.Выставлено) Тогда
			
			СтрДок = ФормаДок.Объект.Товары.Добавить();
			СтрДок.Номенклатура = СтрокаДляОбработки.Номенклатура;
			СтрДок.Содержание = СтрокаДляОбработки.Содержание;
			СтрДок.Количество = СтрокаДляОбработки.Количество;
			СтрДок.Цена = СтрокаДляОбработки.Цена;
			СтрДок.Сумма = СтрокаДляОбработки.Сумма;
			СтрДок.СтавкаНДС = СтрокаДляОбработки.СтавкаНДС;  
			СтрДок.СуммаНДС =  СтрокаДляОбработки.СуммаНДС;
			СтрДок.Перевыставляемый = СтрокаДляОбработки.Перевыставляемый;
			
			ЕстьНевыставленныеУслуги = Истина;
			
			ЕстьНДСНоменклатуры = ПолучитьРезультатПоСтавкеНДС(СтрДок.СтавкаНДС);
			
			Если (НЕ ЕстьНДС) И ЕстьНДСНоменклатуры И ИндНДС Тогда
				ЕстьНДС = ЕстьНДСНоменклатуры; 
				ИндНДС = Ложь;
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Если ЕстьНевыставленныеУслуги Тогда  
		
		ФормаДок.Объект.Дата = ТекущаяДата();
		ФормаДок.Объект.Сделка = Объект.Ссылка;
		ФормаДок.Объект.Организация = Объект.Организация;
		ФормаДок.Объект.Контрагент = Объект.Контрагент;
		ФормаДок.Объект.ДоговорКонтрагента = ПолучитьОсновнойДоговорКонтрагентаСПокупателем();
		ФормаДок.Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		ФормаДок.Объект.ВалютаДокумента = ПолучитьВалютуПоУмолчанию();
		ФормаДок.Объект.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
		ФормаДок.Объект.ВидОперации = ПолучитьВидОперацииСчетаНаОплатуПокупателю();
		
		ФормаДок.Объект.ДокументБезНДС = НЕ ЕстьНДС;
		
		ЭтаФорма.Модифицированность = Истина;
		
		ФормаДок.Объект.СуммаДокумента = ФормаДок.Объект.Товары.Итог("Сумма");
		
		ФормаДок.Элементы.ДокументОснование.Видимость = Истина;
		
		ФормаДок.Элементы.ДоговорКонтрагента.Доступность = Истина;
		
		ФормаДок.СрокОплаты = РассчитатьСрокОплатыСчета(ФормаДок.Объект.ДоговорКонтрагента);
		
		ФормаДок.Записать();
		
		Для Каждого НомерСтроки ИЗ Элементы.РасходыКлиента.ВыделенныеСтроки Цикл
			
			СтрокаДляОбработки = Объект.РасходыКлиента.НайтиПоИдентификатору(НомерСтроки);
			
			Если НЕ СтрокаДляОбработки.Выставлено Тогда
				
				СтрокаДляОбработки.Выставлено = Истина;
				СтрокаДляОбработки.СчетНаОплату = ФормаДок.Объект.Ссылка;
				
			КонецЕсли;              
			
		КонецЦикла; 
		
		ЭтотОбъект.Записать();
		
		ОбъектФормы = ФормаДок.Объект;
		
		СтруктураНадписи = Новый Структура(
		"ВалютаДокумента, Курс, Кратность, СуммаВключаетНДС, ДокументБезНДС, ВалютаРегламентированногоУчета",
		ОбъектФормы.ВалютаДокумента,
		ОбъектФормы.КурсВзаиморасчетов,
		ОбъектФормы.КратностьВзаиморасчетов,
		ОбъектФормы.СуммаВключаетНДС,
		ОбъектФормы.ДокументБезНДС,
		ФормаДок.ВалютаРегламентированногоУчета);
		
		ФормаДок.ЦеныИВалюта = ОбщегоНазначенияБПКлиентСервер.СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
		ФормаДок.Открыть();
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьРезультатПоСтавкеНДС(НомНДС)
	
	Если НомНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция РассчитатьСрокОплатыСчета(Дог)
	
	ДлинаСуток = 86400;
	СрокОплаты = Неопределено;
	
	РеквизитыДоговора = Неопределено;
	Если ОбщегоНазначения.СсылкаСуществует(Дог) Тогда
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Дог, "УстановленСрокОплаты, ДатаОплаты, СрокОплаты");
		
	КонецЕсли;
	
	Если РеквизитыДоговора <> Неопределено И РеквизитыДоговора.УстановленСрокОплаты Тогда
		Если ЗначениеЗаполнено(РеквизитыДоговора.ДатаОплаты) Тогда
			СрокОплаты = РеквизитыДоговора.ДатаОплаты;
		Иначе
			СрокОплаты = НачалоДня(ТекущаяДата()) + РеквизитыДоговора.СрокОплаты*ДлинаСуток;
		КонецЕсли;
		
	Иначе
		СрокОплаты = СрокиОплатыДокументов.СрокОплатыНовогоСчетаПокупателю(ТекущаяДата());
	КонецЕсли;
	
	Возврат СрокОплаты;
	
КонецФункции

&НаКлиенте
Процедура ВыставитьСчетДопРасходыКонтейнера(Команда) 
	
	//ЕстьНевыставленныеУслуги = Ложь;
	//
	//ФормаДок = ПолучитьФорму("Документ.СчетНаОплатуПокупателю.ФормаОбъекта");
	//
	//Для Каждого НомерСтроки ИЗ Элементы.ДопРасходыКонтейнера.ВыделенныеСтроки Цикл
	//	
	//	СтрокаДляОбработки = Объект.ДопРасходыКонтейнера.НайтиПоИдентификатору(НомерСтроки);
	//	
	//	Если НЕ СтрокаДляОбработки.Выставлено Тогда
	//		
	//		СтрДок = ФормаДок.Объект.Товары.Добавить();
	//		СтрДок.Номенклатура = СтрокаДляОбработки.Номенклатура;
	//		СтрДок.Содержание = СтрокаДляОбработки.Содержание;
	//		СтрДок.Количество = СтрокаДляОбработки.Количество;
	//		СтрДок.Цена = СтрокаДляОбработки.Цена;
	//		СтрДок.Сумма = СтрокаДляОбработки.Сумма;
	//		СтрДок.СтавкаНДС = ПолучитьСтавкуНДС0();
	//		
	//		ЕстьНевыставленныеУслуги = Истина;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//
	//Если ЕстьНевыставленныеУслуги Тогда 
	//	
	//	ФормаДок.Объект.Дата = ТекущаяДата();
	//	ФормаДок.Объект.ДокументОснование = Объект.Ссылка;
	//	ФормаДок.Объект.Организация = Объект.Организация;
	//	ФормаДок.Объект.Контрагент = Объект.Контрагент;
	//	ФормаДок.Объект.ДоговорКонтрагента = ПолучитьОсновнойДоговорКонтрагента();
	//	ФормаДок.Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	//	ФормаДок.Объект.ВалютаДокумента = ПолучитьВалютуПоУмолчанию();
	//	ФормаДок.Объект.СуммаВключаетНДС = Истина;
	//	ФормаДок.Объект.ВидОперации = ПолучитьВидОперацииСчетаНаОплатуПокупателю();
	//	
	//	
	//	ЭтаФорма.Модифицированность = Истина;
	//	
	//	ФормаДок.Объект.СуммаДокумента = ФормаДок.Объект.Товары.Итог("Сумма");
	//	
	//	ФормаДок.Элементы.ДокументОснование.Видимость = Истина;
	//	
	//	ФормаДок.Элементы.ДоговорКонтрагента.Доступность = Истина;
	//	
	//	ФормаДок.Записать();
	//	
	//	Для Каждого НомерСтроки ИЗ Элементы.ДопРасходыКонтейнера.ВыделенныеСтроки Цикл
	//		
	//		СтрокаДляОбработки = Объект.ДопРасходыКонтейнера.НайтиПоИдентификатору(НомерСтроки);
	//		
	//		Если НЕ СтрокаДляОбработки.Выставлено Тогда
	//			
	//			СтрокаДляОбработки.Выставлено = Истина;
	//			СтрокаДляОбработки.СчетНаОплату = ФормаДок.Объект.Ссылка;
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла; 
	//	
	//	ЭтотОбъект.Записать();
	//	
	//	ФормаДок.Открыть();
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыставитьСчетДопРасходыАвтотранспорта(Команда) 
	
	//ЕстьНевыставленныеУслуги = Ложь;
	//
	//ФормаДок = ПолучитьФорму("Документ.СчетНаОплатуПокупателю.ФормаОбъекта");
	//
	//Для Каждого НомерСтроки ИЗ Элементы.ДопРасходыАвтотранспорт.ВыделенныеСтроки Цикл
	//	
	//	СтрокаДляОбработки = Объект.ДопРасходыАвтотранспорт.НайтиПоИдентификатору(НомерСтроки);
	//	
	//	Если НЕ СтрокаДляОбработки.Выставлено Тогда
	//		
	//		СтрДок = ФормаДок.Объект.Товары.Добавить();
	//		СтрДок.Номенклатура = СтрокаДляОбработки.Номенклатура;
	//		СтрДок.Содержание = СтрокаДляОбработки.Содержание;
	//		СтрДок.Количество = СтрокаДляОбработки.Количество;
	//		СтрДок.Цена = СтрокаДляОбработки.Цена;
	//		СтрДок.Сумма = СтрокаДляОбработки.Сумма;
	//		СтрДок.СтавкаНДС = ПолучитьСтавкуНДС0();
	//		
	//		ЕстьНевыставленныеУслуги = Истина;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//
	//Если ЕстьНевыставленныеУслуги Тогда
	//	
	//	ФормаДок.Объект.Дата = ТекущаяДата();
	//	ФормаДок.Объект.ДокументОснование = Объект.Ссылка;
	//	ФормаДок.Объект.Организация = Объект.Организация;
	//	ФормаДок.Объект.Контрагент = Объект.Контрагент;
	//	ФормаДок.Объект.ДоговорКонтрагента = ПолучитьОсновнойДоговорКонтрагента();
	//	ФормаДок.Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	//	ФормаДок.Объект.ВалютаДокумента = ПолучитьВалютуПоУмолчанию();
	//	ФормаДок.Объект.СуммаВключаетНДС = Истина;
	//	ФормаДок.Объект.ВидОперации = ПолучитьВидОперацииСчетаНаОплатуПокупателю();
	//	
	//	ЭтаФорма.Модифицированность = Истина;
	//	
	//	ФормаДок.Объект.СуммаДокумента = ФормаДок.Объект.Товары.Итог("Сумма");
	//	
	//	ФормаДок.Элементы.ДокументОснование.Видимость = Истина;
	//	
	//	ФормаДок.Элементы.ДоговорКонтрагента.Доступность = Истина;
	//	
	//	ФормаДок.Записать();
	//	
	//	Для Каждого НомерСтроки ИЗ Элементы.ДопРасходыАвтотранспорт.ВыделенныеСтроки Цикл
	//		
	//		СтрокаДляОбработки = Объект.ДопРасходыАвтотранспорт.НайтиПоИдентификатору(НомерСтроки);
	//		
	//		Если НЕ СтрокаДляОбработки.Выставлено Тогда
	//			
	//			СтрокаДляОбработки.Выставлено = Истина;
	//			СтрокаДляОбработки.СчетНаОплату = ФормаДок.Объект.Ссылка;
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	ЭтотОбъект.Записать();
	//	
	//	ФормаДок.Открыть();
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОперацииСчетаНаОплатуПокупателю()
	
	Возврат Перечисления.ВидыОперацийСчетаПокупателю.ТоварыИУслуги;
	
КонецФункции

&НаСервере
Функция ПолучитьВалютуПоУмолчанию()
	
	Возврат Константы.ВалютаРегламентированногоУчета.Получить();
	
КонецФункции 

&НаСервере
Функция ПолучитьОсновнойДоговорКонтрагентаСПокупателем()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьОсновнойДоговорКонтрагентаСКомитентом()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСтавкуНДС0()
	
	Возврат Перечисления.СтавкиНДС.БезНДС;	
	
КонецФункции

&НаСервере
Функция ПолучитьСтавкуНДСВидРасхода(ВидРасхода)
	
	Возврат Справочники.Номенклатура.СтавкаНДС(ВидРасхода);	
	
КонецФункции 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодборРасходыКлиента" И Источник = ЭтаФорма.УникальныйИдентификатор Тогда
		
		Стр = Элементы.РасходыКлиента.ТекущиеДанные;
		Стр.Номенклатура = Параметр.Номенклатура;
		Стр.Количество = 1;
		Стр.Контейнеры = "Все";
		Стр.Содержание = ПолучитьСодержаниеУслугиПоВсемКонтейнерам(Стр.Номенклатура);
		Стр.Перевыставляемый = Параметр.Перевыставляемый;
		Стр.СтавкаНДС = ПолучитьСтавкуНДСВидРасхода(Параметр.Номенклатура);
		
		ЭтаФорма.Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "ВыборТекстаГруза" И Источник = ЭтаФорма.УникальныйИдентификатор Тогда	
		
		Объект.Груз = Параметр;
		
		ЭтаФорма.Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "ВыборТекстаКомментария" И Источник = ЭтаФорма.УникальныйИдентификатор Тогда	
		
		Объект.Комментарий = Параметр;  
		
		ЭтаФорма.Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "ВыборТекстаСтавки" И Источник = ЭтаФорма.УникальныйИдентификатор Тогда	
		
		Объект.Ставка = Параметр;   
		
		ЭтаФорма.Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "ВыборТекстаКомментарийНДС" И Источник = ЭтаФорма.УникальныйИдентификатор Тогда 
		
		Объект.КомментарийНДС = Параметр; 
		
		ЭтаФорма.Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "ВыбраныКонтейнерыДляРасходовКлиента" И Источник = ЭтаФорма.УникальныйИдентификатор Тогда 	
		
		Элементы.РасходыКлиента.ТекущиеДанные.Контейнеры = Параметр;
		Элементы.РасходыКлиента.ТекущиеДанные.Содержание = ПолучитьПолноеНаименованиеНоменклатуры(Элементы.РасходыКлиента.ТекущиеДанные.Номенклатура) +
			" коносамент " + Строка(Объект.Коносамент) + " " + ЛогистикаСервер.СтрокаКонтейнер() + " " + Параметр;  
		
		ЭтаФорма.Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "ВыполненоЗаполнениеИнформацияОПеревозчике" И Источник = ЭтаФорма.УникальныйИдентификатор Тогда
		
		Для Каждого Стр Из Объект.ИнформацияОПеревозчиках Цикл
			
			ПараметрыОтбора = Новый Структура("КлючСвязи", Параметр.КлючСвязи);
			
			НайденныеСтроки = Объект.ИнформацияОПеревозчиках.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
					
					Объект.ИнформацияОПеревозчиках.Удалить(СтрНайденнаяСтрока);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		Для Каждого Стр Из Параметр.МассивДобавляемыхСтрокИнформацияОПеревозчике Цикл
			
			СтрИнформацияОПеревозчике = Объект.ИнформацияОПеревозчиках.Добавить();
			СтрИнформацияОПеревозчике.КлючСвязи = Параметр.КлючСвязи;
			СтрИнформацияОПеревозчике.Перевозчик = Стр.Перевозчик;
			СтрИнформацияОПеревозчике.Направление = Стр.Направление;
			СтрИнформацияОПеревозчике.СтавкаАвтоперевозки = Стр.СтавкаАвтоперевозки;
			СтрИнформацияОПеревозчике.СтавкаКлиенту = Стр.СтавкаКлиенту;
			
		КонецЦикла;
		
		Для Каждого Стр Из Объект.Контейнеры Цикл
			
			Если Стр.КлючСвязиИнформацияОПеревозчике = Параметр.КлючСвязи Тогда
				
				Если Параметр.ТекстовоеПредставление = "" Тогда
					
					Стр.ИнформацияОПеревозчике = "не указан";
					
				Иначе
					
					Стр.ИнформацияОПеревозчике = Параметр.ТекстовоеПредставление;  
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьПолноеНаименованиеНоменклатуры(Ном)
	
	Возврат Ном.НаименованиеПолное; 
	
КонецФункции

&НаСервере
Функция ПолучитьСодержаниеУслугиПоВсемКонтейнерам(Ном)
	
	СтрокаКонтейнеры = "";
	
	Для Каждого Стр Из Объект.Контейнеры Цикл
		
		Если СтрокаКонтейнеры = "" Тогда
			
			СтрокаКонтейнеры = Стр.Контейнер.Наименование;
			
		Иначе
			
			СтрокаКонтейнеры = СтрокаКонтейнеры + ", " + Стр.Контейнер.Наименование;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Ном.НаименованиеПолное + " " + ЛогистикаСервер.СтрокаКонтейнер() + " " + СтрокаКонтейнеры;
	
КонецФункции

&НаКлиенте
Процедура ДопРасходыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("РегистрСведений.ВидыДопРасходовКонтейнераСделки.Форма.ФормаСписка", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыАвтотранспортНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//ОткрытьФорму("РегистрСведений.ВидыДопРасходовАвтотранспортаСделки.Форма.ФормаСписка", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиентаНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Стр = Элементы.РасходыКлиента.ТекущиеДанные;
	Стр.Номенклатура = ВыбранноеЗначение;
	Стр.Содержание = Строка(Стр.Номенклатура);
	Стр.Количество = 1; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Стр = Элементы.ДопРасходыКонтейнера.ТекущиеДанные;
	Стр.Номенклатура = ВыбранноеЗначение;
	Стр.Содержание = Строка(Стр.Номенклатура);
	Стр.Количество = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыАвтотранспортНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	//Стр = Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные;
	//Стр.Номенклатура = ВыбранноеЗначение;
	//Стр.Содержание = Строка(Стр.Номенклатура);
	//Стр.Количество = 1;
	//
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиентаКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасходыКлиента.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена; 
	ТекДанные.СуммаUSD = ТекДанные.Количество * ТекДанные.ЦенаUSD; 
	
	Если ЗначениеЗаполнено(ТекДанные.СтавкаНДС) Тогда
		ТекДанные.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(ТекДанные.Сумма, Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ТекДанные.СтавкаНДС, Ложь));	
	КонецЕсли;
	
	ПересчитатьСуммуНДСВСтроке(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиентаЦенаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.РасходыКлиента.ТекущиеДанные;
	
	ДанныеСтроки.Сумма = ДанныеСтроки.Количество * ДанныеСтроки.Цена;
	
	ПересчитатьСуммуНДСВСтроке(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиентаСуммаПриИзменении(Элемент)  
	
	ДанныеСтроки = Элементы.РасходыКлиента.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.Количество) Тогда
		
		ДанныеСтроки.Цена = ДанныеСтроки.Сумма / ДанныеСтроки.Количество;
		
	КонецЕсли; 
	
	ПересчитатьСуммуНДСВСтроке(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыСтавкаПриИзменении(Элемент)
	
	Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Сумма = Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Количество * Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыСуммаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Количество) Тогда
		
		Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Цена = Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Сумма / Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Количество;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыАвтотранспортСтавкаПриИзменении(Элемент)  
	
	//Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Сумма = Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Количество * Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Цена;
	//
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыАвтотранспортСуммаПриИзменении(Элемент) 
	
	//Если ЗначениеЗаполнено(Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Количество) Тогда
	//	
	//	Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Цена = Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Сумма / Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Количество;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиентаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РасходыКлиентаСчетНаОплату" Тогда	
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.СчетНаОплату) Тогда
			
			Если ТипЗнч(Элемент.ТекущиеДанные.СчетНаОплату) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
				
				ПараметрыФормы = Новый Структура("Ключ", Элементы.РасходыКлиента.ТекущиеДанные.СчетНаОплату);
				ОткрытьФорму("Документ.СчетНаОплатуПокупателю.Форма.ФормаДокумента", ПараметрыФормы);
								
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "РасходыКлиентаКонтейнеры" Тогда	
		
		МассивКонтейнеров = ПолучитьМассивКонтейнеровДляСтроки(Элементы.РасходыКлиента.ТекущиеДанные.Контейнеры);
		
		ПараметрыФормы = Новый Структура("Контейнеры", МассивКонтейнеров);
		ПараметрыФормы.Вставить("ИмяСобытия", "ВыбраныКонтейнерыДляРасходовКлиента");
		ОткрытьФорму("Документ.Сделка.Форма.ФормаВыбораКонтейнеровНаРасходы", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
		
	ИначеЕсли Поле.Имя = "РасходыКлиентаРеализация" Тогда	
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Реализация) Тогда
			
			ПараметрыФормы = Новый Структура("Ключ", Элементы.РасходыКлиента.ТекущиеДанные.Реализация);
			ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаУслуги", ПараметрыФормы);
			
		КонецЕсли; 
		
	ИначеЕсли Поле.Имя = "РасходыКлиентаОтчетКомитенту" Тогда	
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОтчетКомитенту) Тогда
			
			ПараметрыФормы = Новый Структура("Ключ", Элементы.РасходыКлиента.ТекущиеДанные.ОтчетКомитенту);
			ОткрытьФорму("Документ.ОтчетКомитентуОПродажах.Форма.ФормаДокументаОЗакупках", ПараметрыФормы);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыКонтейнераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДопРасходыКонтейнераСчетНаОплату" Тогда
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.СчетНаОплату) Тогда
			ПараметрыФормы = Новый Структура("Ключ", Элементы.ДопРасходыКонтейнера.ТекущиеДанные.СчетНаОплату);
			ОткрытьФорму("Документ.СчетНаОплатуПокупателю.Форма.ФормаДокумента", ПараметрыФормы);
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ДопРасходыКонтейнераКонтейнеры" Тогда	
		
		МассивКонтейнеров = ПолучитьМассивКонтейнеровДляСтроки(Элементы.ДопРасходыКонтейнера.ТекущиеДанные.Контейнеры);
		
		ПараметрыФормы = Новый Структура("Контейнеры", МассивКонтейнеров);
		ПараметрыФормы.Вставить("ИмяСобытия", "ВыбраныКонтейнерыДляДопРасходовКонтейнера");
		ОткрытьФорму("Документ.Сделка.Форма.ФормаВыбораКонтейнеровНаРасходы", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыАвтотранспортВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Если Поле.Имя = "ДопРасходыАвтотранспортСчетНаОплату" Тогда	 
	//	
	//	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.СчетНаОплату) Тогда
	//		ПараметрыФормы = Новый Структура("Ключ", Элементы.Товары.ДопРасходыАвтотранспорт.СчетНаОплату);
	//		ОткрытьФорму("Документ.СчетНаОплатуПокупателю.Форма.ФормаДокумента", ПараметрыФормы);
	//		
	//	КонецЕсли; 
	//	
	//ИначеЕсли Поле.Имя = "ДопРасходыАвтотранспортКонтейнеры" Тогда	
	//	
	//	МассивКонтейнеров = ПолучитьМассивКонтейнеровДляСтроки(Элементы.ДопРасходыАвтотранспорт.ТекущиеДанные.Контейнеры);
	//	
	//	ПараметрыФормы = Новый Структура("Контейнеры", МассивКонтейнеров);
	//	ПараметрыФормы.Вставить("ИмяСобытия", "ВыбраныКонтейнерыДляДопРасходовАвтотранспорта");
	//	ОткрытьФорму("Документ.Сделка.Форма.ФормаВыбораКонтейнеровНаРасходы", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//	
	//КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКонтейнеровДляСтроки(СтрокаКонтейнеры)
	
	Массив = Новый Массив;
	
	Для Каждого Стр Из Объект.Контейнеры Цикл
		
		Структ = Новый Структура;
		Структ.Вставить("Контейнер", Стр.Контейнер);
		
		Если СтрНайти(СтрокаКонтейнеры, Стр.Контейнер.Наименование) > 0 ИЛИ СтрокаКонтейнеры = "Все" Тогда
			
			Структ.Вставить("Выбран", Истина);
			
		Иначе
			
			Структ.Вставить("Выбран", Ложь);
			
		КонецЕсли;  
		
		Массив.Добавить(Структ);
		
	КонецЦикла;     
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ПодстатусБухгалтерияПриИзменении(Элемент) 
	
	Стр = Объект.Статусы.Добавить();  
	Стр.Статус = ЭтотОбъект.ПодстатусБухгалтерия;
	Стр.Дата = ТекущаяДата();
	Стр.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодстатусФинОтделПриИзменении(Элемент)
	
	Стр = Объект.Статусы.Добавить();  
	Стр.Статус = ЭтотОбъект.ПодстатусФинОтдел;
	Стр.Дата = ТекущаяДата();
	Стр.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыПоКонтейнеруОтсутствуютПриИзменении(Элемент)
	
	//Если Объект.ДопРасходыПоКонтейнеруОтсутствуют Тогда
	//	
	//	Элементы.ДопРасходыКонтейнера.Доступность = Ложь;
	//	
	//Иначе  
	//	
	//	Элементы.ДопРасходыКонтейнера.Доступность = Истина;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатыДляВсехСтрокПоКолонкеКонтейнеры(Команда)   
	
	Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
		
		ИмяКолонки = Элементы.Контейнеры.ТекущийЭлемент.Имя;
		ИмяКолонки = СтрЗаменить(ИмяКолонки, "Контейнеры", "");
		ТекДата = Элементы.Контейнеры.ТекущиеДанные[ИмяКолонки];
		
		Если ТипЗнч(ТекДата) = Тип("Дата") Тогда
			
			Для Каждого Стр Из Объект.Контейнеры Цикл
				
				Стр[ИмяКолонки] = ТекДата;
				
			КонецЦикла;
			
		Иначе
			
			ОписаниеОповещения = Новый ОписаниеОповещения();
			
			ПоказатьПредупреждение(ОписаниеОповещения, "Заполнение доступно только для дат", 60, "Ошибка при изменении");
			
			Отказ = Истина;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьСуммуUSDПоТекущемуКурсуДопРасходыАвтотранспорта(Команда)
	
	//КурсВалютыUSD = ПолучитьКурсВалютыUSD();
	//
	//Для Каждого НомерСтроки ИЗ Элементы.ДопРасходыАвтотранспорт.ВыделенныеСтроки Цикл
	//	
	//	СтрокаДляОбработки = Объект.ДопРасходыАвтотранспорт.НайтиПоИдентификатору(НомерСтроки);
	//	
	//	Если СтрокаДляОбработки.ЦенаUSD > 0 Тогда
	//		
	//		СтрокаДляОбработки.Цена = (СтрокаДляОбработки.ЦенаUSD * КурсВалютыUSD.Курс) / КурсВалютыUSD.Кратность; 
	//		СтрокаДляОбработки.Сумма = СтрокаДляОбработки.Цена * СтрокаДляОбработки.Количество;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьСуммуUSDПоТекущемуКурсуДопРасходыКонтейнера(Команда)
	
	//КурсВалютыUSD = ПолучитьКурсВалютыUSD();
	//
	//Для Каждого НомерСтроки ИЗ Элементы.ДопРасходыКонтейнера.ВыделенныеСтроки Цикл
	//	
	//	СтрокаДляОбработки = Объект.ДопРасходыКонтейнера.НайтиПоИдентификатору(НомерСтроки);
	//	
	//	Если СтрокаДляОбработки.ЦенаUSD > 0 Тогда
	//		
	//		СтрокаДляОбработки.Цена = (СтрокаДляОбработки.ЦенаUSD * КурсВалютыUSD.Курс) / КурсВалютыUSD.Кратность; 
	//		СтрокаДляОбработки.Сумма = СтрокаДляОбработки.Цена * СтрокаДляОбработки.Количество;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьСуммуUSDПоТекущемуКурсуРасходыКлиента(Команда)
	
	КурсВалютыUSD = ПолучитьКурсВалютыUSD();
	
	Для Каждого НомерСтроки ИЗ Элементы.РасходыКлиента.ВыделенныеСтроки Цикл
		
		СтрокаДляОбработки = Объект.РасходыКлиента.НайтиПоИдентификатору(НомерСтроки);
		
		Если СтрокаДляОбработки.ЦенаUSD > 0 Тогда
			
			СтрокаДляОбработки.Цена = (СтрокаДляОбработки.ЦенаUSD * КурсВалютыUSD.Курс) / КурсВалютыUSD.Кратность; 
			СтрокаДляОбработки.Сумма = СтрокаДляОбработки.Цена * СтрокаДляОбработки.Количество;
			ПересчитатьСуммуНДСВСтроке(СтрокаДляОбработки)
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалютыUSD()
	
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("840"), ТекущаяДата());
	
КонецФункции

&НаКлиенте
Процедура ВыставитьОтчетКомитенту(Команда)
	
	ЕстьНевыставленныеУслуги = Ложь;
	
	ФормаДок = ПолучитьФорму("Документ.ОтчетКомитентуОПродажах.Форма.ФормаДокументаОЗакупках");
	
	Для Каждого НомерСтроки ИЗ Элементы.РасходыКлиента.ВыделенныеСтроки Цикл
		
		СтрокаДляОбработки = Объект.РасходыКлиента.НайтиПоИдентификатору(НомерСтроки);
		
		Если НЕ СтрокаДляОбработки.Выставлено Тогда
			
			//СтрДок = ФормаДок.Объект.Товары.Добавить();
			//СтрДок.Номенклатура = СтрокаДляОбработки.Номенклатура;
			//СтрДок.Содержание = СтрокаДляОбработки.Содержание;
			//СтрДок.Количество = СтрокаДляОбработки.Количество;
			//СтрДок.Цена = СтрокаДляОбработки.Цена;
			//СтрДок.Сумма = СтрокаДляОбработки.Сумма;
			//СтрДок.СтавкаНДС = ПолучитьСтавкуНДС0();
			
			ЕстьНевыставленныеУслуги = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьНевыставленныеУслуги Тогда  
		
		ФормаДок.Объект.Дата = ТекущаяДата();
		ФормаДок.Объект.ДокументОснование = Объект.Ссылка;
		ФормаДок.Объект.Организация = Объект.Организация;
		ФормаДок.Объект.Контрагент = Объект.Контрагент;
		ФормаДок.Объект.ДоговорКонтрагента = ПолучитьОсновнойДоговорКонтрагентаСКомитентом();
		ФормаДок.Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		ФормаДок.Объект.ВалютаДокумента = ПолучитьВалютуПоУмолчанию();
		ФормаДок.Объект.СуммаВключаетНДС = Истина;
		ФормаДок.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках");   
		
		ФормаДок.Объект.СчетУчетаРасчетовСКонтрагентом = ПолучитьСчет7606();
		ФормаДок.Объект.СчетУчетаРасчетовПоАвансам = ПолучитьСчет7606();
		
		ЭтаФорма.Модифицированность = Истина;
		
		ФормаДок.Элементы.ДокументОснование.Видимость = Истина;
		
		ФормаДок.Элементы.ДоговорКонтрагента.Доступность = Истина;
		
		ФормаДок.Записать();
		
		Для Каждого НомерСтроки ИЗ Элементы.РасходыКлиента.ВыделенныеСтроки Цикл
			
			СтрокаДляОбработки = Объект.РасходыКлиента.НайтиПоИдентификатору(НомерСтроки);
			
			Если НЕ СтрокаДляОбработки.Выставлено Тогда
				
				СтрокаДляОбработки.Выставлено = Истина;
				СтрокаДляОбработки.ОтчетКомитенту = ФормаДок.Объект.Ссылка;
				
			КонецЕсли;
			
		КонецЦикла;   
		
		ЭтотОбъект.Записать();
		
		ФормаДок.Открыть();
		
	КонецЕсли;	
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьСчет7606()
	
	Возврат ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.06");	
	
КонецФункции

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("Текст", Объект.Комментарий);
	СтруктураПараметров.Вставить("ВидТекста", "ВыборТекстаКомментария");
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаВводаМногострочныхТекстовыхЗначений",СтруктураПараметров,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("Текст", Объект.Ставка);
	СтруктураПараметров.Вставить("ВидТекста", "ВыборТекстаСтавки");
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаВводаМногострочныхТекстовыхЗначений",СтруктураПараметров,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("Текст", Объект.Груз);
	СтруктураПараметров.Вставить("ВидТекста", "ВыборТекстаГруза");
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаВводаМногострочныхТекстовыхЗначений",СтруктураПараметров,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	Если Поле.Имя = "КонтейнерыИнформацияОПеревозчике" Тогда
		
		Если НЕ ЗначениеЗаполнено(Элементы.Контейнеры.ТекущиеДанные.КлючСвязиИнформацияОПеревозчике) Тогда
			
			Элементы.Контейнеры.ТекущиеДанные.КлючСвязиИнформацияОПеревозчике = Элементы.Контейнеры.ТекущиеДанные.ПолучитьИдентификатор();
			
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючСвязи", Элементы.Контейнеры.ТекущиеДанные.КлючСвязиИнформацияОПеревозчике);
		
		ОткрытьФорму("Документ.Сделка.Форма.ФормаРедактированияИнформацииОПеревозчике", ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ЭтаФорма.Модифицированность = Истина;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПередУдалением(Элемент, Отказ) 
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Контейнеры.ТекущиеДанные.КлючСвязиИнформацияОПеревозчике);
	
	НайденныеСтроки = Объект.ИнформацияОПеревозчиках.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.ИнформацияОПеревозчиках.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСвязанныеОтчетыКомитентуКСчетам();
	
	ЗаполнитьСвязанныеРеализации();
	
	УстановкаВидимостиРеквизитов();
	
	НомерСтатуса = ЛогистикаСервер.ПолучитьНомерСтатуса(ЭтотОбъект.Статус,Объект.Вид); 	
	
	Если НомерСтатуса = 10 И 
		НЕ ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") Тогда	
		
		ЭтаФорма.ТолькоПросмотр = Истина;	
		
		Элементы.КонтейнерыИнформацияОПеревозчике.Доступность = Ложь;
		Элементы.РасходыКлиентаКонтейнеры.Доступность = Ложь;
		Элементы.ВыбратьПутьКПапке.Доступность = Ложь;
		
		//Кнопки ТЧ
		Элементы.КонтейнерыУстановитьДатыДляВсехСтрокПоКолонкеКонтейнеры.Доступность = Ложь;
		Элементы.РасходыКлиентаВыставитьСчетРасходыКлиента.Доступность = Ложь;
		Элементы.РасходыКлиентаВыставитьОтчетКомитенту.Доступность = Ложь;
		Элементы.РасходыКлиентаКонвертироватьСуммуUSDПоТекущемуКурсуРасходыКлиента.Доступность = Ложь;
		Элементы.РасходыКлиентаАннулироватьРасходКлиента.Доступность = Ложь;
		Элементы.РасходыКлиентаВыделениеЦветом.Доступность = Ложь; 
		Элементы.РасходыКлиентаСкопироватьРасходыКлиентаИзДругойСделки.Доступность = Ложь;
		
		Сообщить("Сделка закрыта. Вам запрещено редактировать документ"); 
		
	ИначеЕсли НомерСтатуса = 9 И
		 НЕ ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") Тогда	
		
		ЭтаФорма.ТолькоПросмотр = Истина;	
		
		Элементы.КонтейнерыИнформацияОПеревозчике.Доступность = Ложь;
		Элементы.РасходыКлиентаКонтейнеры.Доступность = Ложь;
		Элементы.ВыбратьПутьКПапке.Доступность = Ложь;
		
		//Кнопки ТЧ
		Элементы.КонтейнерыУстановитьДатыДляВсехСтрокПоКолонкеКонтейнеры.Доступность = Ложь;
		Элементы.РасходыКлиентаВыставитьСчетРасходыКлиента.Доступность = Ложь;
		Элементы.РасходыКлиентаВыставитьОтчетКомитенту.Доступность = Ложь;
		Элементы.РасходыКлиентаКонвертироватьСуммуUSDПоТекущемуКурсуРасходыКлиента.Доступность = Ложь;
		Элементы.РасходыКлиентаАннулироватьРасходКлиента.Доступность = Ложь;
		Элементы.РасходыКлиентаВыделениеЦветом.Доступность = Ложь; 
		Элементы.РасходыКлиентаСкопироватьРасходыКлиентаИзДругойСделки.Доступность = Ложь;
		
		Сообщить("Сделка на контроле. Вам запрещено редактировать документ");
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСвязанныеОтчетыКомитентуКСчетам()
	
	Для Каждого Стр Из Объект.РасходыКлиента Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.ОтчетКомитенту) И ЗначениеЗаполнено(Стр.СчетНаОплату) Тогда
			
			Стр.ОтчетКомитенту = ПолучитьСвязанныйОтчетКомитенту(Стр.СчетНаОплату);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСвязанныйОтчетКомитенту(СчетНаОплату)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	               |ГДЕ
	               |	ОтчетКомитентуОПродажах.Проведен = ИСТИНА
	               |	И ОтчетКомитентуОПродажах.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", СчетНаОплату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСвязанныеРеализации()
	
	Для Каждого Стр Из Объект.РасходыКлиента Цикл
		
		Если ЗначениеЗаполнено(Стр.СчетНаОплату) Тогда
			
			Стр.Реализация = ПолучитьСвязаннуюРеализацию(Стр.СчетНаОплату);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСвязаннуюРеализацию(СчетНаОплату)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &ДокументОснование
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю1
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ПО СчетНаОплатуПокупателю1.Ссылка = РеализацияТоваровУслуг.СчетНаОплатуПокупателю
	|		ПО ОтчетКомитентуОПродажах.Ссылка = СчетНаОплатуПокупателю1.ДокументОснование.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И ОтчетКомитентуОПродажах.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", СчетНаОплату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Реализация;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	ЗаполнитьВизуальноеОтображениеИнформацияОПеревозчиках(); 
	
КонецПроцедуры

&НаСервере
Функция СохранитьДанныеСтатусовСделки()
	
	НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Сделка.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 Тогда
		
		МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
		
		МЗ.Сделка = Объект.Ссылка;
		МЗ.Статус = Статус;
		МЗ.ПодстатусБухгалтерия = ПодстатусБухгалтерия;
		МЗ.ПодстатусФинОтдел = ПодстатусФинОтдел;
		МЗ.ПодстатусОплатаВЛинию = ПодстатусОплатаВЛинию;
		МЗ.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
		МЗ.ДатаВремяПоследнейСменыПодстатусаФинОтдел = ТекущаяДата();
		МЗ.Записать();
		
	Иначе
		
		ПредупреждениеПриЗакрытииОСтатусах = Неопределено;
		
		Если НЗ[0].Статус <> Статус Тогда
			
			НЗ[0].Статус = Статус;
			
		КонецЕсли;
		
		Если НЗ[0].ПодстатусБухгалтерия <> ПодстатусБухгалтерия Тогда
			
			НЗ[0].ПодстатусБухгалтерия = ПодстатусБухгалтерия;
			
		КонецЕсли;
		
		Если НЗ[0].ПодстатусФинОтдел <> ПодстатусФинОтдел Тогда
			
			Если ЭтотОбъект.ДатаВремяОткрытияФормы < НЗ[0].ДатаВремяПоследнейСменыПодстатусаФинОтдел Тогда
				
				Если ПредупреждениеПриЗакрытииОСтатусах = Неопределено Тогда
					
					ПредупреждениеПриЗакрытииОСтатусах = "Не удалось установить подстатус (фин.), так как был установлен другой подстатус другим пользователем во время работы с документом";
					
				Иначе
					
					ПредупреждениеПриЗакрытииОСтатусах = ПредупреждениеПриЗакрытииОСтатусах + Символы.ПС + "Не удалось установить подстатус (фин.), так как был установлен другой подстатус другим пользователем во время работы с документом";
					
				КонецЕсли;
				
			Иначе	
				
				НЗ[0].ПодстатусФинОтдел = ПодстатусФинОтдел;  
				НЗ[0].ДатаВремяПоследнейСменыПодстатусаФинОтдел = ТекущаяДата();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЗ[0].ПодстатусОплатаВЛинию <> ПодстатусОплатаВЛинию Тогда
			
			Если ЭтотОбъект.ДатаВремяОткрытияФормы < НЗ[0].ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию Тогда
				
				Если ПредупреждениеПриЗакрытииОСтатусах = Неопределено Тогда
					
					ПредупреждениеПриЗакрытииОСтатусах = "Не удалось установить подстатус (опл. в линию), так как был установлен другой подстатус другим пользователем во время работы с документом";
					
				Иначе
					
					ПредупреждениеПриЗакрытииОСтатусах = ПредупреждениеПриЗакрытииОСтатусах + Символы.ПС + "Не удалось установить подстатус (опл. в линию), так как был установлен другой подстатус другим пользователем во время работы с документом";
					
				КонецЕсли;
				
			Иначе
				
				НЗ[0].ПодстатусОплатаВЛинию = ПодстатусОплатаВЛинию;
				НЗ[0].ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
				
			КонецЕсли;
			
		КонецЕсли;
		
		НЗ.Записать();
		
	КонецЕсли;
	
	Возврат ПредупреждениеПриЗакрытииОСтатусах;
	
КонецФункции

&НаКлиенте
Процедура АннулироватьРасходКлиента(Команда)
	
	Если Элементы.РасходыКлиента.ТекущиеДанные.Аннулирован Тогда
		
		Элементы.РасходыКлиента.ТекущиеДанные.Аннулирован = Ложь;
		
	Иначе
		
		Элементы.РасходыКлиента.ТекущиеДанные.Аннулирован = Истина;
		
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛинияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	Если ЗначениеЗаполнено(Объект.Агент) Тогда
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьСписокЛинийПоАгенту());
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Линия.ПараметрыВыбора = НовыеПараметры;
		
	Иначе
		
		Элементы.Линия.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСписокЛинийПоАгенту()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СоответствиеЛинийИАгентЛиний.Линия КАК Линия
	|ИЗ
	|	РегистрСведений.СоответствиеЛинийИАгентЛиний КАК СоответствиеЛинийИАгентЛиний
	|ГДЕ
	|	СоответствиеЛинийИАгентЛиний.АгентЛинии = &АгентЛинии";
	
	Запрос.УстановитьПараметр("АгентЛинии", Объект.Агент);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка.ВыгрузитьКолонку("Линия");
	
КонецФункции

&НаКлиенте
Процедура АгентНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	Если ЗначениеЗаполнено(Объект.Линия) Тогда
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьСписокАгентовПоЛинии());
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Агент.ПараметрыВыбора = НовыеПараметры;
		
	Иначе
		
		Элементы.Агент.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокАгентовПоЛинии()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СоответствиеЛинийИАгентЛиний.АгентЛинии КАК АгентЛинии
	|ИЗ
	|	РегистрСведений.СоответствиеЛинийИАгентЛиний КАК СоответствиеЛинийИАгентЛиний
	|ГДЕ
	|	СоответствиеЛинийИАгентЛиний.Линия = &Линия";
	
	Запрос.УстановитьПараметр("Линия", Объект.Линия);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка.ВыгрузитьКолонку("АгентЛинии");
	
КонецФункции

&НаКлиенте
Процедура ЛинияПриИзменении(Элемент)
	
	СформироватьСписокВыбораАгентаЛинии();
	
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьСписокВыбораЛинии()
	
	Если ЗначениеЗаполнено(Объект.Агент) Тогда   
		
		СписокЛинийПоАгенту = ПолучитьСписокЛинийПоАгенту();
		
		Элементы.Линия.СписокВыбора.Очистить();
		
		Для Каждого Стр Из СписокЛинийПоАгенту Цикл
			
			Элементы.Линия.СписокВыбора.Добавить(Стр, Строка(Стр));	
			
		КонецЦикла;
		
	Иначе
		
		Элементы.Линия.СписокВыбора.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокВыбораАгентаЛинии()
	
	Если ЗначениеЗаполнено(Объект.Линия) Тогда   
		
		СписокАгентовПоЛинии = ПолучитьСписокАгентовПоЛинии();
		
		Элементы.Агент.СписокВыбора.Очистить();
		
		Для Каждого Стр Из СписокАгентовПоЛинии Цикл
			
			Элементы.Агент.СписокВыбора.Добавить(Стр, Строка(Стр));	
			
		КонецЦикла;
		
	Иначе
		
		Элементы.Агент.СписокВыбора.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгентПриИзменении(Элемент)
	
	СформироватьСписокВыбораЛинии();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНДСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("Текст", Объект.КомментарийНДС);
	СтруктураПараметров.Вставить("ВидТекста", "ВыборТекстаКомментарийНДС");
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаВводаМногострочныхТекстовыхЗначений",СтруктураПараметров,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеРасходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ВходящиеРасходыПоступлениеУслуг" Тогда	
		
		Если ЗначениеЗаполнено(Элементы.ВходящиеРасходы.ТекущиеДанные.ПоступлениеУслуг) Тогда
			
			ВидДокумента = ПолучитьВидДокументаПоступления(Элементы.ВходящиеРасходы.ТекущиеДанные.ПоступлениеУслуг);
			
			Если ВидДокумента = "Услуги" Тогда
				
				ПараметрыФормы = Новый Структура("Ключ", Элементы.ВходящиеРасходы.ТекущиеДанные.ПоступлениеУслуг);
				ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаУслуги", ПараметрыФормы); 
				
			ИначеЕсли ВидДокумента = "Товары" Тогда
				
				ПараметрыФормы = Новый Структура("Ключ", Элементы.ВходящиеРасходы.ТекущиеДанные.ПоступлениеУслуг);
				ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары", ПараметрыФормы);
				
			ИначеЕсли ВидДокумента = "Общая" Тогда
				
				ПараметрыФормы = Новый Структура("Ключ", Элементы.ВходящиеРасходы.ТекущиеДанные.ПоступлениеУслуг);
				ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаОбщая", ПараметрыФормы);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьВидДокументаПоступления(Док)
	
	Если Док.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Услуги Тогда
		
		Возврат "Услуги";
		
	ИначеЕсли Док.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары Тогда 
		
		Возврат "Товары";
		
	ИначеЕсли Док.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия Тогда 
		
		Возврат "Общая";
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура КварталВперед(Команда)
	
	Объект.Квартал = ДобавитьМесяц(НачалоМесяца(Объект.Квартал), 3);
	
КонецПроцедуры

&НаКлиенте
Процедура КварталНазад(Команда)
	
	Объект.Квартал = ДобавитьМесяц(НачалоМесяца(Объект.Квартал), -3); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументовПриИзменении(Элемент)
	
	Объект.СборДокументов.Очистить();
	
	ЗаполнитьНеобходимыеДокументы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПредупреждениеПриЗакрытииОСтатусах = СохранитьДанныеСтатусовСделки();
	
	Если ПредупреждениеПриЗакрытииОСтатусах <> Неопределено Тогда 
		
		ПоказатьПредупреждение(Неопределено, ПредупреждениеПриЗакрытииОСтатусах, 0, "Ошибка применения статусов");	
		
	КонецЕсли;
	
	ЭтотОбъект.ДатаВремяОткрытияФормы = ТекущаяДата();
	
КонецПроцедуры      

&НаКлиенте
Процедура РасходыКлиентаВыделитьЖелтым(Команда)
	
	Если Элементы.РасходыКлиента.ТекущиеДанные <> Неопределено Тогда 
		
		Если Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЖелтым Тогда 
			
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЖелтым = Ложь;
			
		Иначе
			
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЖелтым = Истина;
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЗеленым = Ложь;
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьКрасным = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиентаВыделитьЗеленым(Команда)
	
	Если Элементы.РасходыКлиента.ТекущиеДанные <> Неопределено Тогда 
		
		Если Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЗеленым Тогда 
			
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЗеленым = Ложь;
			
		Иначе
			
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЗеленым = Истина;
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЖелтым = Ложь;
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьКрасным = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;  
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиентаВыделитьКрасным(Команда)
	
	Если Элементы.РасходыКлиента.ТекущиеДанные <> Неопределено Тогда 
		
		Если Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьКрасным Тогда 
			
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьКрасным = Ложь;
			
		Иначе
			
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьКрасным = Истина;
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЗеленым = Ложь;
			Элементы.РасходыКлиента.ТекущиеДанные.ВыделитьЖелтым = Ложь;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьРасходыКлиентаИзДругойСделки(Команда)
	
	Массив = Новый Массив;
	
	Массив.Добавить(Тип("ДокументСсылка.Сделка"));
	
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияСделки", ЭтотОбъект);
	
	ПоказатьВводЗначения(Оповещение, Неопределено, "Введите значение", ОписаниеТипов); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияСделки(ВыбЗнач, Параметры) Экспорт
	
	Если ВыбЗнач <> Неопределено Тогда
		
		ЗаполнитьРасходыКлиентаКопированиемИзСделки(ВыбЗнач);
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасходыКлиентаКопированиемИзСделки(Сделка)
	
	Для Каждого Стр Из Сделка.РасходыКлиента Цикл 
		
		СтрТЧ = Объект.РасходыКлиента.Добавить(); 
		
		СтрТЧ.Номенклатура = Стр.Номенклатура;
		СтрТЧ.Содержание = ПолучитьСодержаниеУслугиПоВсемКонтейнерам(Стр.Номенклатура);
		СтрТЧ.Количество = Стр.Количество;
		СтрТЧ.Цена = Стр.Цена;
		СтрТЧ.Сумма = Стр.Сумма;
		СтрТЧ.Контейнеры = "Все";
		СтрТЧ.ЦенаUSD = Стр.ЦенаUSD;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПапкеОткрытие(Элемент, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ФайловаяСистемаКлиент.ОткрытьПроводник(Объект.ПутьКПапке);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПутьКПапке(Команда)
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	
	ДиалогОткрытия.Каталог = Объект.ПутьКПапке; 
	
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	
	Если ДиалогОткрытия.Выбрать() Тогда 
		
		Объект.ПутьКПапке = ДиалогОткрытия.Каталог; 
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		
		ЗаполнитьМенеджераПоДоговору();
		
	Иначе
		
		Объект.Менеджер = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьМенеджераПоДоговору()
	
	Объект.Менеджер = Объект.ДоговорКонтрагента.Менеджер;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ЗаполнитьДоговорИМенеджераПоКонтрагенту();  
		
	Иначе
		
		Объект.Контрагент = Неопределено;
		Объект.Менеджер = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДоговорИМенеджераПоКонтрагенту()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И ДоговорыКонтрагентов.Владелец = &Контрагент";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Объект.ДоговорКонтрагента = Выборка.Ссылка;
		
		Объект.Менеджер = Выборка.Ссылка.Менеджер;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ВходящиеСчетаПоступлениеУслуг" Тогда	
		
		Если ЗначениеЗаполнено(Элементы.ВходящиеСчета.ТекущиеДанные.ПоступлениеУслуг) Тогда
			
			//			ВидДокумента = ПолучитьВидДокументаПоступления(Элементы.ВходящиеСчета.ТекущиеДанные.ПоступлениеУслуг);
			
			//Если ВидДокумента = "Услуги" Тогда
			
			ПараметрыФормы = Новый Структура("Ключ", Элементы.ВходящиеСчета.ТекущиеДанные.ПоступлениеУслуг);
			ОткрытьФорму("Документ.СчетНаОплатуПоставщика.ФормаОбъекта", ПараметрыФормы); 
			
			//ИначеЕсли ВидДокумента = "Товары" Тогда
			//	
			//	ПараметрыФормы = Новый Структура("Ключ", Элементы.ВходящиеСчета.ТекущиеДанные.ПоступлениеУслуг);
			//	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаТовары", ПараметрыФормы);
			//	
			//ИначеЕсли ВидДокумента = "Общая" Тогда
			//	
			//	ПараметрыФормы = Новый Структура("Ключ", Элементы.ВходящиеСчета.ТекущиеДанные.ПоступлениеУслуг);
			//	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаОбщая", ПараметрыФормы);
			//	
			//КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловиеПоставкиПриИзменении(Элемент)
	
	УстановкаВидимостиРеквизитов();	
	
КонецПроцедуры

&НаСервере
Процедура УстановкаВидимостиРеквизитов()
	
	Если Объект.УсловиеПоставки = Перечисления.УсловияПоставки.ЭкспедированиеНаСВХ Тогда
		
		Элементы.Линия.Доступность = Ложь;
		Элементы.ПортПрибытия.Доступность = Ложь;
		Элементы.Агент.Доступность = Ложь;
		Элементы.Судно.Доступность = Ложь;
		Элементы.ДатаВыходаИзПортаОтгрузки.Доступность = Ложь;
		Элементы.Демередж.Доступность = Ложь;
		Элементы.ПортОтгрузки.Доступность = Ложь;
		Элементы.РежимВывоза.Доступность = Ложь;
		Элементы.ПолученОригиналТелекс.Доступность = Ложь;
		Элементы.ДатаПрибытия.Доступность = Ложь;
		Элементы.КонтейнерыДатаВывозаИзПорта.Доступность = Ложь;
		Элементы.КонтейнерыДатаВыгрузкиУКлиента.Доступность = Ложь;
		Элементы.КонтейнерыДатаВыгрузкиСуднаДО.Доступность = Ложь;
		Элементы.КонтейнерыДатаСдачиПорожнегоКонтейнера.Доступность = Ложь;
		
	Иначе
		
		Элементы.Линия.Доступность = Истина;
		Элементы.ПортПрибытия.Доступность = Истина;
		Элементы.Агент.Доступность = Истина;
		Элементы.Судно.Доступность = Истина;
		Элементы.ДатаВыходаИзПортаОтгрузки.Доступность = Истина;
		Элементы.Демередж.Доступность = Истина; 
		Элементы.ПортОтгрузки.Доступность = Истина;
		Элементы.РежимВывоза.Доступность = Истина;
		Элементы.ПолученОригиналТелекс.Доступность = Истина;
		Элементы.ДатаПрибытия.Доступность = Истина;
		Элементы.КонтейнерыДатаВывозаИзПорта.Доступность = Истина;
		Элементы.КонтейнерыДатаВыгрузкиУКлиента.Доступность = Истина;
		Элементы.КонтейнерыДатаВыгрузкиСуднаДО.Доступность = Истина;
		Элементы.КонтейнерыДатаСдачиПорожнегоКонтейнера.Доступность = Истина;
		
	КонецЕсли;	
	
	
КонецПроцедуры 

&НаКлиенте
Процедура РасходыКлиентаЦенаUSDПриИзменении(Элемент)
	
	Элементы.РасходыКлиента.ТекущиеДанные.СуммаUSD = Элементы.РасходыКлиента.ТекущиеДанные.Количество * Элементы.РасходыКлиента.ТекущиеДанные.ЦенаUSD;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиентаСуммаUSDПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.РасходыКлиента.ТекущиеДанные.Количество) Тогда
		
		Элементы.РасходыКлиента.ТекущиеДанные.ЦенаUSD = Элементы.РасходыКлиента.ТекущиеДанные.СуммаUSD / Элементы.РасходыКлиента.ТекущиеДанные.Количество;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеРасходыПриИзменении(Элемент)
	
	//ПересчитатьИтогВходящиеРасходы();
	
КонецПроцедуры   

&НаКлиенте
Процедура ПересчитатьИтогВходящиеРасходы()
	
	//ИтогоВходящиеРасходыСумма = 0;
	//ИтогоВходящиеРасходыСуммаВВалюте = 0;
	//
	//ИтогоВходящиеРасходыСумма = ВходящиеРасходы.Итог("Сумма");
	//ИтогоВходящиеРасходыСуммаВВалюте = ВходящиеРасходы.Итог("СуммаВВалюте");
	
	//ПересчитатьИтогиФормы();
	
КонецПроцедуры // ПересчитатьИтог()

&НаКлиенте
Процедура ПересчитатьИтогиФормы()
	
	//ПересчитатьИтогДоходы();
	//ПересчитатьИтогРасходы();
	//ПересчитатьПрофит();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогДоходы()
	
	//ИтогоДоходы = Объект.РасходыКлиента.Итог("Сумма") + Объект.ВнутренниеДоходы.Итог("Сумма");            
	
КонецПроцедуры // ПересчитатьИтогДоходы() 

&НаКлиенте
Процедура ПересчитатьИтогРасходы()
	
	//ИтогоРасходы = Объект.ВнутренниеРасходы.Итог("Сумма") + ВходящиеРасходы.Итог("Сумма");
	
КонецПроцедуры // ПересчитатьИтогРасходы()

&НаКлиенте
Процедура ПересчитатьПрофит()
	
	//ИтогоПрофит = ИтогоДоходы - ИтогоРасходы;
	
КонецПроцедуры // ПересчитатьПрофит()

&НаКлиенте
Процедура ВходящиеСчетаПриИзменении(Элемент)
	
	//ПересчитатьИтогВходящиеСчета();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогВходящиеСчета()
	
	//ИтогоВходящиеСчетаСумма = 0;
	//ИтогоВходящиеСчетаСуммаВВалюте = 0;
	//
	//ИтогоВходящиеСчетаСумма = ВходящиеРасходы.Итог("Сумма");
	//ИтогоВходящиеСчетаСуммаВВалюте = ВходящиеРасходы.Итог("СуммаВВалюте");
	
КонецПроцедуры 

&НаКлиенте
Процедура РасходыКлиентаСтавкаНДСПриИзменении(Элемент)
	ДанныеСтроки = Элементы.РасходыКлиента.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтроке(ДанныеСтроки);
КонецПроцедуры 

&НаКлиенте
Процедура ПересчитатьСуммуНДСВСтроке(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
	СтрокаТабличнойЧасти.Сумма,
	Объект.СуммаВключаетНДС, 
	УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
	
	Если Объект.СуммаВключаетНДС Тогда
		
		СтрокаТабличнойЧасти.СуммаСНДС = СтрокаТабличнойЧасти.Сумма;
		
	Иначе
		
		СтрокаТабличнойЧасти.СуммаСНДС = СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.Сумма;
		
	КонецЕсли;	
	
	
КонецПроцедуры 

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	
	//Выставлено = Ложь;
	//
	//Для Каждого Стр Из Объект.РасходыКлиента Цикл
	//	
	//	Если Стр.Выставлено Тогда
	//		Выставлено = Истина;
	//		Прервать;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	
	Для Каждого Стр Из Объект.РасходыКлиента Цикл 
		
		Если НЕ Стр.Выставлено Тогда
			
			ПересчитатьСуммуНДСВСтроке(Стр);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаличиеСчета(Счет)
	
	Возврат Счет <> Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
	
КонецФункции // ()

&НаКлиенте
Процедура РасходыКлиентаПередУдалением(Элемент, Отказ)
	
	Если Элемент.ВыделенныеСтроки.Количество() = 1  Тогда
		
		Отказ = ПолучитьНаличиеСчета(Элемент.ТекущиеДанные.СчетНаОплату);
		
		Если Отказ = Истина Тогда
			ПоказатьПредупреждение(,"В данной позиции есть выставленные счета покупателю." + Символы.ПС +  "Для удаления необходимо удалить счет покупателю",,"ОШИБКА");
		КонецЕсли;
		
	Иначе
		
		ПоказатьПредупреждение(,"Удаленое возможно только по одной строке",,"ОШИБКА");
		Отказ = Истина;
		Возврат
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДокументов(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры





