#Область ПрограммныйИнтерфейс

Функция ТекстЗапросаИсходящиеСчета() Экспорт
	
	ТекстЗапроса = 	
	// Колупаев М.Б. 28.07.2026. ID 6870 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки
	|ПОМЕСТИТЬ Вт_ОтборВидСделки
	|ИЗ
	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки,
	|	ДанныеДляРасчетаПрофитаСделки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Вт_ОтборНоменклатура
	|ИЗ
	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента КАК Договор,
	|	МАКСИМУМ(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.КурсВзаиморасчетов) КАК КурсОплаты
	|ПОМЕСТИТЬ ВТ_КурсПоДоговору
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|		ПО ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка = ПоступлениеНаРасчетныйСчет.Ссылка
	|			И (ПоступлениеНаРасчетныйСчет.Проведен = ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
	|	СУММА(СчетНаОплатуПокупателюТовары.Сумма) КАК ОбщаяСуммаСчета
	|ПОМЕСТИТЬ Вт_ОбщаяСуммаСчета
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
	|	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетНаОплатуПокупателюТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.СчетНаОплату КАК Счет,
	|	СУММА(РасшифровкаПлатежа.СуммаПлатежа) КАК СуммаОплатыПоСчету
	|ПОМЕСТИТЬ Вт_СуммаОплатПоСчетам
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|ГДЕ
	|	РасшифровкаПлатежа.СчетНаОплату В
	|			(ВЫБРАТЬ
	|				СчетНаОплатуПокупателю.Ссылка
	|			ИЗ
	|				Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|			ГДЕ
	|				СчетНаОплатуПокупателю.Сделка = &Сделка
	|				И СчетНаОплатуПокупателю.Проведен)
	|	И РасшифровкаПлатежа.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РасшифровкаПлатежа.СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
	|	СчетНаОплатуПокупателюТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетНаОплатуПокупателюТовары.Ссылка.КурсВзаиморасчетов КАК КурсДокумента,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
	|	СчетНаОплатуПокупателюТовары.Ссылка.ДоговорКонтрагента КАК Договор,
	|	СУММА(ВЫБОР
	|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|						ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|								ТОГДА 0
	|							ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаБезНДССчета,
	|	СУММА(ВЫБОР
	|			КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|				ТОГДА СчетНаОплатуПокупателюТовары.СуммаНДС
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ СчетНаОплатуПокупателюТовары.СуммаНДС
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаНДССчета,
	|	СУММА(ВЫБОР
	|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|						ТОГДА СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|								ТОГДА 0
	|							ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаСНДССчета,
	|	Вт_СуммаОплатПоСчетам.СуммаОплатыПоСчету КАК СуммаОплатыПоСчету,
	|	Вт_ОбщаяСуммаСчета.ОбщаяСуммаСчета КАК ОбщаяСуммаСчета,
	|	ВТ_КурсПоДоговору.КурсОплаты КАК КурсОплаты
	|ПОМЕСТИТЬ ВТ_СчетаПокупателям
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
	|		ПО СчетНаОплатуПокупателюТовары.Ссылка.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
	|		ПО СчетНаОплатуПокупателюТовары.Ссылка.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
	|			И СчетНаОплатуПокупателюТовары.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_СуммаОплатПоСчетам КАК Вт_СуммаОплатПоСчетам
	|		ПО СчетНаОплатуПокупателюТовары.Ссылка = Вт_СуммаОплатПоСчетам.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОбщаяСуммаСчета КАК Вт_ОбщаяСуммаСчета
	|		ПО СчетНаОплатуПокупателюТовары.Ссылка = Вт_ОбщаяСуммаСчета.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсПоДоговору КАК ВТ_КурсПоДоговору
	|		ПО СчетНаОплатуПокупателюТовары.Ссылка.ДоговорКонтрагента = ВТ_КурсПоДоговору.Договор
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
	|	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетНаОплатуПокупателюТовары.Ссылка,
	|	СчетНаОплатуПокупателюТовары.Ссылка.ВалютаДокумента,
	|	СчетНаОплатуПокупателюТовары.Ссылка.КурсВзаиморасчетов,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка,
	|	СчетНаОплатуПокупателюТовары.Ссылка.ДоговорКонтрагента,
	|	Вт_СуммаОплатПоСчетам.СуммаОплатыПоСчету,
	|	Вт_ОбщаяСуммаСчета.ОбщаяСуммаСчета,
	|	ВТ_КурсПоДоговору.КурсОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Акт КАК Акт,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.СуммаБезНДСАкта
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
	|		КОНЕЦ) КАК СуммаБезНДСАкта,
	|	ВложенныйЗапрос.Сделка КАК Сделка,
	|	ВложенныйЗапрос.Счет КАК Счет,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.СуммаНДСАкта
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
	|		КОНЕЦ) КАК СуммаНДСАкта,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.СуммаСНДСАкта
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
	|		КОНЕЦ) КАК СуммаСНДСАкта,
	|	ВложенныйЗапрос.ВалютаДокумента КАК ВалютаДокумента,
	|	ВложенныйЗапрос.КурсДокумента КАК КурсДокумента
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.Ссылка КАК Акт,
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|				ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|			КОНЕЦ) КАК СуммаБезНДСАкта,
	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
	|		СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугТовары.Сумма
	|				ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	|			КОНЕЦ) КАК СуммаСНДСАкта,
	|		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|		ИСТИНА КАК ОтборПоВидуСделки,
	|		РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|		РеализацияТоваровУслугТовары.Ссылка.КурсВзаиморасчетов КАК КурсДокумента
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|		И РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслугТовары.Ссылка,
	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		РеализацияТоваровУслугТовары.Номенклатура,
	|		РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента,
	|		РеализацияТоваровУслугТовары.Ссылка.КурсВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугУслуги.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	|				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|			КОНЕЦ),
	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|			КОНЕЦ),
	|		РеализацияТоваровУслугУслуги.Номенклатура,
	|		ИСТИНА,
	|		РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента,
	|		РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|	ГДЕ
	|		РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	|		И РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслугУслуги.Ссылка,
	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		РеализацияТоваровУслугУслуги.Номенклатура,
	|		РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента,
	|		РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	|				ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	|			КОНЕЦ),
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
	|				ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	|			КОНЕЦ),
	|		РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	|		ИСТИНА,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ВалютаДокумента,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.КурсВзаиморасчетов
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	|	ГДЕ
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	|		И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ВалютаДокумента,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.КурсВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СделкаВнутренниеДоходы.НаименованиеДохода,
	|		СУММА(СделкаВнутренниеДоходы.Сумма),
	|		СделкаВнутренниеДоходы.Ссылка,
	|		СделкаВнутренниеДоходы.Ссылка,
	|		0,
	|		СУММА(СделкаВнутренниеДоходы.Сумма),
	|		NULL,
	|		ЛОЖЬ,
	|		NULL,
	|		NULL
	|	ИЗ
	|		Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	|	ГДЕ
	|		СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	|		И СделкаВнутренниеДоходы.Ссылка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СделкаВнутренниеДоходы.НаименованиеДохода,
	|		СделкаВнутренниеДоходы.Сумма,
	|		СделкаВнутренниеДоходы.Ссылка,
	|		СделкаВнутренниеДоходы.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтчетКомитентуОПродажахТовары.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	|				ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	|			КОНЕЦ),
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
	|		СУММА(ВЫБОР
	|				КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
	|				ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
	|			КОНЕЦ),
	|		ОтчетКомитентуОПродажахТовары.Номенклатура,
	|		ИСТИНА,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ВалютаДокумента,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.КурсВзаиморасчетов
	|	ИЗ
	|		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|	ГДЕ
	|		ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	|		И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	|		ОтчетКомитентуОПродажахТовары.Ссылка,
	|		ОтчетКомитентуОПродажахТовары.Номенклатура,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ВалютаДокумента,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.КурсВзаиморасчетов) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
	|			И ВложенныйЗапрос.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Акт,
	|	ВложенныйЗапрос.Сделка,
	|	ВложенныйЗапрос.Счет,
	|	ВложенныйЗапрос.ВалютаДокумента,
	|	ВложенныйЗапрос.КурсДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хозрасчетный.Регистратор КАК Акт,
	|	ВЫБОР
	|		КОГДА СУММА(Хозрасчетный.ВалютнаяСуммаДт) = 0
	|			ТОГДА NULL
	|		ИНАЧЕ СУММА(Хозрасчетный.Сумма) / СУММА(Хозрасчетный.ВалютнаяСуммаДт)
	|	КОНЕЦ КАК КурсАкта
	|ПОМЕСТИТЬ ВТ_КурсПоАктам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор В
	|			(ВЫБРАТЬ
	|				ВТ_Реализации.Акт
	|			ИЗ
	|				ВТ_Реализации КАК ВТ_Реализации)
	|	И Хозрасчетный.Активность
	|	И Хозрасчетный.СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|	И НЕ Хозрасчетный.СчетКт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|	И Хозрасчетный.ВалютнаяСуммаДт <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Хозрасчетный.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Счет КАК Счет,
	|	Данные.Сделка КАК Сделка,
	|	Данные.Акт КАК Акт,
	|	СУММА(Данные.СуммаБезНДСАкта * Данные.КурсАкта) КАК СуммаБезНДСАкта_Руб,
	|	СУММА(Данные.СуммаНДСАкта * Данные.КурсАкта) КАК СуммаНДСАкта_Руб,
	|	СУММА(Данные.СуммаСНДСАкта * Данные.КурсАкта) КАК СуммаСНДСАкта_Руб,
	|	СУММА(Данные.СуммаБезНДССчета * Данные.КурсСчета) КАК СуммаБезНДССчета_Руб,
	|	СУММА(Данные.СуммаНДССчета * Данные.КурсСчета) КАК СуммаНДССчета_Руб,
	|	СУММА(Данные.СуммаСНДССчета * Данные.КурсСчета) КАК СуммаСНДССчета_Руб
	|ПОМЕСТИТЬ ВТ_Исходящие
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет) КАК Счет,
	|		ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка) КАК Сделка,
	|		ВТ_Реализации.Акт КАК Акт,
	|		ЕСТЬNULL(ВТ_Реализации.СуммаБезНДСАкта, 0) КАК СуммаБезНДСАкта,
	|		ЕСТЬNULL(ВТ_Реализации.СуммаНДСАкта, 0) КАК СуммаНДСАкта,
	|		ЕСТЬNULL(ВТ_Реализации.СуммаСНДСАкта, 0) КАК СуммаСНДСАкта,
	|		ЕСТЬNULL(ВТ_СчетаПокупателям.СуммаБезНДССчета, 0) КАК СуммаБезНДССчета,
	|		ЕСТЬNULL(ВТ_СчетаПокупателям.СуммаНДССчета, 0) КАК СуммаНДССчета,
	|		ЕСТЬNULL(ВТ_СчетаПокупателям.СуммаСНДССчета, 0) КАК СуммаСНДССчета,
	|		ВЫБОР
	|			КОГДА ВТ_Реализации.ВалютаДокумента ЕСТЬ NULL
	|				ТОГДА 1
	|			КОГДА ВТ_Реализации.ВалютаДокумента.Наименование = ""руб.""
	|				ТОГДА 1
	|			ИНАЧЕ ЕСТЬNULL(ВТ_КурсПоАктам.КурсАкта, ЕСТЬNULL(ВТ_Реализации.КурсДокумента, 1))
	|		КОНЕЦ КАК КурсАкта,
	|		ВЫБОР
	|			КОГДА ВТ_СчетаПокупателям.ВалютаДокумента ЕСТЬ NULL
	|				ТОГДА 1
	|			КОГДА ВТ_СчетаПокупателям.ВалютаДокумента.Наименование = ""руб.""
	|				ТОГДА 1
	|			ИНАЧЕ ЕСТЬNULL(ВТ_КурсПоАктам.КурсАкта, ЕСТЬNULL(ВТ_СчетаПокупателям.КурсДокумента, 1))
	|		КОНЕЦ КАК КурсСчета
	|	ИЗ
	|		ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
	|			ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|			ПО ВТ_СчетаПокупателям.Счет = ВТ_Реализации.Счет
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсПоАктам КАК ВТ_КурсПоАктам
	|			ПО (ВТ_Реализации.Акт = ВТ_КурсПоАктам.Акт)) КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Счет,
	|	Данные.Сделка,
	|	Данные.Акт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Исходящие.Счет КАК Счет,
	|	ВТ_Исходящие.Акт КАК Ссылка,
	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта_Руб, 0)) КАК СуммаБезНДСАкта,
	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДСАкта_Руб, 0)) КАК СуммаНДСАкта,
	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта_Руб, 0)) КАК СуммаСНДСАкта,
	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДССчета_Руб, 0)) КАК СуммаБезНДССчета,
	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДССчета_Руб, 0)) КАК СуммаНДССчета,
	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДССчета_Руб, 0)) КАК СуммаСНДССчета,
	|	СтатусыДокументов.Статус КАК Статус,
	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО,
	|	ВТ_Исходящие.Сделка.Вид.Ссылка КАК СделкаВидСсылка,
	|	ВТ_Исходящие.Акт.Представление КАК Представление
	|ИЗ
	|	ВТ_Исходящие КАК ВТ_Исходящие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|		ПО ВТ_Исходящие.Счет = СтатусыДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
	|		ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВТ_Исходящие.Акт.Ссылка)
	|ГДЕ
	|	(СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО ЕСТЬ NULL
	|			ИЛИ СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Исходящие.Счет,
	|	ВТ_Исходящие.Акт,
	|	СтатусыДокументов.Статус,
	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО,
	|	ВТ_Исходящие.Сделка.Вид.Ссылка,
	|	ВТ_Исходящие.Акт.Представление
	|
	|УПОРЯДОЧИТЬ ПО
	|	Счет";       
	
	Возврат ТекстЗапроса;	
	
КонецФункции   

Функция ТекстЗапросаВходящиеСчета() Экспорт
	
	ТекстЗапроса =  	 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки
	|ПОМЕСТИТЬ Вт_ОтборВидСделки
	|ИЗ
	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки,
	|	ДанныеДляРасчетаПрофитаСделки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Вт_ОтборНоменклатура
	|ИЗ
	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Счет,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК Сделка,
	|	СУММА(ВЫБОР
	|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|						ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|								ТОГДА 0
	|							ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ * СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов) КАК СуммаБезНДССчета,
	|	СУММА(ВЫБОР
	|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|						ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|								ТОГДА 0
	|							ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ * СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов) КАК СуммаНДССчета,
	|	СУММА(ВЫБОР
	|			КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|				ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения
	|				КОНЕЦ
	|		КОНЕЦ * СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов) КАК СуммаСНДССчета,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка.Вид КАК СделкаВид
	|ПОМЕСТИТЬ ВТ_СчетаПоставщиков
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
	|			ПО СчетНаОплатуПоставщикаТовары.Ссылка.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
	|			ПО СчетНаОплатуПоставщикаТовары.Ссылка.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
	|				И СчетНаОплатуПоставщикаТовары.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
	|		ПО СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения
	|			И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка
	|ГДЕ
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	|	И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка.Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Акт КАК Акт,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.СуммаБезНДСАкта
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
	|		КОНЕЦ) КАК СуммаБезНДСАкта,
	|	ВложенныйЗапрос.Счет КАК Счет,
	|	ВложенныйЗапрос.Сделка КАК Сделка,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.СуммаНДСАкта
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
	|		КОНЕЦ) КАК СуммаНДСАкта,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.СуммаСНДСАкта
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
	|		КОНЕЦ) КАК СуммаСНДСАкта
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Акт,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.ВалютаДокумента.Наименование = ""руб.""
	|					ТОГДА ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	|							ТОГДА (ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)) * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов
	|						ИНАЧЕ (ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))) * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов
	|					КОНЕЦ
	|			КОНЕЦ) КАК СуммаБезНДСАкта,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика КАК Счет,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.ВалютаДокумента.Наименование = ""руб.""
	|					ТОГДА ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	|								ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|							ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	|							ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма) * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов
	|						ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС)) * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов
	|					КОНЕЦ
	|			КОНЕЦ) КАК СуммаНДСАкта,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.ВалютаДокумента.Наименование = ""руб.""
	|					ТОГДА ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	|			КОНЕЦ) КАК СуммаСНДСАкта,
	|		ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|		ИСТИНА КАК ОтборПоВидуСделки
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	|				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	|	ГДЕ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	|		И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугУслуги.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СделкаВнутренниеРасходы.НаименованиеРасхода,
	|		СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	|		NULL,
	|		СделкаВнутренниеРасходы.Ссылка,
	|		0,
	|		СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	|		NULL,
	|		ЛОЖЬ
	|	ИЗ
	|		Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	|	ГДЕ
	|		СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	|		И СделкаВнутренниеРасходы.Ссылка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СделкаВнутренниеРасходы.НаименованиеРасхода,
	|		СделкаВнутренниеРасходы.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|				ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ПоступлениеТоваровУслугТовары.Номенклатура,
	|		ИСТИНА
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	|				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	|	ГДЕ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	|		И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугТовары.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|				ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	|					КОНЕЦ
	|			КОНЕЦ),
	|		ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура,
	|		ИСТИНА
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	|				И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	|	ГДЕ
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	|		И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	|		ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОперацияБух.Ссылка,
	|		ХозрасчетныйДвиженияССубконто.Сумма,
	|		NULL,
	|		ОперацияБух.Сделка.Ссылка,
	|		ХозрасчетныйДвиженияССубконто.Сумма,
	|		ХозрасчетныйДвиженияССубконто.Сумма,
	|		NULL,
	|		ИСТИНА
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК ХозрасчетныйДвиженияССубконто
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияБух КАК ОперацияБух
	|			ПО ХозрасчетныйДвиженияССубконто.Регистратор = ОперацияБух.Ссылка
	|	ГДЕ
	|		ОперацияБух.Сделка = &Сделка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
	|			И ВложенныйЗапрос.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Акт,
	|	ВложенныйЗапрос.Счет,
	|	ВложенныйЗапрос.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаПоставщиков.Счет КАК Счет,
	|	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка) КАК Сделка,
	|	ВТ_Поступления.Акт КАК Акт,
	|	СУММА(ВТ_Поступления.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	|	СУММА(ВТ_Поступления.СуммаНДСАкта) КАК СуммаНДСАкта,
	|	СУММА(ВТ_Поступления.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	|	СУММА(ВТ_СчетаПоставщиков.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	|	СУММА(ВТ_СчетаПоставщиков.СуммаНДССчета) КАК СуммаНДССчета,
	|	СУММА(ВТ_СчетаПоставщиков.СуммаСНДССчета) КАК СуммаСНДССчета
	|ПОМЕСТИТЬ ВТ_Входящие
	|ИЗ
	|	ВТ_Поступления КАК ВТ_Поступления
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
	|		ПО ВТ_Поступления.Счет = ВТ_СчетаПоставщиков.Счет
	|			И ВТ_Поступления.Сделка = ВТ_СчетаПоставщиков.Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СчетаПоставщиков.Счет,
	|	ВТ_Поступления.Акт,
	|	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Входящие.Счет КАК Счет,
	//|	ВТ_Входящие.Акт КАК Ссылка,
	//|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	//|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	//|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	//|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	//|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	//|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
	//|	СтатусыДокументов.Статус КАК Статус,
	//|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО,
	//|	ВТ_Входящие.Сделка.Вид.Ссылка КАК СделкаВидСсылка,
	//|	ВТ_Входящие.Акт.Представление КАК Представление
	//|ИЗ
	//|	ВТ_Входящие КАК ВТ_Входящие
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	//|		ПО ВТ_Входящие.Счет = СтатусыДокументов.Документ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
	//|		ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВТ_Входящие.Акт.Ссылка)
	//|ГДЕ
	//|	(СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО ЕСТЬ NULL
	//|			ИЛИ СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Входящие.Счет,
	//|	ВТ_Входящие.Акт,
	//|	СтатусыДокументов.Статус,
	//|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО,
	//|	ВТ_Входящие.Сделка.Вид.Ссылка,
	//|	ВТ_Входящие.Акт.Представление"; 
	
	// Колупаев М.Б. 17.08.2026. ID: 7912
	
	|	ВЫБРАТЬ
	|    ВТ_Входящие.Счет КАК Счет,
	|    ВТ_Входящие.Акт КАК Ссылка,
	|    СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	|    СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	|    СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	|    СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	|    СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	|    СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
	|    СтатусыДокументов.Статус КАК Статус,
	|    СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО,
	|    ВТ_Входящие.Сделка.Вид.Ссылка КАК СделкаВидСсылка,
	|    ВТ_Входящие.Акт.Представление КАК Представление
	|ИЗ
	|    ВТ_Входящие КАК ВТ_Входящие
	|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|        ПО ВТ_Входящие.Счет = СтатусыДокументов.Документ
	|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
	|        ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВТ_Входящие.Акт.Ссылка)
	|            И (СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован))
	|СГРУППИРОВАТЬ ПО
	|    ВТ_Входящие.Счет,
	|    ВТ_Входящие.Акт,
	|    СтатусыДокументов.Статус,
	|    СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО,
	|    ВТ_Входящие.Сделка.Вид.Ссылка,
	|    ВТ_Входящие.Акт.Представление";
	
	Возврат ТекстЗапроса;	
	
КонецФункции

Процедура ПолучитьНДСИсходящие(СтруктураНДСИсходящие,Сделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки
	|ПОМЕСТИТЬ Вт_ОтборВидСделки
	|ИЗ
	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки,
	|	ДанныеДляРасчетаПрофитаСделки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Вт_ОтборНоменклатура
	|ИЗ
	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
	|	СУММА(ВЫБОР
	|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|						ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|								ТОГДА 0
	|							ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаБезНДССчета,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
	|	СУММА(ВЫБОР
	|			КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|				ТОГДА СчетНаОплатуПокупателюТовары.СуммаНДС
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ СчетНаОплатуПокупателюТовары.СуммаНДС
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаНДССчета,
	|	СУММА(ВЫБОР
	|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|						ТОГДА СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|								ТОГДА 0
	|							ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаСНДССчета,
	|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_СчетаПокупателям
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
	|		ПО СчетНаОплатуПокупателюТовары.Ссылка.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
	|		ПО СчетНаОплатуПокупателюТовары.Ссылка.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
	|			И СчетНаОплатуПокупателюТовары.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
	|	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетНаОплатуПокупателюТовары.Ссылка,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка,
	|	СчетНаОплатуПокупателюТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Акт КАК Акт,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.СуммаБезНДСАкта
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
	|		КОНЕЦ) КАК СуммаБезНДСАкта,
	|	ВложенныйЗапрос.Сделка КАК Сделка,
	|	ВложенныйЗапрос.Счет КАК Счет,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.СуммаНДСАкта
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
	|		КОНЕЦ) КАК СуммаНДСАкта,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.СуммаСНДСАкта
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
	|									ТОГДА 0
	|								ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
	|		КОНЕЦ) КАК СуммаСНДСАкта,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.Ссылка КАК Акт,
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|				ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|			КОНЕЦ) КАК СуммаБезНДСАкта,
	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
	|		СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугТовары.Сумма
	|				ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	|			КОНЕЦ) КАК СуммаСНДСАкта,
	|		СУММА(РеализацияТоваровУслугТовары.Сумма) КАК СуммаАкта,
	|		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|		СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	|		ИСТИНА КАК ОтборПоВидуСделки
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|		И РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслугТовары.Ссылка,
	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		РеализацияТоваровУслугТовары.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугУслуги.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	|				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|			КОНЕЦ),
	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|			КОНЕЦ),
	|		СУММА(РеализацияТоваровУслугУслуги.Сумма),
	|		РеализацияТоваровУслугУслуги.Номенклатура,
	|		СУММА(РеализацияТоваровУслугУслуги.Количество),
	|		ИСТИНА
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|	ГДЕ
	|		РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	|		И РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслугУслуги.Ссылка,
	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		РеализацияТоваровУслугУслуги.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	|				ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	|			КОНЕЦ),
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
	|		СУММА(ВЫБОР
	|				КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
	|				ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	|			КОНЕЦ),
	|		СУММА(РеализацияТоваровУслугАгентскиеУслуги.Сумма),
	|		РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	|		СУММА(РеализацияТоваровУслугАгентскиеУслуги.Количество),
	|		ИСТИНА
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	|	ГДЕ
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	|		И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	|		РеализацияТоваровУслугАгентскиеУслуги.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СделкаВнутренниеДоходы.НаименованиеДохода,
	|		СУММА(СделкаВнутренниеДоходы.Сумма),
	|		СделкаВнутренниеДоходы.Ссылка,
	|		СделкаВнутренниеДоходы.Ссылка,
	|		0,
	|		СУММА(СделкаВнутренниеДоходы.Сумма),
	|		СУММА(СделкаВнутренниеДоходы.Сумма),
	|		NULL,
	|		NULL,
	|		ЛОЖЬ
	|	ИЗ
	|		Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	|	ГДЕ
	|		СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	|		И СделкаВнутренниеДоходы.Ссылка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СделкаВнутренниеДоходы.НаименованиеДохода,
	|		СделкаВнутренниеДоходы.Ссылка,
	|		СделкаВнутренниеДоходы.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтчетКомитентуОПродажахТовары.Ссылка,
	|		СУММА(ВЫБОР
	|				КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	|				ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	|			КОНЕЦ),
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
	|		СУММА(ВЫБОР
	|				КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|					ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
	|				ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
	|			КОНЕЦ),
	|		СУММА(ОтчетКомитентуОПродажахТовары.Сумма),
	|		ОтчетКомитентуОПродажахТовары.Номенклатура,
	|		СУММА(ОтчетКомитентуОПродажахТовары.Количество),
	|		ИСТИНА
	|	ИЗ
	|		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|	ГДЕ
	|		ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	|		И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка = &Сделка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	|		ОтчетКомитентуОПродажахТовары.Ссылка,
	|		ОтчетКомитентуОПродажахТовары.Номенклатура) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
	|			И ВложенныйЗапрос.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|		ПО ВложенныйЗапрос.Счет = СтатусыДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
	|		ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВложенныйЗапрос.Акт.Ссылка)
	|ГДЕ
	|	(СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО ЕСТЬ NULL
	|			ИЛИ СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Акт,
	|	ВложенныйЗапрос.Сделка,
	|	ВложенныйЗапрос.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаПокупателям.Счет КАК Счет,
	|	ВТ_СчетаПокупателям.Сделка КАК Сделка,
	|	ВТ_СчетаПокупателям.Номенклатура КАК Номенклатура,
	|	ВТ_СчетаПокупателям.СуммаБезНДССчета КАК СуммаБезНДССчета,
	|	ВЫБОР
	|		КОГДА ВидыРасходовСделки.Перевыставляемый ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_СчетаПокупателям.СуммаНДССчета
	|	КОНЕЦ КАК СуммаНДССчета,
	|	ВТ_СчетаПокупателям.СуммаСНДССчета КАК СуммаСНДССчета,
	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
	|ПОМЕСТИТЬ ВТ_СчетаПокупателямПеревыставляемый
	|ИЗ
	|	ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	|		ПО (ВидыРасходовСделки.Номенклатура = ВТ_СчетаПокупателям.Номенклатура)
	|			И (ВидыРасходовСделки.ВидСделки = ВТ_СчетаПокупателям.Сделка.Вид)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Акт КАК Акт,
	|	ВТ_Реализации.Сделка КАК Сделка,
	|	ВТ_Реализации.Счет КАК Счет,
	|	ВТ_Реализации.Номенклатура КАК Номенклатура,
	|	ВТ_Реализации.СуммаБезНДСАкта КАК СуммаБезНДСАкта,
	|	ВЫБОР
	|		КОГДА ВидыРасходовСделки.Перевыставляемый ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Реализации.СуммаНДСАкта
	|	КОНЕЦ КАК СуммаНДСАкта,
	|	ВТ_Реализации.СуммаСНДСАкта КАК СуммаСНДСАкта,
	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
	|ПОМЕСТИТЬ ВТ_АктыПеревыставляемый
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	|		ПО ВТ_Реализации.Номенклатура = ВидыРасходовСделки.Номенклатура
	|			И ВТ_Реализации.Сделка.Вид = ВидыРасходовСделки.ВидСделки";   
	
	Запрос.УстановитьПараметр("Сделка", Сделка);
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТЗ_СчетаИсходящие = Результат[4].Выгрузить();
	ТЗ_АктыИсходящие =  Результат[5].Выгрузить();   
	
	Если ТЗ_СчетаИсходящие.Количество() > 0 Тогда
		
		Для каждого стрТЗ_СчетаИсходящие из ТЗ_СчетаИсходящие Цикл  
			
			Если стрТЗ_СчетаИсходящие.Перевыставляемый Тогда
				
				СтруктураНДСИсходящие.СчетИсходящийПеревыставляемыйНДС = СтруктураНДСИсходящие.СчетИсходящийПеревыставляемыйНДС + стрТЗ_СчетаИсходящие.СуммаНДССчета;
				
			Иначе
				
				СтруктураНДСИсходящие.СчетИсходящийНеПеревыставляемыйНДС = СтруктураНДСИсходящие.СчетИсходящийНеПеревыставляемыйНДС + стрТЗ_СчетаИсходящие.СуммаНДССчета;	
				
			КонецЕсли; 
			
			СтруктураНДСИсходящие.СчетИсходящийВсегоНДС   = СтруктураНДСИсходящие.СчетИсходящийВсегоНДС + стрТЗ_СчетаИсходящие.СуммаНДССчета;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	Если ТЗ_АктыИсходящие.Количество() > 0 Тогда
		
		Для каждого стрТЗ_АктыИсходящие из ТЗ_АктыИсходящие Цикл
			
			Если  стрТЗ_АктыИсходящие.Перевыставляемый Тогда
				
				СтруктураНДСИсходящие.АктИсходящийПеревыставляемыйНДС = СтруктураНДСИсходящие.АктИсходящийПеревыставляемыйНДС + стрТЗ_АктыИсходящие.СуммаНДСАкта;
				
			Иначе	
				
				СтруктураНДСИсходящие.АктИсходящийНеПеревыставляемыйНДС = СтруктураНДСИсходящие.АктИсходящийНеПеревыставляемыйНДС + стрТЗ_АктыИсходящие.СуммаНДСАкта;
				
			КонецЕсли; 
			
			СтруктураНДСИсходящие.АктИсходящийВсегоНДС = СтруктураНДСИсходящие.АктИсходящийВсегоНДС + стрТЗ_АктыИсходящие.СуммаНДСАкта;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПолучитьНДСВходящиеПеревыставляемые(АктыВходящие,СчетаВходящие,СуммаНДСИтогоВходящиеАктыПеревыставляемый,СуммаНДСИтогоВходящиеСчетаПеревыставляемый,СтруктураНДСВходящие) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Счет,
	|	СУММА(ВЫБОР
	|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	|			ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	|		КОНЕЦ) КАК СуммаБезНДССчета,
	|	СУММА(ВЫБОР
	|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	|			ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	|		КОНЕЦ) КАК СуммаНДССчета,
	|	СчетНаОплатуПоставщикаТовары.Номенклатура КАК Номенклатура,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_СчетаПоставщиков
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	|		ПО СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения
	|			И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка
	|ГДЕ
	|	СчетНаОплатуПоставщикаТовары.Ссылка В(&СчетаВходящие)
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка,
	|	СчетНаОплатуПоставщикаТовары.Номенклатура,
	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Акт,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаБезНДСАкта,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	|			ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	|		КОНЕЦ) КАК СуммаНДСАкта,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаСНДСАкта,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	|			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка В(&АктыВходящие)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	|			ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ),
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	|			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В(&АктыВходящие)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	|			ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ВЫБОР
	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ),
	|	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	|		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	|			И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	|ГДЕ
	|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка В(&АктыВходящие)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	|	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура,
	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаПоставщиков.Счет КАК Счет,
	|	ВТ_СчетаПоставщиков.СуммаБезНДССчета КАК СуммаБезНДССчета,
	|	ВТ_СчетаПоставщиков.СуммаНДССчета КАК СуммаНДССчета,
	|	ВТ_СчетаПоставщиков.Номенклатура КАК Номенклатура,
	|	ВТ_СчетаПоставщиков.Сделка КАК Сделка,
	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
	|ПОМЕСТИТЬ ВТ_СчетаВходящиеНДСПеревыставляемый
	|ИЗ
	|	ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	|		ПО (ВидыРасходовСделки.Номенклатура = ВТ_СчетаПоставщиков.Номенклатура)
	|			И ВТ_СчетаПоставщиков.Сделка.Вид = ВидыРасходовСделки.ВидСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Поступления.Акт КАК Акт,
	|	ВТ_Поступления.СуммаБезНДСАкта КАК СуммаБезНДСАкта,
	|	ВТ_Поступления.СуммаНДСАкта КАК СуммаНДСАкта,
	|	ВТ_Поступления.СуммаСНДСАкта КАК СуммаСНДСАкта,
	|	ВТ_Поступления.Номенклатура КАК Номенклатура,
	|	ВТ_Поступления.Сделка КАК Сделка,
	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
	|ПОМЕСТИТЬ ВТ_АктыВходящиеНДСПеревыставляемый
	|ИЗ
	|	ВТ_Поступления КАК ВТ_Поступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	|		ПО ВТ_Поступления.Номенклатура = ВидыРасходовСделки.Номенклатура
	|			И (ВидыРасходовСделки.ВидСделки = ВТ_Поступления.Сделка.Вид)";  
	
	Запрос.УстановитьПараметр("СчетаВходящие",СчетаВходящие);
	Запрос.УстановитьПараметр("АктыВходящие",АктыВходящие);
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТЗ_СчетаВходящие = Результат[2].Выгрузить();
	ТЗ_АктыВходящие =  Результат[3].Выгрузить();
	
	Если ТЗ_СчетаВходящие.Количество() > 0 Тогда
		
		Для каждого стрТЗ_СчетаВходящие из ТЗ_СчетаВходящие Цикл  
			
			Если стрТЗ_СчетаВходящие.Перевыставляемый Тогда
				
				СуммаНДСИтогоВходящиеСчетаПеревыставляемый = СуммаНДСИтогоВходящиеСчетаПеревыставляемый + стрТЗ_СчетаВходящие.СуммаНДССчета; 
				
				СтруктураНДСВходящие.СчетВходящийПеревыставляемыйНДС = СтруктураНДСВходящие.СчетВходящийПеревыставляемыйНДС + стрТЗ_СчетаВходящие.СуммаНДССчета;
				
			Иначе
				
				СтруктураНДСВходящие.СчетВходящийНеПеревыставляемыйНДС = СтруктураНДСВходящие.СчетВходящийНеПеревыставляемыйНДС + стрТЗ_СчетаВходящие.СуммаНДССчета;
				
			КонецЕсли; 
			
			СтруктураНДСВходящие.СчетВходящийВсегоНДС = СтруктураНДСВходящие.СчетВходящийВсегоНДС + стрТЗ_СчетаВходящие.СуммаНДССчета; 
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	
	Если ТЗ_АктыВходящие.Количество() > 0 Тогда 
		
		Для каждого стрТЗ_АктыВходящие из ТЗ_АктыВходящие Цикл
			
			Если стрТЗ_АктыВходящие.Перевыставляемый Тогда
				
				СуммаНДСИтогоВходящиеАктыПеревыставляемый = СуммаНДСИтогоВходящиеАктыПеревыставляемый + стрТЗ_АктыВходящие.СуммаНДСАкта; 
				
				СтруктураНДСВходящие.АктВходящийПеревыставляемыйНДС = СтруктураНДСВходящие.АктВходящийПеревыставляемыйНДС + стрТЗ_АктыВходящие.СуммаНДСАкта;
				
			Иначе
				
				СтруктураНДСВходящие.АктВходящийНеПеревыставляемыйНДС = СтруктураНДСВходящие.АктВходящийНеПеревыставляемыйНДС + стрТЗ_АктыВходящие.СуммаНДСАкта;
				
			КонецЕсли; 
			
			СтруктураНДСВходящие.АктВходящийВсегоНДС	= СтруктураНДСВходящие.АктВходящийВсегоНДС + стрТЗ_АктыВходящие.СуммаНДСАкта;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти