
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючСвязи = Параметры.КлючСвязи;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда) 
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда) 
	
	ТекстовоеПредставление = "";
	МассивДобавляемыхСтрокИнформацияОПеревозчике = Новый Массив;
	
	Для Каждого Стр Из ЭтотОбъект.ИнформацияОПеревозчике Цикл
		
		Если ТекстовоеПредставление = "" Тогда
			
			ТекстовоеПредставление = Строка(Стр.Перевозчик) + " - " + Формат(Стр.СтавкаКлиенту,"ЧДЦ=2; ЧГ=") + " - " + Строка(Стр.Направление) + " - " + Формат(Стр.СтавкаАвтоперевозки,"ЧДЦ=2; ЧГ=");	
			
		Иначе
			
			ТекстовоеПредставление = ТекстовоеПредставление + Символы.ПС + Строка(Стр.Перевозчик) + " - " + Формат(Стр.СтавкаКлиенту,"ЧДЦ=2; ЧГ=") + " - " + Строка(Стр.Направление) + " - " + Формат(Стр.СтавкаАвтоперевозки,"ЧДЦ=2; ЧГ=");
			
		КонецЕсли; 
		
		СтруктураДобавляемыхСтрокИнформацияОПеревозчике = Новый Структура;
		СтруктураДобавляемыхСтрокИнформацияОПеревозчике.Вставить("Перевозчик", Стр.Перевозчик);
		СтруктураДобавляемыхСтрокИнформацияОПеревозчике.Вставить("СтавкаАвтоперевозки", Стр.СтавкаАвтоперевозки);
		СтруктураДобавляемыхСтрокИнформацияОПеревозчике.Вставить("Направление", Стр.Направление);
		СтруктураДобавляемыхСтрокИнформацияОПеревозчике.Вставить("СтавкаКлиенту", Стр.СтавкаКлиенту);
		
		МассивДобавляемыхСтрокИнформацияОПеревозчике.Добавить(СтруктураДобавляемыхСтрокИнформацияОПеревозчике);
		
	КонецЦикла; 
	
	СтруктураВозвратаПараметров = Новый Структура;
	СтруктураВозвратаПараметров.Вставить("ТекстовоеПредставление", ТекстовоеПредставление); 
	СтруктураВозвратаПараметров.Вставить("КлючСвязи", КлючСвязи);
	СтруктураВозвратаПараметров.Вставить("МассивДобавляемыхСтрокИнформацияОПеревозчике", МассивДобавляемыхСтрокИнформацияОПеревозчике);
	
	Оповестить("ВыполненоЗаполнениеИнформацияОПеревозчике", СтруктураВозвратаПараметров, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ЗаполнитьИнформациюОПеревозчике();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюОПеревозчике()
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", КлючСвязи);
	НайденныеСтроки = ВладелецФормы.Объект.ИнформацияОПеревозчиках.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
		
		СтрРаспределение = ИнформацияОПеревозчике.Добавить(); 
		СтрРаспределение.Перевозчик = НайденнаяСтрока.Перевозчик;
		СтрРаспределение.СтавкаАвтоперевозки = НайденнаяСтрока.СтавкаАвтоперевозки;
		СтрРаспределение.Направление = НайденнаяСтрока.Направление;
		СтрРаспределение.СтавкаКлиенту = НайденнаяСтрока.СтавкаКлиенту;
		
	КонецЦикла;  
	
КонецПроцедуры
	
