#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Копирование = Ложь;
    Если Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования.Период) Тогда
        Копирование = Истина;
	КонецЕсли;   
	
	Если Не ЗначениеЗаполнено(ВариантыРасчетаКомиссии) Тогда
		ВариантыРасчетаКомиссии = "Процент";	
	КонецЕсли;
	
	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	СтруктураОтбора = ЗаписьОбъект.ХранилищеОтбора.Получить(); 
	
	Если Запись.ДляРуководителя Тогда
		Элементы.ГруппаОтборДляРуководителя.Видимость = Истина;	
	Иначе
		Элементы.ГруппаОтборДляРуководителя.Видимость = Ложь; 
		Запись.ОтборПоМенеджерам = Ложь;
	КонецЕсли; 
	
	Если Запись.ОтборПоМенеджерам Тогда
		Элементы.МенеджерыДляОтбора.Видимость = Истина;
	Иначе
		Элементы.МенеджерыДляОтбора.Видимость = Ложь;	
	КонецЕсли;
	
	Если Запись.ЗависитОтНоменклатуры Тогда
		Элементы.НоменклатураДляОтобора.Видимость = Истина; 
		Элементы.СгруппироватьНоменклатуру.Видимость = Истина;
	КонецЕсли; 
	
	Если Запись.ЗависитОтВидаСделки Тогда
		Элементы.ВидыСделокДляОтбора.Видимость = Истина;	
	КонецЕсли;          
	
	Если ВариантыРасчетаКомиссии = "Процент" Тогда  
		Элементы.СтраницыРасчетКомиссии.ТекущаяСтраница = Элементы.СтраницаНастройкиПроцента;
	ИначеЕсли ВариантыРасчетаКомиссии = "ФиксированнаяСумма" Тогда
		Элементы.СтраницыРасчетКомиссии.ТекущаяСтраница = Элементы.СтраницаНастройкаФиксированнойСуммы;		
	КонецЕсли;   
	
	Если Запись.ПроцентЗависитОтПороговогоЗначения Тогда
		Элементы.РазмерПроцентаКомисси.Видимость = Ложь;
		Элементы.ПороговыеЗначенияДляПроцента.Видимость = Истина;
	Иначе
		Элементы.РазмерПроцентаКомисси.Видимость = Истина;
		Элементы.ПороговыеЗначенияДляПроцента.Видимость = Ложь;
	КонецЕсли;  
	
	Если Запись.ФиксированнаяСуммаЗависитОтПороговогоЗначения Тогда
		Элементы.РазмерФиксированнойСуммы.Видимость = Ложь;
		Элементы.ПороговыеЗначенияДляФиксированнойСуммы.Видимость = Истина;
	Иначе
		Элементы.РазмерФиксированнойСуммы.Видимость = Истина;
		Элементы.ПороговыеЗначенияДляФиксированнойСуммы.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	Если Не ЗначениеЗаполнено(Менеджер) Тогда
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран менеджер для отчета.";
		Сообщение.Поле = "Менеджер";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура(); 
	
	СтруктураОтбора.Вставить("ОтделОрганизации", Запись.Отдел);
	СтруктураОтбора.Вставить("Менеджер", Менеджер);  
	СтруктураОтбора.Вставить("ВариантыРасчетаКомиссии", ВариантыРасчетаКомиссии); 
	
	Если Запись.ОтборПоМенеджерам = Истина Тогда
	
		Если МенеджерыДляОтбора.Количество() = 0 Тогда
		
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не добавлены менеджеры для отбора.";
			Сообщение.Поле = "МенеджерыДляОтбора";
			Сообщение.Сообщить();
		
		КонецЕсли;
		
		ТЗМенеджерыДляОтбора = МенеджерыДляОтбора.Выгрузить();
		ТЗМенеджерыДляОтбора.Свернуть("Менеджер");
		СтруктураОтбора.Вставить("МенеджерыДляОтбора", ТЗМенеджерыДляОтбора); 
	
	КонецЕсли;
	
	Если Запись.ЗависитОтНоменклатуры Тогда  
		
		Если НоменклатураДляОтобора.Количество() = 0 Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не добавлена номенклатура для отбора.";
			Сообщение.Поле = "НоменклатураДляОтобора";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		ТЗНоменклатураДляОтбора = НоменклатураДляОтобора.Выгрузить();
		ТЗНоменклатураДляОтбора.Свернуть("Номенклатура");
		СтруктураОтбора.Вставить("НоменклатураДляОтобора", ТЗНоменклатураДляОтбора);		
		
	КонецЕсли;   
	
	Если Запись.ЗависитОтВидаСделки Тогда  
		
		Если ВидыСделокДляОтбора.Количество() = 0 Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не добавлены виды сделок для отбора.";
			Сообщение.Поле = "ВидыСделокДляОтбора";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		ТЗВидыСделокДляОтбора = ВидыСделокДляОтбора.Выгрузить();
		ТЗВидыСделокДляОтбора.Свернуть("ВидСделки");
		СтруктураОтбора.Вставить("ВидыСделокДляОтбора", ТЗВидыСделокДляОтбора);		
		
	КонецЕсли;      
	
	Если ВариантыРасчетаКомиссии = "Процент" Тогда
		
		Если Не ЗначениеЗаполнено(ОтЧегоПроцент) Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю; 
			Сообщение.Текст = "Не указана база для расчета процента комиссии.";
			Сообщение.Поле = "ОтЧегоПроцент";
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
		СтруктураОтбора.Вставить("ОтЧегоПроцент", ОтЧегоПроцент); 
		СтруктураОтбора.Вставить("НадбавкаЗаПервичнуюСделку", НадбавкаЗаПервичнуюСделку);
		
		Если Запись.ПроцентЗависитОтПороговогоЗначения Тогда
			
			Если ПороговыеЗначенияДляПроцента.Количество() = 0 Тогда
				
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не указаны пороговые значения для процента.";
				Сообщение.Поле = "ПороговыеЗначенияДляПроцента";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
			СтруктураОтбора.Вставить("ПороговыеЗначенияДляПроцента", ПороговыеЗначенияДляПроцента.Выгрузить());
			
		Иначе	
			
			СтруктураОтбора.Вставить("РазмерПроцентаКомисси", РазмерПроцентаКомисси);
			
		КонецЕсли;
		
	ИначеЕсли ВариантыРасчетаКомиссии = "ФиксированнаяСумма" Тогда
		
		Если Запись.ФиксированнаяСуммаЗависитОтПороговогоЗначения Тогда 
			
			Если ПороговыеЗначенияДляФиксированнойСуммы.Количество() = 0 Тогда
				
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не указаны пороговые значения для фиксированной суммы";
				Сообщение.Поле = "ПороговыеЗначенияДляФиксированнойСуммы";
				Сообщение.Сообщить();	
				
			КонецЕсли;
			
			СтруктураОтбора.Вставить("ПороговыеЗначенияДляФиксированнойСуммы", ПороговыеЗначенияДляФиксированнойСуммы.Выгрузить());	
			
		Иначе	 
			
			СтруктураОтбора.Вставить("РазмерФиксированнойСуммы", РазмерФиксированнойСуммы);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ТекущийОбъект.ХранилищеОтбора = Новый ХранилищеЗначения(СтруктураОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СтруктураОтбора = ТекущийОбъект.ХранилищеОтбора.Получить();	 
	
	Если СтруктураОтбора = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Менеджер = СтруктураОтбора.Менеджер;  
	
	Если СтруктураОтбора.Свойство("МенеджерыДляОтбора") Тогда
	
		Для каждого Строка Из СтруктураОтбора.МенеджерыДляОтбора Цикл
			
			НоваяСтрока = МенеджерыДляОтбора.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЦикла;	
	
	КонецЕсли;
	
	Если СтруктураОтбора.Свойство("НоменклатураДляОтобора") Тогда
		
		Для каждого Строка Из СтруктураОтбора.НоменклатураДляОтобора Цикл
			
			НоваяСтрока = НоменклатураДляОтобора.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СтруктураОтбора.Свойство("ВидыСделокДляОтбора") Тогда
		
		Для каждого Строка Из СтруктураОтбора.ВидыСделокДляОтбора Цикл
			
			НоваяСтрока = ВидыСделокДляОтбора.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЦикла;
		
	КонецЕсли;  
	
	Если СтруктураОтбора.Свойство("ВариантыРасчетаКомиссии") Тогда
		ВариантыРасчетаКомиссии = СтруктураОтбора.ВариантыРасчетаКомиссии;	
	Иначе	
		ВариантыРасчетаКомиссии = "Процент";
	КонецЕсли;
	
	Если ВариантыРасчетаКомиссии = "Процент" Тогда
		
		Элементы.ЗависитОтНоменклатуры.ТолькоПросмотр = Ложь;
		
		ОтЧегоПроцент = СтруктураОтбора.ОтЧегоПроцент;
		НадбавкаЗаПервичнуюСделку = СтруктураОтбора.НадбавкаЗаПервичнуюСделку;
		
		Если Запись.ПроцентЗависитОтПороговогоЗначения Тогда  
			
			Для каждого Строка Из СтруктураОтбора.ПороговыеЗначенияДляПроцента Цикл
				
				НоваяСтрока = ПороговыеЗначенияДляПроцента.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
			КонецЦикла;
			
		Иначе	    
			
			РазмерПроцентаКомисси = СтруктураОтбора.РазмерПроцентаКомисси; 
			
		КонецЕсли;
		
	ИначеЕсли ВариантыРасчетаКомиссии = "ФиксированнаяСумма" Тогда 
		
		Элементы.ЗависитОтНоменклатуры.ТолькоПросмотр = Истина;
		
		Если Запись.ФиксированнаяСуммаЗависитОтПороговогоЗначения Тогда 
			
			Для каждого Строка Из СтруктураОтбора.ПороговыеЗначенияДляФиксированнойСуммы Цикл
				
				НоваяСтрока = ПороговыеЗначенияДляФиксированнойСуммы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
			КонецЦикла;
			
		Иначе	                                        
			
			РазмерФиксированнойСуммы = СтруктураОтбора.РазмерФиксированнойСуммы; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ПроцентЗависитОтПороговогоЗначенияПриИзменении(Элемент)
	
	Если Запись.ПроцентЗависитОтПороговогоЗначения Тогда
		Элементы.РазмерПроцентаКомисси.Видимость = Ложь;
		Элементы.ПороговыеЗначенияДляПроцента.Видимость = Истина;
	Иначе
		Элементы.РазмерПроцентаКомисси.Видимость = Истина;
		Элементы.ПороговыеЗначенияДляПроцента.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФиксированнаяСуммаЗависитОтПороговогоЗначенияПриИзменении(Элемент)
	
	Если Запись.ФиксированнаяСуммаЗависитОтПороговогоЗначения Тогда
		Элементы.РазмерФиксированнойСуммы.Видимость = Ложь;
		Элементы.ПороговыеЗначенияДляФиксированнойСуммы.Видимость = Истина;
	Иначе
		Элементы.РазмерФиксированнойСуммы.Видимость = Истина;
		Элементы.ПороговыеЗначенияДляФиксированнойСуммы.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыРасчетаКомиссииПриИзменении(Элемент)
	
	Если ВариантыРасчетаКомиссии = "Процент" Тогда  
		
		Элементы.ЗависитОтНоменклатуры.ТолькоПросмотр = Ложь;
		Элементы.СтраницыРасчетКомиссии.ТекущаяСтраница = Элементы.СтраницаНастройкиПроцента; 
		
	ИначеЕсли ВариантыРасчетаКомиссии = "ФиксированнаяСумма" Тогда
		
		// Если пользователь выбирает фиксированную сумму, отбор по номенклатуре включается автоматически
		Запись.ЗависитОтНоменклатуры = Истина;
		Элементы.ЗависитОтНоменклатуры.ТолькоПросмотр = Истина;
		Элементы.НоменклатураДляОтобора.Видимость = Истина;
		
		Элементы.СтраницыРасчетКомиссии.ТекущаяСтраница = Элементы.СтраницаНастройкаФиксированнойСуммы;	
		
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ДляРуководителяПриИзменении(Элемент)
	
	Если Запись.ДляРуководителя Тогда
		Элементы.ГруппаОтборДляРуководителя.Видимость = Истина;	
	Иначе
		Элементы.ГруппаОтборДляРуководителя.Видимость = Ложь;
		Запись.ОтборПоМенеджерам = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоМенеджерамПриИзменении(Элемент)
	
	Если Запись.ОтборПоМенеджерам Тогда
		Элементы.МенеджерыДляОтбора.Видимость = Истина;
	Иначе
		Элементы.МенеджерыДляОтбора.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗависитОтНоменклатурыПриИзменении(Элемент)
	
	Если Запись.ЗависитОтНоменклатуры Тогда
		Элементы.НоменклатураДляОтобора.Видимость = Истина;
		Элементы.СгруппироватьНоменклатуру.Видимость = Истина;
	Иначе
		Элементы.НоменклатураДляОтобора.Видимость = Ложь;
		Элементы.СгруппироватьНоменклатуру.Видимость = Ложь;
		Запись.СгруппироватьНоменклатуру = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависитОтВидаСделкиПриИзменении(Элемент)
	
	Если Запись.ЗависитОтВидаСделки Тогда
		Элементы.ВидыСделокДляОтбора.Видимость = Истина;
	Иначе
		Элементы.ВидыСделокДляОтбора.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти