
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.Использование  = Истина;
	ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Закрыта); 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Отменена);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Завершена);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Удалена);
	
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	//ПрофитСделок = ПолучитьПрофитПоСделкам();



КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПуть(Ссыл)
	
	Возврат Ссыл.ПутьКПапке;
	
КонецФункции

&НаСервере
Функция ПолучитьПрофитПоСделкам()

    Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаТЗПрофита();
	
	Результат = Запрос.Выполнить();
	
	ДанныеЗапросаПоСделкам = Результат.Выгрузить();
	
	ТабЗначДляСписка = ДанныеЗапросаПоСделкам.Скопировать(,"Сделка,ПрофитАктБезНДС,ПрофитСчетБезНДС");

	

КонецФункции 



&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)  
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	ПониженнаяСтавка = УчетНДС.ПрименяетсяПониженнаяСтавкаНДС(Организация, ТекущаяДата());
	
	Если Организация.ИНН = "5074080761" Тогда // Декларант
		
		Номенклатура1 = Справочники.Номенклатура.НайтиПоКоду("00-00000025");   // Таможенные платежи
		
	ИначеЕсли Организация.ИНН = "2315213101" Тогда // Логист 
		
		Номенклатура1 = Справочники.Номенклатура.НайтиПоКоду("00-00000389"); // Таможенные платежи
		
	КонецЕсли;
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Счет,
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	               |			ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	               |		КОНЕЦ) КАК СуммаБезНДССчета,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	               |			ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	               |		КОНЕЦ) КАК СуммаНДССчета,
	               |	СУММА(СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения) КАК СуммаСНДССчета,
	               |	СчетНаОплатуПоставщикаТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_СчетаПоставщиков
	               |ИЗ
	               |	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	               |		ПО СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения
	               |			И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка
	               |ГДЕ
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	               |	И СчетНаОплатуПоставщикаТовары.Номенклатура <> &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка,
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка,
	               |	СчетНаОплатуПоставщикаТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_СчетаПоставщиков.Счет КАК Счет,
	               |	ВТ_СчетаПоставщиков.Сделка КАК Сделка,
	               |	ВТ_СчетаПоставщиков.СуммаБезНДССчета КАК СуммаБезНДССчета,
	               |	ВТ_СчетаПоставщиков.СуммаНДССчета КАК СуммаНДССчета,
	               |	ВТ_СчетаПоставщиков.СуммаСНДССчета КАК СуммаСНДССчета,
	               |	ВТ_СчетаПоставщиков.Номенклатура КАК Номенклатура,
	               |	ВидыРасходовСделки.Перевыставляемый КАК СчетПеревыставляемый,
	               |	ВЫБОР
	               |		КОГДА ВидыРасходовСделки.Перевыставляемый
	               |			ТОГДА ВТ_СчетаПоставщиков.СуммаНДССчета
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СчетПеревыставляемыйНДС
	               |ПОМЕСТИТЬ ВТ_СчетаНоменклПеревыставляемый
	               |ИЗ
	               |	ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	               |		ПО ВТ_СчетаПоставщиков.Номенклатура = ВидыРасходовСделки.Номенклатура
	               |			И (ВидыРасходовСделки.ВидСделки = ВТ_СчетаПоставщиков.Сделка.Вид)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Акт,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК СуммаБезНДСАкта,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика КАК Счет,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |			ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |		КОНЕЦ) КАК СуммаНДСАкта,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК СуммаСНДСАкта,
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Поступления
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугУслуги.Номенклатура <> &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	               |	СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	               |	NULL,
	               |	СделкаВнутренниеРасходы.Ссылка,
	               |	0,
	               |	СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	               |	NULL
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	               |ГДЕ
	               |	СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	               |	СделкаВнутренниеРасходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |			ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугТовары.Номенклатура
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугТовары.Номенклатура <> &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |			ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	               |			И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура <> &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Поступления.Акт КАК Акт,
	               |	ВТ_Поступления.СуммаБезНДСАкта КАК СуммаБезНДСАкта,
	               |	ВТ_Поступления.Счет КАК Счет,
	               |	ВТ_Поступления.Сделка КАК Сделка,
	               |	ВТ_Поступления.СуммаНДСАкта КАК СуммаНДСАкта,
	               |	ВТ_Поступления.СуммаСНДСАкта КАК СуммаСНДСАкта,
	               |	ВТ_Поступления.Номенклатура КАК Номенклатура,
	               |	ВидыРасходовСделки.Перевыставляемый КАК ПоступленияПеревыставляемый,
	               |	ВЫБОР
	               |		КОГДА ВидыРасходовСделки.Перевыставляемый
	               |			ТОГДА ВТ_Поступления.СуммаНДСАкта
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АктПеревыставляемыйНДС
	               |ПОМЕСТИТЬ ВТ_ПоступленияНоменклПеревыставляемый
	               |ИЗ
	               |	ВТ_Поступления КАК ВТ_Поступления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	               |		ПО ВТ_Поступления.Номенклатура = ВидыРасходовСделки.Номенклатура
	               |			И (ВидыРасходовСделки.ВидСделки = ВТ_Поступления.Сделка.Вид)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СчетаПоставщиков.Счет КАК Счет,
	               |	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка) КАК Сделка,
	               |	ВТ_Поступления.Акт КАК Акт,
	               |	СУММА(ВТ_Поступления.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	               |	СУММА(ВТ_Поступления.СуммаНДСАкта) КАК СуммаНДСАкта,
	               |	СУММА(ВТ_Поступления.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	               |	СУММА(ВТ_СчетаПоставщиков.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	               |	СУММА(ВТ_СчетаПоставщиков.СуммаНДССчета) КАК СуммаНДССчета,
	               |	СУММА(ВТ_СчетаПоставщиков.СуммаСНДССчета) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_Входящие
	               |ИЗ
	               |	ВТ_Поступления КАК ВТ_Поступления
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
	               |		ПО ВТ_Поступления.Счет = ВТ_СчетаПоставщиков.Счет
	               |			И ВТ_Поступления.Сделка = ВТ_СчетаПоставщиков.Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СчетаПоставщиков.Счет,
	               |	ВТ_Поступления.Акт,
	               |	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_ПоступленияНоменклПеревыставляемый.Сделка, ВТ_СчетаНоменклПеревыставляемый.Сделка) КАК Сделка,
	               |	ВТ_СчетаНоменклПеревыставляемый.Счет КАК Счет,
	               |	ВТ_ПоступленияНоменклПеревыставляемый.Акт КАК Акт,
	               |	СУММА(ВТ_ПоступленияНоменклПеревыставляемый.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	               |	СУММА(ВТ_ПоступленияНоменклПеревыставляемый.СуммаНДСАкта) КАК СуммаНДСАкта,
	               |	СУММА(ВТ_ПоступленияНоменклПеревыставляемый.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	               |	СУММА(ВТ_ПоступленияНоменклПеревыставляемый.АктПеревыставляемыйНДС) КАК АктПеревыставляемыйНДС,
	               |	СУММА(ВТ_СчетаНоменклПеревыставляемый.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	               |	СУММА(ВТ_СчетаНоменклПеревыставляемый.СуммаНДССчета) КАК СуммаНДССчета,
	               |	СУММА(ВТ_СчетаНоменклПеревыставляемый.СуммаСНДССчета) КАК СуммаСНДССчета,
	               |	СУММА(ВТ_СчетаНоменклПеревыставляемый.СчетПеревыставляемыйНДС) КАК СчетПеревыставляемыйНДС
	               |ПОМЕСТИТЬ ВТ_ВходящиеПеревыставляемые
	               |ИЗ
	               |	ВТ_ПоступленияНоменклПеревыставляемый КАК ВТ_ПоступленияНоменклПеревыставляемый
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаНоменклПеревыставляемый КАК ВТ_СчетаНоменклПеревыставляемый
	               |		ПО ВТ_ПоступленияНоменклПеревыставляемый.Счет = ВТ_СчетаНоменклПеревыставляемый.Счет
	               |			И ВТ_ПоступленияНоменклПеревыставляемый.Сделка = ВТ_СчетаНоменклПеревыставляемый.Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ_ПоступленияНоменклПеревыставляемый.Сделка, ВТ_СчетаНоменклПеревыставляемый.Сделка),
	               |	ВТ_СчетаНоменклПеревыставляемый.Счет,
	               |	ВТ_ПоступленияНоменклПеревыставляемый.Акт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	               |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	               |		КОНЕЦ) КАК СуммаБезНДССчета,
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
	               |	СУММА(СчетНаОплатуПокупателюТовары.СуммаНДС) КАК СуммаНДССчета,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	               |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	               |		КОНЕЦ) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_СчетаПокупателям
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	               |ГДЕ
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплатуПокупателюТовары.Ссылка,
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Акт,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ) КАК СуммаБезНДСАкта,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
	               |	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	               |		КОНЕЦ) КАК СуммаСНДСАкта
	               |ПОМЕСТИТЬ ВТ_Реализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслугТовары.Номенклатура <> &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Ссылка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслугУслуги.Номенклатура <> &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	               |	СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура <> &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СУММА(СделкаВнутренниеДоходы.Сумма),
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	0,
	               |	СделкаВнутренниеДоходы.Сумма
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	               |ГДЕ
	               |	СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СделкаВнутренниеДоходы.Сумма,
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	СделкаВнутренниеДоходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	               |		КОНЕЦ),
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	               |	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |ГДЕ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	               |	И ОтчетКомитентуОПродажахТовары.Номенклатура <> &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет) КАК Счет,
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка) КАК Сделка,
	               |	ВТ_Реализации.Акт КАК Акт,
	               |	СУММА(ВТ_Реализации.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	               |	СУММА(ВТ_Реализации.СуммаНДСАкта) КАК СуммаНДСАкта,
	               |	СУММА(ВТ_Реализации.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаНДССчета) КАК СуммаНДССчета,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаСНДССчета) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_Исходящие
	               |ИЗ
	               |	ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	               |		ПО ВТ_СчетаПокупателям.Сделка = ВТ_Реализации.Сделка
	               |			И ВТ_СчетаПокупателям.Счет = ВТ_Реализации.Счет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет),
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка),
	               |	ВТ_Реализации.Акт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Входящие.Сделка КАК Сделка,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВходящиеИтогиПоСделкам
	               |ИЗ
	               |	ВТ_Входящие КАК ВТ_Входящие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |		ПО ВТ_Входящие.Счет = СтатусыДокументов.Документ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаНоменклПеревыставляемый КАК ВТ_СчетаНоменклПеревыставляемый
	               |		ПО (ВТ_СчетаНоменклПеревыставляемый.Счет = ВТ_Входящие.Счет)
	               |			И ВТ_Входящие.Сделка = ВТ_СчетаНоменклПеревыставляемый.Сделка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоступленияНоменклПеревыставляемый КАК ВТ_ПоступленияНоменклПеревыставляемый
	               |		ПО ВТ_Входящие.Акт = ВТ_ПоступленияНоменклПеревыставляемый.Акт
	               |			И ВТ_Входящие.Сделка = ВТ_ПоступленияНоменклПеревыставляемый.Сделка
	               |ГДЕ
	               |	ВТ_Входящие.Сделка В(&Сделка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Входящие.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВходящиеПеревыставляемые.Сделка КАК Сделка,
	               |	СУММА(ВТ_ВходящиеПеревыставляемые.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	               |	СУММА(ВТ_ВходящиеПеревыставляемые.СуммаНДСАкта) КАК СуммаНДСАкта,
	               |	СУММА(ВТ_ВходящиеПеревыставляемые.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	               |	СУММА(ВТ_ВходящиеПеревыставляемые.АктПеревыставляемыйНДС) КАК АктПеревыставляемыйНДС,
	               |	СУММА(ВТ_ВходящиеПеревыставляемые.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	               |	СУММА(ВТ_ВходящиеПеревыставляемые.СуммаНДССчета) КАК СуммаНДССчета,
	               |	СУММА(ВТ_ВходящиеПеревыставляемые.СуммаСНДССчета) КАК СуммаСНДССчета,
	               |	СУММА(ВТ_ВходящиеПеревыставляемые.СчетПеревыставляемыйНДС) КАК СчетПеревыставляемыйНДС
	               |ПОМЕСТИТЬ ВходящиеИтогиПоСделкамПеревыставляемый
	               |ИЗ
	               |	ВТ_ВходящиеПеревыставляемые КАК ВТ_ВходящиеПеревыставляемые
	               |ГДЕ
	               |	ВТ_ВходящиеПеревыставляемые.Сделка В(&Сделка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВходящиеПеревыставляемые.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Исходящие.Сделка КАК Сделка,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ИсходящиеИтогиПоСделкам
	               |ИЗ
	               |	ВТ_Исходящие КАК ВТ_Исходящие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |		ПО ВТ_Исходящие.Счет = СтатусыДокументов.Документ
	               |ГДЕ
	               |	ВТ_Исходящие.Сделка В(&Сделка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Исходящие.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкам.Сделка, ИсходящиеИтогиПоСделкам.Сделка) КАК Сделка,
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкам.СуммаБезНДСАкта, 0) КАК ВхСуммаБезНДСАкта,
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкам.СуммаНДСАкта, 0) КАК ВхСуммаНДСАкта,
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкам.СуммаСНДСАкта, 0) КАК ВхСуммаСНДСАкта,
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкам.СуммаБезНДССчета, 0) КАК ВхСуммаБезНДССчета,
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкам.СуммаНДССчета, 0) КАК ВхСуммаНДССчета,
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкам.СуммаСНДССчета, 0) КАК ВхСуммаСНДССчета,
	               |	ЕСТЬNULL(ИсходящиеИтогиПоСделкам.СуммаБезНДСАкта, 0) КАК ИсхСуммаБезНДСАкта,
	               |	ЕСТЬNULL(ИсходящиеИтогиПоСделкам.СуммаНДСАкта, 0) КАК ИсхСуммаНДСАкта,
	               |	ЕСТЬNULL(ИсходящиеИтогиПоСделкам.СуммаСНДСАкта, 0) КАК ИсхСуммаСНДСАкта,
	               |	ЕСТЬNULL(ИсходящиеИтогиПоСделкам.СуммаБезНДССчета, 0) КАК ИсхСуммаБезНДССчета,
	               |	ЕСТЬNULL(ИсходящиеИтогиПоСделкам.СуммаНДССчета, 0) КАК ИсхСуммаНДССчета,
	               |	ЕСТЬNULL(ИсходящиеИтогиПоСделкам.СуммаСНДССчета, 0) КАК ИсхСуммаСНДССчета,
	               |	ЕСТЬNULL(ИсходящиеИтогиПоСделкам.СуммаБезНДСАкта, 0) - ЕСТЬNULL(ВходящиеИтогиПоСделкам.СуммаБезНДСАкта, 0) КАК ПрофитАктБезНДС,
	               |	ЕСТЬNULL(ИсходящиеИтогиПоСделкам.СуммаБезНДССчета, 0) - ЕСТЬNULL(ВходящиеИтогиПоСделкам.СуммаБезНДССчета, 0) КАК ПрофитСчетБезНДС,
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкамПеревыставляемый.СчетПеревыставляемыйНДС, 0) КАК ВхСуммаСНДССчетПеревыставляемый,
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкамПеревыставляемый.АктПеревыставляемыйНДС, 0) КАК ВхСуммаСНДСАктПеревыставляемый
	               |ИЗ
	               |	ВходящиеИтогиПоСделкам КАК ВходящиеИтогиПоСделкам
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ИсходящиеИтогиПоСделкам КАК ИсходящиеИтогиПоСделкам
	               |		ПО ВходящиеИтогиПоСделкам.Сделка = ИсходящиеИтогиПоСделкам.Сделка
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВходящиеИтогиПоСделкамПеревыставляемый КАК ВходящиеИтогиПоСделкамПеревыставляемый
	               |		ПО ВходящиеИтогиПоСделкам.Сделка = ВходящиеИтогиПоСделкамПеревыставляемый.Сделка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сделка";
	
	Запрос.УстановитьПараметр("Сделка",Строки.ПолучитьКлючи());
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура1);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать(); 
	
	
	
	Пока Выборка.Следующий() Цикл 
		
		СрокаСписка = Строки[Выборка.Сделка] ;   
		
		//СрокаСписка.Данные.ПрофитАктБезНДС = Выборка.ИсхСуммаБезНДСАкта - Выборка.ВхСуммаСНДСАкта + Выборка.ВхСуммаСНДСАктПеревыставляемый;
		//СрокаСписка.Данные.ПрофитСчетБезНДС = Выборка.ИсхСуммаБезНДССчета - Выборка.ВхСуммаСНДССчета + Выборка.ВхСуммаСНДССчетПеревыставляемый;
		
		Если ПониженнаяСтавка Тогда
			
			СрокаСписка.Данные.ПрофитАктБезНДС  =  Выборка.ИсхСуммаСНДСАкта  - Выборка.ИсхСуммаНДСАкта  - Выборка.ВхСуммаСНДСАкта;
			СрокаСписка.Данные.ПрофитСчетБезНДС =  Выборка.ИсхСуммаСНДССчета - Выборка.ИсхСуммаНДССчета - Выборка.ВхСуммаСНДССчета; 
			
		Иначе
			
			СрокаСписка.Данные.ПрофитАктБезНДС  = Выборка.ИсхСуммаБезНДСАкта  - Выборка.ВхСуммаБезНДСАкта;
			СрокаСписка.Данные.ПрофитСчетБезНДС = Выборка.ИсхСуммаБезНДССчета - Выборка.ВхСуммаБезНДССчета
			
		КонецЕсли;	


а="";
	КонецЦикла;	
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапросаТЗПрофита()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Счет,
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	               |			ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	               |		КОНЕЦ) КАК СуммаБезНДССчета,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
	               |			ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
	               |		КОНЕЦ) КАК СуммаНДССчета,
	               |	СУММА(СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения) КАК СуммаСНДССчета,
	               |	СчетНаОплатуПоставщикаТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_СчетаПоставщиков
	               |ИЗ
	               |	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	               |		ПО СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения
	               |			И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка
	               |ГДЕ
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка,
	               |	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка,
	               |	СчетНаОплатуПоставщикаТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_СчетаПоставщиков.Счет КАК Счет,
	               |	ВТ_СчетаПоставщиков.Сделка КАК Сделка,
	               |	ВТ_СчетаПоставщиков.СуммаБезНДССчета КАК СуммаБезНДССчета,
	               |	ВТ_СчетаПоставщиков.СуммаНДССчета КАК СуммаНДССчета,
	               |	ВТ_СчетаПоставщиков.СуммаСНДССчета КАК СуммаСНДССчета,
	               |	ВТ_СчетаПоставщиков.Номенклатура КАК Номенклатура,
	               |	ВидыРасходовСделки.Перевыставляемый КАК СчетПеревыставляемый
	               |ПОМЕСТИТЬ ВТ_СчетаНоменклПеревыставляемый
	               |ИЗ
	               |	ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	               |		ПО ВТ_СчетаПоставщиков.Номенклатура = ВидыРасходовСделки.Номенклатура
	               |			И (ВидыРасходовСделки.ВидСделки = ВТ_СчетаПоставщиков.Сделка.Вид)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Акт,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК СуммаБезНДСАкта,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика КАК Счет,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |			ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |		КОНЕЦ) КАК СуммаНДСАкта,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК СуммаСНДСАкта,
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Поступления
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	               |	СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	               |	NULL,
	               |	СделкаВнутренниеРасходы.Ссылка,
	               |	0,
	               |	СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	               |	NULL
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	               |ГДЕ
	               |	СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	               |	СделкаВнутренниеРасходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |			ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугТовары.Номенклатура
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |			ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	               |								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	               |			И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
	               |	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Поступления.Акт КАК Акт,
	               |	ВТ_Поступления.СуммаБезНДСАкта КАК СуммаБезНДСАкта,
	               |	ВТ_Поступления.Счет КАК Счет,
	               |	ВТ_Поступления.Сделка КАК Сделка,
	               |	ВТ_Поступления.СуммаНДСАкта КАК СуммаНДСАкта,
	               |	ВТ_Поступления.СуммаСНДСАкта КАК СуммаСНДСАкта,
	               |	ВТ_Поступления.Номенклатура КАК Номенклатура,
	               |	ВидыРасходовСделки.Перевыставляемый КАК ПоступленияПеревыставляемый
	               |ПОМЕСТИТЬ ВТ_ПоступленияНоменклПеревыставляемый
	               |ИЗ
	               |	ВТ_Поступления КАК ВТ_Поступления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	               |		ПО ВТ_Поступления.Номенклатура = ВидыРасходовСделки.Номенклатура
	               |			И (ВидыРасходовСделки.ВидСделки = ВТ_Поступления.Сделка.Вид)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СчетаПоставщиков.Счет КАК Счет,
	               |	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка) КАК Сделка,
	               |	ВТ_Поступления.Акт КАК Акт,
	               |	СУММА(ВТ_Поступления.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	               |	СУММА(ВТ_Поступления.СуммаНДСАкта) КАК СуммаНДСАкта,
	               |	СУММА(ВТ_Поступления.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	               |	СУММА(ВТ_СчетаПоставщиков.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	               |	СУММА(ВТ_СчетаПоставщиков.СуммаНДССчета) КАК СуммаНДССчета,
	               |	СУММА(ВТ_СчетаПоставщиков.СуммаСНДССчета) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_Входящие
	               |ИЗ
	               |	ВТ_Поступления КАК ВТ_Поступления
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
	               |		ПО ВТ_Поступления.Счет = ВТ_СчетаПоставщиков.Счет
	               |			И ВТ_Поступления.Сделка = ВТ_СчетаПоставщиков.Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СчетаПоставщиков.Счет,
	               |	ВТ_Поступления.Акт,
	               |	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
	               |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
	               |		КОНЕЦ) КАК СуммаБезНДССчета,
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
	               |	СУММА(СчетНаОплатуПокупателюТовары.СуммаНДС) КАК СуммаНДССчета,
	               |	СУММА(ВЫБОР
	               |			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА СчетНаОплатуПокупателюТовары.Сумма
	               |			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
	               |		КОНЕЦ) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_СчетаПокупателям
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	               |ГДЕ
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплатуПокупателюТовары.Ссылка,
	               |	СчетНаОплатуПокупателюТовары.Ссылка.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Акт,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ) КАК СуммаБезНДСАкта,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
	               |	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	               |		КОНЕЦ) КАК СуммаСНДСАкта
	               |ПОМЕСТИТЬ ВТ_Реализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Ссылка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
	               |	СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СУММА(СделкаВнутренниеДоходы.Сумма),
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	0,
	               |	СделкаВнутренниеДоходы.Сумма
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	               |ГДЕ
	               |	СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СделкаВнутренниеДоходы.Сумма,
	               |	СделкаВнутренниеДоходы.Ссылка,
	               |	СделкаВнутренниеДоходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	               |		КОНЕЦ),
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	               |	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
	               |	СУММА(ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |ГДЕ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет) КАК Счет,
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка) КАК Сделка,
	               |	ВТ_Реализации.Акт КАК Акт,
	               |	СУММА(ВТ_Реализации.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
	               |	СУММА(ВТ_Реализации.СуммаНДСАкта) КАК СуммаНДСАкта,
	               |	СУММА(ВТ_Реализации.СуммаСНДСАкта) КАК СуммаСНДСАкта,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаБезНДССчета) КАК СуммаБезНДССчета,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаНДССчета) КАК СуммаНДССчета,
	               |	СУММА(ВТ_СчетаПокупателям.СуммаСНДССчета) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВТ_Исходящие
	               |ИЗ
	               |	ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	               |		ПО ВТ_СчетаПокупателям.Сделка = ВТ_Реализации.Сделка
	               |			И ВТ_СчетаПокупателям.Счет = ВТ_Реализации.Счет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет),
	               |	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка),
	               |	ВТ_Реализации.Акт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Входящие.Сделка КАК Сделка,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ВходящиеИтогиПоСделкам
	               |ИЗ
	               |	ВТ_Входящие КАК ВТ_Входящие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |		ПО ВТ_Входящие.Счет = СтатусыДокументов.Документ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаНоменклПеревыставляемый КАК ВТ_СчетаНоменклПеревыставляемый
	               |		ПО (ВТ_СчетаНоменклПеревыставляемый.Счет = ВТ_Входящие.Счет)
	               |			И ВТ_Входящие.Сделка = ВТ_СчетаНоменклПеревыставляемый.Сделка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоступленияНоменклПеревыставляемый КАК ВТ_ПоступленияНоменклПеревыставляемый
	               |		ПО ВТ_Входящие.Акт = ВТ_ПоступленияНоменклПеревыставляемый.Акт
	               |			И ВТ_Входящие.Сделка = ВТ_ПоступленияНоменклПеревыставляемый.Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Входящие.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Исходящие.Сделка КАК Сделка,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета
	               |ПОМЕСТИТЬ ИсходящиеИтогиПоСделкам
	               |ИЗ
	               |	ВТ_Исходящие КАК ВТ_Исходящие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |		ПО ВТ_Исходящие.Счет = СтатусыДокументов.Документ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Исходящие.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВходящиеИтогиПоСделкам.Сделка, ИсходящиеИтогиПоСделкам.Сделка) КАК Сделка,
	               |	ВходящиеИтогиПоСделкам.СуммаБезНДСАкта КАК ВхСуммаБезНДСАкта,
	               |	ВходящиеИтогиПоСделкам.СуммаНДСАкта КАК ВхСуммаНДСАкта,
	               |	ВходящиеИтогиПоСделкам.СуммаСНДСАкта КАК ВхСуммаСНДСАкта,
	               |	ВходящиеИтогиПоСделкам.СуммаБезНДССчета КАК ВхСуммаБезНДССчета,
	               |	ВходящиеИтогиПоСделкам.СуммаНДССчета КАК ВхСуммаНДССчета,
	               |	ВходящиеИтогиПоСделкам.СуммаСНДССчета КАК ВхСуммаСНДССчета,
	               |	ИсходящиеИтогиПоСделкам.СуммаБезНДСАкта КАК ИсхСуммаБезНДСАкта,
	               |	ИсходящиеИтогиПоСделкам.СуммаНДСАкта КАК ИсхСуммаНДСАкта,
	               |	ИсходящиеИтогиПоСделкам.СуммаСНДСАкта КАК ИсхСуммаСНДСАкта,
	               |	ИсходящиеИтогиПоСделкам.СуммаБезНДССчета КАК ИсхСуммаБезНДССчета,
	               |	ИсходящиеИтогиПоСделкам.СуммаНДССчета КАК ИсхСуммаНДССчета,
	               |	ИсходящиеИтогиПоСделкам.СуммаСНДССчета КАК ИсхСуммаСНДССчета,
	               |	ИсходящиеИтогиПоСделкам.СуммаБезНДСАкта - ВходящиеИтогиПоСделкам.СуммаБезНДСАкта КАК ПрофитАктБезНДС,
	               |	ИсходящиеИтогиПоСделкам.СуммаБезНДССчета - ВходящиеИтогиПоСделкам.СуммаБезНДССчета КАК ПрофитСчетБезНДС
	               |ИЗ
	               |	ВходящиеИтогиПоСделкам КАК ВходящиеИтогиПоСделкам
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ИсходящиеИтогиПоСделкам КАК ИсходящиеИтогиПоСделкам
	               |		ПО ВходящиеИтогиПоСделкам.Сделка = ИсходящиеИтогиПоСделкам.Сделка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сделка";
	
	Возврат ТекстЗапроса;

КонецФункции 
