
&ИзменениеИКонтроль("ПечатьОтчетаКомитенту")
Функция ЛГС_ПечатьОтчетаКомитенту(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетКомитентуОПродажах_ОтчетКомитентуОПродажах";

	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
		ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	ВыводитьКоды = ДополнительнаяКолонкаПечатныхФормДокументов <> Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", ДополнительнаяКолонкаПечатныхФормДокументов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧПоставщики.Ссылка КАК Ссылка,
	|	ТЧПоставщики.НомерСтроки КАК НомерСтроки,
	|	ТЧПоставщики.КлючСтроки КАК КлючСтроки,
	|	ТЧПоставщики.Поставщик КАК Поставщик,
	|	ТЧПоставщики.Партия КАК Партия,
	|	ДокПоступления.Дата КАК ДатаПартии,
	|	ВЫБОР
	|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|			ТОГДА СчетФактураПолученный.Ссылка.ДатаВходящегоДокумента
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаВходящегоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|			ТОГДА СчетФактураПолученный.Ссылка.НомерВходящегоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерВходящегоСчетаФактуры,
	|	ЕСТЬNULL(ДокПоступления.ДатаВходящегоДокумента, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВходящегоДокумента,
	|	ЕСТЬNULL(ДокПоступления.НомерВходящегоДокумента, """") КАК НомерВходящегоДокумента,
	|	ТЧПоставщики.СчетФактура КАК СчетФактураВыданный,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.ПолученСФ
	|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Дата, ТЧПоставщики.ДатаСФ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаВыданногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.ПолученСФ
	|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Номер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерВыданногоСчетаФактуры
	|ПОМЕСТИТЬ ВТ_РеквизитыПартий
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ДокПоступления
	|		ПО ТЧПоставщики.Партия = ДокПоступления.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ПО (ДокПоступления.Ссылка = СчетФактураПолученный.ДокументОснование)
	|ГДЕ
	|	ТЧПоставщики.Ссылка В(&МассивОбъектов)
	|	И ТЧПоставщики.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТЧПоставщики.Ссылка,
	|	ТЧПоставщики.КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов КАК ДокументРасчетов,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Дата КАК Дата,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер КАК Номер
	|ПОМЕСТИТЬ ТаблицаСчетовФактур
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ОтчетКомитентуОПродажахТовары.ДокументРасчетов = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
	|	И НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Дата,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка,
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
	|	СчетФактураВыданный.Дата,
	|	СчетФактураВыданный.Номер
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ОтчетКомитентуОПродажахТовары.ДокументРасчетов = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
	|	И НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|	И НЕ СчетФактураВыданный.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданный.Дата,
	|	СчетФактураВыданный.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажах.Ссылка.ВидОперации КАК ВидОперации,
	|	ОтчетКомитентуОПродажах.Ссылка.Номер КАК Номер,
	|	ОтчетКомитентуОПродажах.Ссылка.Дата КАК Дата,
	|	ОтчетКомитентуОПродажах.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОтчетКомитентуОПродажах.Ссылка.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажах.Ссылка.Организация КАК Организация,
	|	ОтчетКомитентуОПродажах.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ОтчетКомитентуОПродажах.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомитентуОПродажах.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	ОтчетКомитентуОПродажах.Ссылка.СуммаВознаграждения КАК СуммаВознаграждения,
	|	ОтчетКомитентуОПродажах.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ОтчетКомитентуОПродажах.НомерСтроки КАК НомерСтроки,
	|	0 КАК НомерСтрокиПоставщики,
	|	ОтчетКомитентуОПродажах.Номенклатура КАК Товар,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомитентуОПродажах.Содержание ПОДОБНО """"
	|			ТОГДА ОтчетКомитентуОПродажах.Содержание
	|		КОГДА СправочникНоменклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА СправочникНоменклатура.Наименование
	|		ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ОтчетКомитентуОПродажах.Номенклатура.Артикул
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА ОтчетКомитентуОПродажах.Номенклатура.Код
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
	|			ТОГДА """"
	|	КОНЕЦ КАК КодАртикул,
	|	ОтчетКомитентуОПродажах.КоличествоМест КАК КоличествоМест,
	|	ОтчетКомитентуОПродажах.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ОтчетКомитентуОПродажах.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ОтчетКомитентуОПродажах.Количество КАК Количество,
	|	ОтчетКомитентуОПродажах.Цена КАК Цена,
	|	ОтчетКомитентуОПродажах.Сумма КАК Сумма,
	|	ОтчетКомитентуОПродажах.СуммаНДС КАК СуммаНДС,
	|	ОтчетКомитентуОПродажах.Покупатель КАК ПокупательПоставщик,
	|	ОтчетКомитентуОПродажах.ДатаРеализации КАК ДатаПродажи,
	|	ОтчетКомитентуОПродажах.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПартии,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоСчетаФактуры,
	|	"""" КАК НомерВходящегоСчетаФактуры,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
	|	"""" КАК НомерВходящегоДокумента,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВыданногоСчетаФактуры,
	|	"""" КАК НомерВыданногоСчетаФактуры,
	|	ОтчетКомитентуОПродажах.Покупатель КАК ПолеДляИтогов,
	|	СправочникНоменклатура.ПериодичностьУслуги КАК ПериодичностьУслуги,
	|	ОтчетКомитентуОПродажах.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаСчетовФактур.Ссылка КАК СчетФактураПокупателю,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Количество > 0
	|				И НЕ ОтчетКомитентуОПродажах.ДокументРасчетов ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ""Реализация товаров и услуг""
	|		КОГДА ОтчетКомитентуОПродажах.Количество < 0
	|				И НЕ ОтчетКомитентуОПродажах.ДокументРасчетов ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ""Возврат товаров""
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ КАК ВидСобытия,
	|	ТаблицаСчетовФактур.Номер КАК НомерСФКомиссионера,
	|	ТаблицаСчетовФактур.Дата КАК ДатаСФКомиссионера,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Количество < 0
	|				ИЛИ ОтчетКомитентуОПродажах.ДокументРасчетов ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозврат
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ОтчетКомитентуОПродажах.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК ТаблицаСчетовФактур
	|		ПО ОтчетКомитентуОПродажах.ДокументРасчетов = ТаблицаСчетовФактур.ДокументРасчетов
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуОПродажах.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахТовары.Ссылка,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Номер,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаДокумента,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ВалютаДокумента,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.СтавкаНДСВознаграждения,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознаграждения,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ПодразделениеОрганизации,
	|	ОтчетКомитентуОПродажахТовары.НомерСтроки,
	|	ВТ_РеквизитыПартий.НомерСтроки,
	|	ОтчетКомитентуОПродажахТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомитентуОПродажахТовары.Содержание ПОДОБНО """"
	|			ТОГДА ОтчетКомитентуОПродажахТовары.Содержание
	|		КОГДА СправочникНоменклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА СправочникНоменклатура.Наименование
	|		ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ОтчетКомитентуОПродажахТовары.Номенклатура.Артикул
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА ОтчетКомитентуОПродажахТовары.Номенклатура.Код
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
	|			ТОГДА """"
	|	КОНЕЦ,
	|	ОтчетКомитентуОПродажахТовары.КоличествоМест,
	|	ОтчетКомитентуОПродажахТовары.ЕдиницаИзмерения.Представление,
	|	ОтчетКомитентуОПродажахТовары.Номенклатура.ЕдиницаИзмерения,
	|	ОтчетКомитентуОПродажахТовары.Количество,
	|	ОтчетКомитентуОПродажахТовары.Цена,
	|	ОтчетКомитентуОПродажахТовары.Сумма,
	|	ОтчетКомитентуОПродажахТовары.СуммаНДС,
	|	ЕСТЬNULL(ВТ_РеквизитыПартий.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС,
	|	ВТ_РеквизитыПартий.Партия,
	|	ВТ_РеквизитыПартий.ДатаПартии,
	|	ВТ_РеквизитыПартий.ДатаВходящегоСчетаФактуры,
	|	ВТ_РеквизитыПартий.НомерВходящегоСчетаФактуры,
	|	ВТ_РеквизитыПартий.ДатаВходящегоДокумента,
	|	ВТ_РеквизитыПартий.НомерВходящегоДокумента,
	|	ВТ_РеквизитыПартий.ДатаВыданногоСчетаФактуры,
	|	ВТ_РеквизитыПартий.НомерВыданногоСчетаФактуры,
	|	ВТ_РеквизитыПартий.Партия,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыПартий КАК ВТ_РеквизитыПартий
	|		ПО ОтчетКомитентуОПродажахТовары.КлючСтроки = ВТ_РеквизитыПартий.КлючСтроки
	|			И ОтчетКомитентуОПродажахТовары.Ссылка = ВТ_РеквизитыПартий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ОтчетКомитентуОПродажахТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	НомерСтрокиПоставщики,
	|	ПолеДляИтогов,
	|	ОтчетКомитентуОПродажах.НомерСтроки,
	|	ЭтоВозврат,
	|	СчетФактураПокупателю
	|ИТОГИ
	|	МАКСИМУМ(Ссылка),
	|	МАКСИМУМ(ВидОперации),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(ВалютаДокумента),
	|	МАКСИМУМ(СуммаВознаграждения),
	|	МИНИМУМ(НомерСтрокиПоставщики),
	|	СУММА(КоличествоМест),
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	МАКСИМУМ(ПокупательПоставщик),
	|	МАКСИМУМ(ДатаПартии),
	|	МАКСИМУМ(ДатаВходящегоСчетаФактуры),
	|	МАКСИМУМ(НомерВходящегоСчетаФактуры),
	|	МАКСИМУМ(ДатаВходящегоДокумента),
	|	МАКСИМУМ(НомерВходящегоДокумента),
	|	МАКСИМУМ(ДатаВыданногоСчетаФактуры),
	|	МАКСИМУМ(НомерВыданногоСчетаФактуры),
	|	МАКСИМУМ(НомерСФКомиссионера),
	|	МАКСИМУМ(ДатаСФКомиссионера),
	|	МАКСИМУМ(ЭтоВозврат)
	|ПО
	|	Ссылка,
	|	ВидСобытия,
	|	ПолеДляИтогов,
	|	СчетФактураПокупателю";	

	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");

	Итого = 0;
	НомерПП = 1;

	ПервыйДокумент = Истина;

	ОтчетНапечатан = Ложь;
	Пока ВыборкаДокументов.Следующий() Цикл

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОтчетНапечатан = Истина;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Если ВыборкаДокументов.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОПродажах");
			ЭтоКомиссияПоПродаже = Истина;
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОЗакупках");
			ЭтоКомиссияПоПродаже = Ложь;
		КонецЕсли;

		// Выводим шапку накладной

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"); 
		#Удаление
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(ВыборкаДокументов.Ссылка, НСтр("ru = 'Отчет комитенту'"));
		#КонецУдаления
		
		#Вставка
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(ВыборкаДокументов.Ссылка, НСтр("ru = 'Отчет экспедитора'"));
		#КонецВставки
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаДокументов.Организация, ВыборкаДокументов.Дата, , , , Истина);
		ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаДокументов.Контрагент, ВыборкаДокументов.Дата);
		ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");

		ОбластьМакета = Макет.ПолучитьОбласть("Комитент");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеКонтрагента;
		ОбластьМакета.Параметры.Поставщик               = ВыборкаДокументов.Контрагент;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеОрганизации;
		ОбластьМакета.Параметры.Получатель              = ВыборкаДокументов.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьШапки = ?(ВыводитьКоды, "ШапкаСКодом", "ШапкаТаблицы");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
			ОбластьМакета.Параметры.ИмяКодАртикул = "Артикул";
		ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
			ОбластьМакета.Параметры.ИмяКодАртикул = "Код";
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		Итого = 0;
		НомерПП = 1;
		ОбластьСтроки = ?(ВыводитьКоды,	"СтрокаСКодом", "Строка");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);

		КоличествоТоваров = 0;

		ПечататьСВидомСобытия = ЭтоКомиссияПоПродаже И НЕ Макет.Области.Найти("ВидСобытия") = Неопределено;

		Если ПечататьСВидомСобытия Тогда

			ОбластьМакетаСобытия = Макет.ПолучитьОбласть("ВидСобытия");

		Иначе

			ОбластьМакетаСобытия = Неопределено;

		КонецЕсли;

		ВыборкаПоВидуСобытия = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидСобытия");
		Пока ВыборкаПоВидуСобытия.Следующий() Цикл

			Если ПечататьСВидомСобытия Тогда
				// Выводит вид события
				ОбластьМакетаСобытия.Параметры.ПредставлениеСобытия = ВыборкаПоВидуСобытия.ВидСобытия;
				ТабличныйДокумент.Вывести(ОбластьМакетаСобытия);
			КонецЕсли;

			ВыборкаКонтрагентов = ВыборкаПоВидуСобытия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			Пока ВыборкаКонтрагентов.Следующий() Цикл

				СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаКонтрагентов.ПокупательПоставщик, ВыборкаДокументов.Дата);
				Если ЭтоКомиссияПоПродаже Тогда
					ТекстКонтрагент = НСтр("ru = 'Покупатель: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
				Иначе
					ТекстКонтрагент = НСтр("ru = 'Поставщик: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
				КонецЕсли;
				ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' Адрес: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "ЮридическийАдрес,");
				КПП = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "КПП,", Ложь);
				Если ЗначениеЗаполнено(КПП) Тогда
					КПП = "/" + КПП;
				КонецЕсли;
				Если ЭтоКомиссияПоПродаже Тогда
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' ИНН/КПП покупателя: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "ИНН,", Ложь) + КПП;
				Иначе
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' ИНН/КПП поставщика: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "ИНН,", Ложь) + КПП;
				КонецЕсли;

				// Сформируем информацию о реквизитах партии поставки.
				Если НЕ ЭтоКомиссияПоПродаже Тогда
					ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;

					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВходящегоДокумента)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВходящегоДокумента) Тогда
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Поступление от поставщика: № '") + ВыборкаКонтрагентов.НомерВходящегоДокумента 
						+ НСтр("ru = ' от '") + Формат(ВыборкаКонтрагентов.ДатаВходящегоДокумента, "ДЛФ=Д");
					Иначе
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Поступление от поставщика: № '") + Формат(ВыборкаКонтрагентов.ДатаПартии, "ДЛФ=Д");
					КонецЕсли;

					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВходящегоСчетаФактуры)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВходящегоСчетаФактуры) Тогда
						ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Получен счет-фактура поставщика: № '") + ВыборкаКонтрагентов.НомерВходящегоСчетаФактуры 
						+ НСтр("ru = ' от '") + Формат(ВыборкаКонтрагентов.ДатаВходящегоСчетаФактуры, "ДЛФ=Д");
					КонецЕсли;
					
					#Удаление
					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры) Тогда

						ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Выдан счет-фактура комитенту: № '") 
						+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры, Истина, Ложь) 
						+ " от " + Формат(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры, "ДЛФ=Д");
					КонецЕсли; 
					
					#КонецУдаления 
					
					#Вставка
					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры) Тогда

						ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Выдан счет-фактура клиенту: № '") 
						+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры, Истина, Ложь) 
						+ " от " + Формат(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры, "ДЛФ=Д");
					КонецЕсли; 
					
					#КонецВставки

				КонецЕсли;

				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКонтрагент");
				ОбластьМакета.Параметры.ПредставлениеКонтрагента = ТекстКонтрагент;
				ТабличныйДокумент.Вывести(ОбластьМакета);

				Если ПечататьСВидомСобытия Тогда
					ОбластьМакетаДокументПоПокупателю = Макет.ПолучитьОбласть("ДокументПокупателю");
				КонецЕсли;

				ИтогоПоКонтрагенту = 0;

				ВыборкаПоСчетФактуре = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетФактураПокупателю");
				Пока ВыборкаПоСчетФактуре.Следующий() Цикл

					Если ПечататьСВидомСобытия Тогда

						ПредставлениеДокумента = ПолучитьПредставлениеДокументаВыданногоПокупателю(ВыборкаПоСчетФактуре);

						Если ЗначениеЗаполнено(ПредставлениеДокумента) Тогда 

							ОбластьМакетаДокументПоПокупателю.Параметры.ПредставлениеДокумента = ПредставлениеДокумента;
							ТабличныйДокумент.Вывести(ОбластьМакетаДокументПоПокупателю);

						КонецЕсли;

					КонецЕсли;

					ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);

					ВыборкаТоваров = ВыборкаПоСчетФактуре.Выбрать();

					Пока ВыборкаТоваров.Следующий() Цикл

						КоличествоТоваров = КоличествоТоваров + 1;

						ОбластьМакета.Параметры.Заполнить(ВыборкаТоваров);
						ОбластьМакета.Параметры.НомерСтроки = НомерПП;

						Если НЕ ВыборкаТоваров.СуммаВключаетНДС Тогда
							СуммаПоСтроке = ВыборкаТоваров.Сумма + ВыборкаТоваров.СуммаНДС;
							ОбластьМакета.Параметры.Цена = ?(ВыборкаТоваров.Количество <> 0, СуммаПоСтроке/ВыборкаТоваров.Количество, 0);
							ОбластьМакета.Параметры.Сумма = СуммаПоСтроке;
						Иначе
							СуммаПоСтроке = ВыборкаТоваров.Сумма;
						КонецЕсли;			
						ТабличныйДокумент.Вывести(ОбластьМакета);

						Итого = Итого + СуммаПоСтроке;
						НомерПП = НомерПП + 1;
						ИтогоПоКонтрагенту = ИтогоПоКонтрагенту + СуммаПоСтроке;

					КонецЦикла;	

				КонецЦикла;

				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКонтрагентИтог");
				ОбластьМакета.Параметры.Заполнить(ВыборкаКонтрагентов);
				ОбластьМакета.Параметры.Сумма = ИтогоПоКонтрагенту;
				ТабличныйДокумент.Вывести(ОбластьМакета);

			КонецЦикла;	

		КонецЦикла;

		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = Итого;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");

		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Итого, ВыборкаДокументов.ВалютаДокумента);
        #Удаление
		ОбластьМакета.Параметры.СуммаВознаграждения = НСтр("ru = 'Сумма комиссионного вознаграждения составила'") + " "
		+ ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(ВыборкаДокументов.СуммаВознаграждения, ВыборкаДокументов.ВалютаДокумента);
        #КонецУдаления
		ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru = 'Всего наименований %Количество%, на сумму'") + " "
		+ ОбщегоНазначенияБПВызовСервера.ФорматСумм(Итого, ВыборкаДокументов.ВалютаДокумента);

		ОбластьМакета.Параметры.ИтоговаяСтрока = СтрЗаменить(ОбластьМакета.Параметры.ИтоговаяСтрока, "%Количество%", КоличествоТоваров);

		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);

	КонецЦикла;

	Если НЕ ОтчетНапечатан Тогда 
		Шаблон = МассивОбъектов[0];

		Если Шаблон.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОПродажах");
			ЭтоКомиссияПоПродаже = Истина;
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОЗакупках");
			ЭтоКомиссияПоПродаже = Ложь;
		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шаблон, НСтр("ru = 'Отчет комитенту'"));
		ТабличныйДокумент.Вывести(ОбластьМакета);

		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шаблон.Организация, Шаблон.Дата, , , , Истина);
		ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шаблон.Контрагент, Шаблон.Дата);
		ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");

		ОбластьМакета = Макет.ПолучитьОбласть("Комитент");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеКонтрагента;
		ОбластьМакета.Параметры.Поставщик               = ВыборкаДокументов.Контрагент;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеОрганизации;
		ОбластьМакета.Параметры.Получатель              = ВыборкаДокументов.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ПечататьСВидомСобытия = ЭтоКомиссияПоПродаже И НЕ Макет.Области.Найти("ВидСобытия") = Неопределено;

		Если ПечататьСВидомСобытия Тогда

			ОбластьМакета = Макет.ПолучитьОбласть("ВидСобытия");
			ТабличныйДокумент.Вывести(ОбластьМакета);

		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
		ТабличныйДокумент.ВысотаТаблицы + 1, ОбъектыПечати, Шаблон);
	КонецЕсли;

	Возврат ТабличныйДокумент;

КонецФункции


Функция ЛГС_ПечатьОтчетаКомитенту1(МассивОбъектов, ОбъектыПечати) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетКомитентуОПродажах_ОтчетКомитентуОПродажах";

	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
		ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	ВыводитьКоды = ДополнительнаяКолонкаПечатныхФормДокументов <> Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", ДополнительнаяКолонкаПечатныхФормДокументов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧПоставщики.Ссылка КАК Ссылка,
	|	ТЧПоставщики.НомерСтроки КАК НомерСтроки,
	|	ТЧПоставщики.КлючСтроки КАК КлючСтроки,
	|	ТЧПоставщики.Поставщик КАК Поставщик,
	|	ТЧПоставщики.Партия КАК Партия,
	|	ДокПоступления.Дата КАК ДатаПартии,
	|	ВЫБОР
	|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|			ТОГДА СчетФактураПолученный.Ссылка.ДатаВходящегоДокумента
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаВходящегоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|			ТОГДА СчетФактураПолученный.Ссылка.НомерВходящегоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерВходящегоСчетаФактуры,
	|	ЕСТЬNULL(ДокПоступления.ДатаВходящегоДокумента, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВходящегоДокумента,
	|	ЕСТЬNULL(ДокПоступления.НомерВходящегоДокумента, """") КАК НомерВходящегоДокумента,
	|	ТЧПоставщики.СчетФактура КАК СчетФактураВыданный,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.ПолученСФ
	|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Дата, ТЧПоставщики.ДатаСФ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаВыданногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.ПолученСФ
	|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Номер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерВыданногоСчетаФактуры
	|ПОМЕСТИТЬ ВТ_РеквизитыПартий
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ДокПоступления
	|		ПО ТЧПоставщики.Партия = ДокПоступления.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ПО (ДокПоступления.Ссылка = СчетФактураПолученный.ДокументОснование)
	|ГДЕ
	|	ТЧПоставщики.Ссылка В(&МассивОбъектов)
	|	И ТЧПоставщики.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТЧПоставщики.Ссылка,
	|	ТЧПоставщики.КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов КАК ДокументРасчетов,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Дата КАК Дата,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер КАК Номер
	|ПОМЕСТИТЬ ТаблицаСчетовФактур
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ОтчетКомитентуОПродажахТовары.ДокументРасчетов = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
	|	И НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Дата,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка,
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
	|	СчетФактураВыданный.Дата,
	|	СчетФактураВыданный.Номер
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ОтчетКомитентуОПродажахТовары.ДокументРасчетов = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
	|	И НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|	И НЕ СчетФактураВыданный.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданный.Дата,
	|	СчетФактураВыданный.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажах.Ссылка.ВидОперации КАК ВидОперации,
	|	ОтчетКомитентуОПродажах.Ссылка.Номер КАК Номер,
	|	ОтчетКомитентуОПродажах.Ссылка.Дата КАК Дата,
	|	ОтчетКомитентуОПродажах.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОтчетКомитентуОПродажах.Ссылка.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажах.Ссылка.Организация КАК Организация,
	|	ОтчетКомитентуОПродажах.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ОтчетКомитентуОПродажах.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомитентуОПродажах.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	ОтчетКомитентуОПродажах.Ссылка.СуммаВознаграждения КАК СуммаВознаграждения,
	|	ОтчетКомитентуОПродажах.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ОтчетКомитентуОПродажах.НомерСтроки КАК НомерСтроки,
	|	0 КАК НомерСтрокиПоставщики,
	|	ОтчетКомитентуОПродажах.Номенклатура КАК Товар,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомитентуОПродажах.Содержание ПОДОБНО """"
	|			ТОГДА ОтчетКомитентуОПродажах.Содержание
	|		КОГДА СправочникНоменклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА СправочникНоменклатура.Наименование
	|		ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ОтчетКомитентуОПродажах.Номенклатура.Артикул
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА ОтчетКомитентуОПродажах.Номенклатура.Код
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
	|			ТОГДА """"
	|	КОНЕЦ КАК КодАртикул,
	|	ОтчетКомитентуОПродажах.КоличествоМест КАК КоличествоМест,
	|	ОтчетКомитентуОПродажах.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ОтчетКомитентуОПродажах.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ОтчетКомитентуОПродажах.Количество КАК Количество,
	|	ОтчетКомитентуОПродажах.Цена КАК Цена,
	|	ОтчетКомитентуОПродажах.Сумма КАК Сумма,
	|	ОтчетКомитентуОПродажах.СуммаНДС КАК СуммаНДС,
	|	ОтчетКомитентуОПродажах.Покупатель КАК ПокупательПоставщик,
	|	ОтчетКомитентуОПродажах.ДатаРеализации КАК ДатаПродажи,
	|	ОтчетКомитентуОПродажах.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПартии,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоСчетаФактуры,
	|	"""" КАК НомерВходящегоСчетаФактуры,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
	|	"""" КАК НомерВходящегоДокумента,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВыданногоСчетаФактуры,
	|	"""" КАК НомерВыданногоСчетаФактуры,
	|	ОтчетКомитентуОПродажах.Покупатель КАК ПолеДляИтогов,
	|	СправочникНоменклатура.ПериодичностьУслуги КАК ПериодичностьУслуги,
	|	ОтчетКомитентуОПродажах.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаСчетовФактур.Ссылка КАК СчетФактураПокупателю,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Количество > 0
	|				И НЕ ОтчетКомитентуОПродажах.ДокументРасчетов ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ""Реализация товаров и услуг""
	|		КОГДА ОтчетКомитентуОПродажах.Количество < 0
	|				И НЕ ОтчетКомитентуОПродажах.ДокументРасчетов ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ""Возврат товаров""
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ КАК ВидСобытия,
	|	ТаблицаСчетовФактур.Номер КАК НомерСФКомиссионера,
	|	ТаблицаСчетовФактур.Дата КАК ДатаСФКомиссионера,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Количество < 0
	|				ИЛИ ОтчетКомитентуОПродажах.ДокументРасчетов ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозврат
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ОтчетКомитентуОПродажах.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК ТаблицаСчетовФактур
	|		ПО ОтчетКомитентуОПродажах.ДокументРасчетов = ТаблицаСчетовФактур.ДокументРасчетов
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуОПродажах.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахТовары.Ссылка,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Номер,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаДокумента,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ВалютаДокумента,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.СтавкаНДСВознаграждения,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознаграждения,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.ПодразделениеОрганизации,
	|	ОтчетКомитентуОПродажахТовары.НомерСтроки,
	|	ВТ_РеквизитыПартий.НомерСтроки,
	|	ОтчетКомитентуОПродажахТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомитентуОПродажахТовары.Содержание ПОДОБНО """"
	|			ТОГДА ОтчетКомитентуОПродажахТовары.Содержание
	|		КОГДА СправочникНоменклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА СправочникНоменклатура.Наименование
	|		ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ОтчетКомитентуОПродажахТовары.Номенклатура.Артикул
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА ОтчетКомитентуОПродажахТовары.Номенклатура.Код
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
	|			ТОГДА """"
	|	КОНЕЦ,
	|	ОтчетКомитентуОПродажахТовары.КоличествоМест,
	|	ОтчетКомитентуОПродажахТовары.ЕдиницаИзмерения.Представление,
	|	ОтчетКомитентуОПродажахТовары.Номенклатура.ЕдиницаИзмерения,
	|	ОтчетКомитентуОПродажахТовары.Количество,
	|	ОтчетКомитентуОПродажахТовары.Цена,
	|	ОтчетКомитентуОПродажахТовары.Сумма,
	|	ОтчетКомитентуОПродажахТовары.СуммаНДС,
	|	ЕСТЬNULL(ВТ_РеквизитыПартий.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС,
	|	ВТ_РеквизитыПартий.Партия,
	|	ВТ_РеквизитыПартий.ДатаПартии,
	|	ВТ_РеквизитыПартий.ДатаВходящегоСчетаФактуры,
	|	ВТ_РеквизитыПартий.НомерВходящегоСчетаФактуры,
	|	ВТ_РеквизитыПартий.ДатаВходящегоДокумента,
	|	ВТ_РеквизитыПартий.НомерВходящегоДокумента,
	|	ВТ_РеквизитыПартий.ДатаВыданногоСчетаФактуры,
	|	ВТ_РеквизитыПартий.НомерВыданногоСчетаФактуры,
	|	ВТ_РеквизитыПартий.Партия,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыПартий КАК ВТ_РеквизитыПартий
	|		ПО ОтчетКомитентуОПродажахТовары.КлючСтроки = ВТ_РеквизитыПартий.КлючСтроки
	|			И ОтчетКомитентуОПродажахТовары.Ссылка = ВТ_РеквизитыПартий.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ОтчетКомитентуОПродажахТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	НомерСтрокиПоставщики,
	|	ПолеДляИтогов,
	|	ОтчетКомитентуОПродажах.НомерСтроки,
	|	ЭтоВозврат,
	|	СчетФактураПокупателю
	|ИТОГИ
	|	МАКСИМУМ(Ссылка),
	|	МАКСИМУМ(ВидОперации),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(ВалютаДокумента),
	|	МАКСИМУМ(СуммаВознаграждения),
	|	МИНИМУМ(НомерСтрокиПоставщики),
	|	СУММА(КоличествоМест),
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	МАКСИМУМ(ПокупательПоставщик),
	|	МАКСИМУМ(ДатаПартии),
	|	МАКСИМУМ(ДатаВходящегоСчетаФактуры),
	|	МАКСИМУМ(НомерВходящегоСчетаФактуры),
	|	МАКСИМУМ(ДатаВходящегоДокумента),
	|	МАКСИМУМ(НомерВходящегоДокумента),
	|	МАКСИМУМ(ДатаВыданногоСчетаФактуры),
	|	МАКСИМУМ(НомерВыданногоСчетаФактуры),
	|	МАКСИМУМ(НомерСФКомиссионера),
	|	МАКСИМУМ(ДатаСФКомиссионера),
	|	МАКСИМУМ(ЭтоВозврат)
	|ПО
	|	Ссылка,
	|	ВидСобытия,
	|	ПолеДляИтогов,
	|	СчетФактураПокупателю";	

	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");

	Итого = 0;
	НомерПП = 1;

	ПервыйДокумент = Истина;

	ОтчетНапечатан = Ложь;
	Пока ВыборкаДокументов.Следующий() Цикл

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОтчетНапечатан = Истина;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Если ВыборкаДокументов.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОПродажах");
			ЭтоКомиссияПоПродаже = Истина;
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОЗакупках");
			ЭтоКомиссияПоПродаже = Ложь;
		КонецЕсли;

		// Выводим шапку накладной

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"); 
		
		
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(ВыборкаДокументов.Ссылка, НСтр("ru = 'Отчет экспедитора'"));
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаДокументов.Организация, ВыборкаДокументов.Дата, , , , Истина);
		ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаДокументов.Контрагент, ВыборкаДокументов.Дата);
		ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");

		ОбластьМакета = Макет.ПолучитьОбласть("Комитент");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеКонтрагента;
		ОбластьМакета.Параметры.Поставщик               = ВыборкаДокументов.Контрагент;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеОрганизации;
		ОбластьМакета.Параметры.Получатель              = ВыборкаДокументов.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьШапки = ?(ВыводитьКоды, "ШапкаСКодом", "ШапкаТаблицы");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
			ОбластьМакета.Параметры.ИмяКодАртикул = "Артикул";
		ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
			ОбластьМакета.Параметры.ИмяКодАртикул = "Код";
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		Итого = 0;
		НомерПП = 1;
		ОбластьСтроки = ?(ВыводитьКоды,	"СтрокаСКодом", "Строка");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);

		КоличествоТоваров = 0;

		ПечататьСВидомСобытия = ЭтоКомиссияПоПродаже И НЕ Макет.Области.Найти("ВидСобытия") = Неопределено;

		Если ПечататьСВидомСобытия Тогда

			ОбластьМакетаСобытия = Макет.ПолучитьОбласть("ВидСобытия");

		Иначе

			ОбластьМакетаСобытия = Неопределено;

		КонецЕсли;

		ВыборкаПоВидуСобытия = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидСобытия");
		Пока ВыборкаПоВидуСобытия.Следующий() Цикл

			Если ПечататьСВидомСобытия Тогда
				// Выводит вид события
				ОбластьМакетаСобытия.Параметры.ПредставлениеСобытия = ВыборкаПоВидуСобытия.ВидСобытия;
				ТабличныйДокумент.Вывести(ОбластьМакетаСобытия);
			КонецЕсли;

			ВыборкаКонтрагентов = ВыборкаПоВидуСобытия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			Пока ВыборкаКонтрагентов.Следующий() Цикл

				СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаКонтрагентов.ПокупательПоставщик, ВыборкаДокументов.Дата);
				Если ЭтоКомиссияПоПродаже Тогда
					ТекстКонтрагент = НСтр("ru = 'Покупатель: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
				Иначе
					ТекстКонтрагент = НСтр("ru = 'Поставщик: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
				КонецЕсли;
				ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' Адрес: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "ЮридическийАдрес,");
				КПП = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "КПП,", Ложь);
				Если ЗначениеЗаполнено(КПП) Тогда
					КПП = "/" + КПП;
				КонецЕсли;
				Если ЭтоКомиссияПоПродаже Тогда
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' ИНН/КПП покупателя: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "ИНН,", Ложь) + КПП;
				Иначе
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' ИНН/КПП поставщика: '") + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "ИНН,", Ложь) + КПП;
				КонецЕсли;

				// Сформируем информацию о реквизитах партии поставки.
				Если НЕ ЭтоКомиссияПоПродаже Тогда
					ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;

					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВходящегоДокумента)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВходящегоДокумента) Тогда
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Поступление от поставщика: № '") + ВыборкаКонтрагентов.НомерВходящегоДокумента 
						+ НСтр("ru = ' от '") + Формат(ВыборкаКонтрагентов.ДатаВходящегоДокумента, "ДЛФ=Д");
					Иначе
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Поступление от поставщика: № '") + Формат(ВыборкаКонтрагентов.ДатаПартии, "ДЛФ=Д");
					КонецЕсли;

					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВходящегоСчетаФактуры)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВходящегоСчетаФактуры) Тогда
						ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Получен счет-фактура поставщика: № '") + ВыборкаКонтрагентов.НомерВходящегоСчетаФактуры 
						+ НСтр("ru = ' от '") + Формат(ВыборкаКонтрагентов.ДатаВходящегоСчетаФактуры, "ДЛФ=Д");
					КонецЕсли;
										
					
					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры) Тогда

						ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Выдан счет-фактура клиенту: № '") 
						+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры, Истина, Ложь) 
						+ " от " + Формат(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры, "ДЛФ=Д");
					КонецЕсли; 
					
					
				КонецЕсли;

				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКонтрагент");
				ОбластьМакета.Параметры.ПредставлениеКонтрагента = ТекстКонтрагент;
				ТабличныйДокумент.Вывести(ОбластьМакета);

				Если ПечататьСВидомСобытия Тогда
					ОбластьМакетаДокументПоПокупателю = Макет.ПолучитьОбласть("ДокументПокупателю");
				КонецЕсли;

				ИтогоПоКонтрагенту = 0;

				ВыборкаПоСчетФактуре = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетФактураПокупателю");
				Пока ВыборкаПоСчетФактуре.Следующий() Цикл

					Если ПечататьСВидомСобытия Тогда

						ПредставлениеДокумента = ПолучитьПредставлениеДокументаВыданногоПокупателю(ВыборкаПоСчетФактуре);

						Если ЗначениеЗаполнено(ПредставлениеДокумента) Тогда 

							ОбластьМакетаДокументПоПокупателю.Параметры.ПредставлениеДокумента = ПредставлениеДокумента;
							ТабличныйДокумент.Вывести(ОбластьМакетаДокументПоПокупателю);

						КонецЕсли;

					КонецЕсли;

					ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);

					ВыборкаТоваров = ВыборкаПоСчетФактуре.Выбрать();

					Пока ВыборкаТоваров.Следующий() Цикл

						КоличествоТоваров = КоличествоТоваров + 1;

						ОбластьМакета.Параметры.Заполнить(ВыборкаТоваров);
						ОбластьМакета.Параметры.НомерСтроки = НомерПП;

						Если НЕ ВыборкаТоваров.СуммаВключаетНДС Тогда
							СуммаПоСтроке = ВыборкаТоваров.Сумма + ВыборкаТоваров.СуммаНДС;
							ОбластьМакета.Параметры.Цена = ?(ВыборкаТоваров.Количество <> 0, СуммаПоСтроке/ВыборкаТоваров.Количество, 0);
							ОбластьМакета.Параметры.Сумма = СуммаПоСтроке;
						Иначе
							СуммаПоСтроке = ВыборкаТоваров.Сумма;
						КонецЕсли;			
						ТабличныйДокумент.Вывести(ОбластьМакета);

						Итого = Итого + СуммаПоСтроке;
						НомерПП = НомерПП + 1;
						ИтогоПоКонтрагенту = ИтогоПоКонтрагенту + СуммаПоСтроке;

					КонецЦикла;	

				КонецЦикла;

				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКонтрагентИтог");
				ОбластьМакета.Параметры.Заполнить(ВыборкаКонтрагентов);
				ОбластьМакета.Параметры.Сумма = ИтогоПоКонтрагенту;
				ТабличныйДокумент.Вывести(ОбластьМакета);

			КонецЦикла;	

		КонецЦикла;

		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = Итого;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");

		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Итого, ВыборкаДокументов.ВалютаДокумента);

		ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru = 'Всего наименований %Количество%, на сумму'") + " "
		+ ОбщегоНазначенияБПВызовСервера.ФорматСумм(Итого, ВыборкаДокументов.ВалютаДокумента);

		ОбластьМакета.Параметры.ИтоговаяСтрока = СтрЗаменить(ОбластьМакета.Параметры.ИтоговаяСтрока, "%Количество%", КоличествоТоваров);

		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);

	КонецЦикла;

	Если НЕ ОтчетНапечатан Тогда 
		Шаблон = МассивОбъектов[0];

		Если Шаблон.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОПродажах");
			ЭтоКомиссияПоПродаже = Истина;
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ПФ_MXL_ОтчетКомитентуОЗакупках");
			ЭтоКомиссияПоПродаже = Ложь;
		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шаблон, НСтр("ru = 'Отчет комитенту'"));
		ТабличныйДокумент.Вывести(ОбластьМакета);

		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шаблон.Организация, Шаблон.Дата, , , , Истина);
		ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шаблон.Контрагент, Шаблон.Дата);
		ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");

		ОбластьМакета = Макет.ПолучитьОбласть("Комитент");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеКонтрагента;
		ОбластьМакета.Параметры.Поставщик               = ВыборкаДокументов.Контрагент;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеОрганизации;
		ОбластьМакета.Параметры.Получатель              = ВыборкаДокументов.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ПечататьСВидомСобытия = ЭтоКомиссияПоПродаже И НЕ Макет.Области.Найти("ВидСобытия") = Неопределено;

		Если ПечататьСВидомСобытия Тогда

			ОбластьМакета = Макет.ПолучитьОбласть("ВидСобытия");
			ТабличныйДокумент.Вывести(ОбластьМакета);

		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
		ТабличныйДокумент.ВысотаТаблицы + 1, ОбъектыПечати, Шаблон);
	КонецЕсли;

	Возврат ТабличныйДокумент;

КонецФункции