
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	
	Если ЭтотОбъект.РежимРасшифровки Тогда
		//	
		СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("Макет"); 	
		//	
	Иначе	 
		//	
		СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		//	 
	КонецЕсли; 
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки; 
	//НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки(); 
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",НачалоДня(ЭтотОбъект.НачалоПериода));
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания",КонецДня(ЭтотОбъект.КонецПериода)); 

	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация",ЭтотОбъект.Организация);

	
	Если ЭтотОбъект.РежимРасшифровки Тогда
			
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Номенклатура",ЭтотОбъект.Номенклатура);
		
		КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", "Расшифровка по номенклатуре " + ЭтотОбъект.Номенклатура.Наименование + " с " 
					+ Формат(ЭтотОбъект.НачалоПериода,"ДФ='dd.MM.yyyy г.'") + " по " + Формат(ЭтотОбъект.КонецПериода,"ДФ='dd.MM.yyyy г.'"));
		
	КонецЕсли; 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	

КонецПроцедуры
