&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрКоманды);
	
	ОбъектыПечати = Новый СписокЗначений; 
	ИмяМакета = "ПриложениеКДоговору"; 
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПриложениеКДоговору");
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Приложение к договору"; 
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуПриложениеКДоговору(МассивОбъектов, ОбъектыПечати, ИмяМакета); 
	
	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуПриложениеКДоговору(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриложениеКДоговору"; 
	ТабличныйДокумент.Защита = Истина;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументПриложениеКДоговору(ТабличныйДокумент, МассивОбъектов[0]); 	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументПриложениеКДоговору(ТабДок, Док)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПриложениеКДоговору";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	|	ПоручениеЭкспедитору.Номер КАК Номер,
	|	ПоручениеЭкспедитору.Дата КАК Дата,
	|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	|	ПоручениеЭкспедитору.Договор КАК Договор,
	|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Должность КАК ДолжностьРуководителя,
	|	ПоручениеЭкспедитору.НомерПриложения КАК НомерПриложения,
	|	ПоручениеЭкспедитору.ДатаПриложения КАК ДатаПриложения,
	|	ПоручениеЭкспедитору.ПунктНазначения КАК ПунктНазначения,
	|	ПоручениеЭкспедитору.ПунктОтправления КАК ПунктОтправления
	|ИЗ
	|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	|ГДЕ
	|	ПоручениеЭкспедитору.Ссылка = &Док";
	
	Запрос.УстановитьПараметр("Док", Док);
	
	МассивРезультатов = Запрос.Выполнить();
	
	Выборка = МассивРезультатов.Выбрать();   
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.ПриложениеКДоговору");
	
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Выборка.Экспедитор, Выборка.Ссылка.Дата, Неопределено);
		ОбластьМакета.Параметры.ДолжностьРуководителяЭкспедитора = СклонениеПредставленийОбъектов.ПросклонятьФИО(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление, 2,,1);
		ОбластьМакета.Параметры.ФИОРуководителяЭкспедитора = ОтветственныеЛицаОрганизации.РуководительПредставление; 
		ОбластьМакета.Параметры.Экспедитор = Выборка.Экспедитор.НаименованиеСокращенное;	
		ОбластьМакета.Параметры.НомерДоговора = Выборка.НомерДоговора;
		ОбластьМакета.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=ДД");
				
		Если ЗначениеЗаполнено(Выборка.НомерПриложения) Тогда
			
			ОбластьМакета.Параметры.НомерПриложения = Выборка.НомерПриложения;	
			
		Иначе 
			
			ОбластьМакета.Параметры.НомерПриложения = Выборка.Номер;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаПриложения) Тогда
			
			ОбластьМакета.Параметры.ДатаДокумента = Формат(Выборка.ДатаПриложения, "ДЛФ=ДД");
			
		Иначе
			
			ОбластьМакета.Параметры.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=ДД"); 
			
		КонецЕсли;

		ОбластьМакета.Параметры.Клиент = Выборка.Клиент;
		ОбластьМакета.Параметры.ФИОРуководителя = СклонениеПредставленийОбъектов.ПросклонятьФИО(Выборка.Клиент.ОсновноеКонтактноеЛицо.Фамилия + " " + Выборка.Клиент.ОсновноеКонтактноеЛицо.Имя + " " + Выборка.Клиент.ОсновноеКонтактноеЛицо.Отчество, 2);
		ОбластьМакета.Параметры.ДолжностьРуководителя = СклонениеПредставленийОбъектов.ПросклонятьФИО(Выборка.ДолжностьРуководителя, 2,,1); //Выборка.Клиент;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Пункт1"); 
		
		Маршрут = ПолучитьМаршрут(Выборка.Ссылка);
		//Выборка.ПунктОтправления + " - " + Выборка.ПунктНазначения; 
		
		ОбластьМакета.Параметры.Маршрут = Маршрут;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Для каждого Стр ИЗ Док.СоставНоменклатуры Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
			СтрокаПункта = "- " + Строка(Стр.Содержание) + " - " + Строка(Стр.Сумма) + " " + Строка(Стр.Валюта);
			Если Стр.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
				СтрокаПункта = СтрокаПункта + ", в т.ч. НДС " + Строка(Стр.СтавкаНДС) + " " + Строка(Стр.СуммаНДС) + " " + Строка(Стр.Валюта);
			Иначе
				СтрокаПункта = СтрокаПункта + ", " + Строка(Стр.СтавкаНДС);
				
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.Дополнительно) Тогда
				СтрокаПункта = СтрокаПункта + " - " + Строка(Стр.Дополнительно) + Символы.ПС;
			Иначе
				СтрокаПункта = СтрокаПункта + Символы.ПС;
			КонецЕсли;
			ОбластьМакета.Параметры.ПунктИзм = СтрокаПункта;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		Если Выборка.Ссылка.ИзменяемоеСодержимоеПриложения.Количество() > 0 Тогда
			
			Для Сч = 1 по 6 Цикл
				
				Отбор = Новый Структура();
				Отбор.Вставить("Пункт", Сч);
				НайденноеЗначение = Выборка.Ссылка.ИзменяемоеСодержимоеПриложения.НайтиСтроки(Отбор);
				
				Если НайденноеЗначение.Количество() > 0 Тогда
					Если Сч = 2 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "2. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 3 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "3. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 4 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "4. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 5 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "5. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 6 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ПунктИзм");
						ОбластьМакета.Параметры.ПунктИзм = "6. " + Строка(НайденноеЗначение[0].Содержимое);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
				Иначе
					Если Сч = 2 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Пункт2");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 3 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Пункт3");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 4 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Пункт4");
						ОбластьМакета.Параметры.КонецМесяца = Формат(КонецМесяца(Выборка.Дата),"ДФ='dd.MM.yyyy""г.""'");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					Если Сч = 5 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Пункт5");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
					
				КонецЕсли;
										
			КонецЦикла;
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("Пункт2");
			ТабличныйДокумент.Вывести(ОбластьМакета);
				
			ОбластьМакета = Макет.ПолучитьОбласть("Пункт3");
			ТабличныйДокумент.Вывести(ОбластьМакета);
				
			ОбластьМакета = Макет.ПолучитьОбласть("Пункт4");
			ОбластьМакета.Параметры.КонецМесяца = Формат(КонецМесяца(Выборка.Дата),"ДФ='dd.MM.yyyy""г.""'");
			ТабличныйДокумент.Вывести(ОбластьМакета);
				
			ОбластьМакета = Макет.ПолучитьОбласть("Пункт5");
			ТабличныйДокумент.Вывести(ОбластьМакета);				
				
		КонецЕсли;
				
		ОбластьМакета = Макет.ПолучитьОбласть("Пункт6");
		ОбластьМакета.Параметры.НомерДоговора = Выборка.НомерДоговора;
		ОбластьМакета.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=ДД");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал"); 
		ОбластьМакета.Параметры.ФИОРуководителяЭкспедитора = ОтветственныеЛицаОрганизации.РуководительПредставление; 
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
		
КонецФункции 

&НаСервере
Функция ПолучитьМаршрут(Док)
	
	Если ЗначениеЗаполнено(Док.ДокументОснование) Тогда
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Направление");
		
		Для Каждого Стр Из Док.ДокументОснование.ИнформацияОПеревозчиках Цикл
			
			СтрТЗ = ТЗ.Добавить();
			СтрТЗ.Направление = Стр.Направление;
			
		КонецЦикла; 
		
		ТЗ.Свернуть("Направление"); 
		
		Маршрут = "";
		
		Для Каждого СтрТЗ Из ТЗ Цикл
			
			Если Маршрут = "" Тогда
				
				Если СтрНайти(Строка(СтрТЗ.Направление), "Новороссийск") > 0  Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Маршрут = Строка(Док.ДокументОснование.ПортОтгрузки) + " - " + СтрТЗ.Направление;
				
			Иначе
				
				Если СтрНайти(Строка(СтрТЗ.Направление), "Новороссийск") > 0 Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Маршрут = Маршрут + ", " + Строка(Док.ДокументОснование.ПортОтгрузки) + " - " + СтрТЗ.Направление;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Маршрут;
	
КонецФункции
