
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(ЭтотОбъект.Номер) Тогда
		
		ЭтотОбъект.Номер = ПолучитьНовыйНомер();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНовыйНомер()
	
	ПрефиксДляСделок = ЛогистикаСервер.ПолучитьПрефиксДляСделки(ЭтотОбъект.Вид);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПРАВ(Сделка.Номер, ДЛИНАСТРОКИ(Сделка.Номер) - 1) КАК Номер
	               |ИЗ
	               |	Документ.Сделка КАК Сделка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сделка.Номер УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Выборка = Запрос.Выполнить().Выгрузить();   
	
	Выборка.Колонки.Добавить("НомерЧисло");
	
	Для Каждого Стр Из Выборка Цикл
		
		Стр.НомерЧисло = Число(Стр.Номер);
		
	КонецЦикла;
	
	Выборка.Сортировать("НомерЧисло УБЫВ"); 
	
	Если Выборка.Количество() > 0 Тогда
		
		
		НомерДок = ПрефиксДляСделок + Формат(Выборка[0].НомерЧисло + 1,"ЧЦ=5; ЧВН=; ЧГ=0");
		
	Иначе
		
		НомерДок = ПрефиксДляСделок + "00001";
		
	КонецЕсли;
	
	Возврат НомерДок;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	НЗ = РегистрыСведений.ДанныеСделокДляВыводаВСписках.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Сделка.Установить(ЭтотОбъект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись ИЗ НЗ Цикл
			
			Запись.Сделка = ЭтотОбъект.Ссылка;
			
			СтруктураПараметров = РассчитатьПоказателиДляВыводаВСписках();
			
			Запись.РазмерКонтейнера = СтруктураПараметров.РазмерКонтейнера;
			Запись.ТипКонтейнера = СтруктураПараметров.ТипКонтейнера;
			Запись.Контейнер = СтруктураПараметров.Контейнер;
			Запись.Количество = СтруктураПараметров.Количество;
			Запись.ДатаВыгрузкиСуднаДО = СтруктураПараметров.ДатаВыгрузкиСуднаДО;
			Запись.ДатаОкончанияДействияРелиза = СтруктураПараметров.ДатаОкончанияДействияРелиза;
			Запись.ДатаВывозаИзПорта = СтруктураПараметров.ДатаВывозаИзПорта;
			Запись.ДатаВыгрузкиУКлиента = СтруктураПараметров.ДатаВыгрузкиУКлиента;
			Запись.ДатаСдачиПорожнегоКонтейнера = СтруктураПараметров.ДатаСдачиПорожнегоКонтейнера;
			Запись.Вес = СтруктураПараметров.Вес;
			Запись.ДатаПолученияПорожнего = СтруктураПараметров.ДатаПолученияПорожнего;
			Запись.ДатаCutOff = СтруктураПараметров.ДатаCutOff;
			Запись.ДатаETD = СтруктураПараметров.ДатаETD;
			Запись.ПеревозчикВозвратВовремя = СтруктураПараметров.ПеревозчикВозвратВовремя;
			Запись.ТТН = СтруктураПараметров.ТТН;
			Запись.ПеревозчикАвтотранспорт = СтруктураПараметров.ПеревозчикАвтотранспорт;
			
		КонецЦикла;
		
	НЗ.Записать();	
		
	Иначе
		
		Запись = РегистрыСведений.ДанныеСделокДляВыводаВСписках.СоздатьМенеджерЗаписи(); 
		
		Запись.Сделка = ЭтотОбъект.Ссылка; 
		
		СтруктураПараметров = РассчитатьПоказателиДляВыводаВСписках();
		
		Запись.РазмерКонтейнера = СтруктураПараметров.РазмерКонтейнера;
		Запись.ТипКонтейнера = СтруктураПараметров.ТипКонтейнера;
		Запись.Контейнер = СтруктураПараметров.Контейнер;
		Запись.Количество = СтруктураПараметров.Количество;
		Запись.ДатаВыгрузкиСуднаДО = СтруктураПараметров.ДатаВыгрузкиСуднаДО;
		Запись.ДатаОкончанияДействияРелиза = СтруктураПараметров.ДатаОкончанияДействияРелиза;
		Запись.ДатаВывозаИзПорта = СтруктураПараметров.ДатаВывозаИзПорта;
		Запись.ДатаВыгрузкиУКлиента = СтруктураПараметров.ДатаВыгрузкиУКлиента;
		Запись.ДатаСдачиПорожнегоКонтейнера = СтруктураПараметров.ДатаСдачиПорожнегоКонтейнера;
		Запись.Вес = СтруктураПараметров.Вес;
		Запись.ДатаПолученияПорожнего = СтруктураПараметров.ДатаПолученияПорожнего;
		Запись.ДатаCutOff = СтруктураПараметров.ДатаCutOff;
		Запись.ДатаETD = СтруктураПараметров.ДатаETD; 
		Запись.ПеревозчикАвтотранспорт = СтруктураПараметров.ПеревозчикАвтотранспорт;
		Запись.ПеревозчикВозвратВовремя = СтруктураПараметров.ПеревозчикВозвратВовремя;
		Запись.ТТН = СтруктураПараметров.ТТН;
		
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьПоказателиДляВыводаВСписках() 
		
		Строка = Новый Структура;
		Строка.Вставить("Контейнер");
		Строка.Вставить("Вес");
		Строка.Вставить("ТипКонтейнера");
		Строка.Вставить("РазмерКонтейнера");
		Строка.Вставить("Количество");
		Строка.Вставить("Ссылка");
		Строка.Вставить("ДатаВыгрузкиСуднаДО");
		Строка.Вставить("ДатаОкончанияДействияРелиза");
		Строка.Вставить("ДатаВывозаИзПорта");
		Строка.Вставить("ДатаВыгрузкиУКлиента");
		Строка.Вставить("ДатаСдачиПорожнегоКонтейнера");
		Строка.Вставить("ДатаПолученияПорожнего");
		Строка.Вставить("ДатаCutOff");
		Строка.Вставить("ДатаETD");
		Строка.Вставить("ПеревозчикАвтотранспорт");
		Строка.Вставить("ПеревозчикВозвратВовремя");
		Строка.Вставить("ТТН");
		
		Контейнер = "";
		Вес = "";
		ТипКонтейнера = "";
		РазмерКонтейнера = ""; 
		ДатаВыгрузкиСуднаДО = "";
		ДатаОкончанияДействияРелиза = "";
		ДатаВывозаИзПорта = "";
		ДатаВыгрузкиУКлиента = "";
		ДатаСдачиПорожнегоКонтейнера = "";
		ДатаПолученияПорожнего = "";
		ДатаCutOff = "";
		ДатаETD = "";
		ПеревозчикАвтотранспорт = "";
		
		Количество = ЭтотОбъект.Контейнеры.Количество(); 
		
		РазмерыКонтейнеровОдинаковые = Истина;
        ТипыКонтейнеровОдинаковые = Истина;
		ПеревозчикиКонтейнеровОдинаковые = Истина; 
		ПеревозчикВозвратВовремяОдинаковые = Истина;
		ТТНОдинаковые = Истина;
		
		Если Количество > 0 Тогда
			
			ПараметрыОтбора = Новый Структура("Размер", ЭтотОбъект.Контейнеры[0].Размер);
			
			НайденныеСтроки = ЭтотОбъект.Контейнеры.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() <> Количество Тогда
				
				РазмерыКонтейнеровОдинаковые = Ложь;
				
			КонецЕсли;
			
			ПараметрыОтбора = Новый Структура("Тип", ЭтотОбъект.Контейнеры[0].Тип);
			
			НайденныеСтроки = ЭтотОбъект.Контейнеры.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() <> Количество Тогда
				
				ТипыКонтейнеровОдинаковые = Ложь;
				
			КонецЕсли; 
			
			ПараметрыОтбора = Новый Структура("ПеревозчикАвтотранспорт", ЭтотОбъект.Контейнеры[0].ПеревозчикАвтотранспорт);
			
			НайденныеСтроки = ЭтотОбъект.Контейнеры.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() <> Количество Тогда
				
				ПеревозчикиКонтейнеровОдинаковые = Ложь;
				
			КонецЕсли; 
			
			ПараметрыОтбора = Новый Структура("ТТН", ЭтотОбъект.Контейнеры[0].ТТН);
			
			НайденныеСтроки = ЭтотОбъект.Контейнеры.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() <> Количество Тогда
				
				ТТНОдинаковые = Ложь;
				
			КонецЕсли;
			
			ПараметрыОтбора = Новый Структура("ПеревозчикВозвратВовремя", ЭтотОбъект.Контейнеры[0].ПеревозчикВозвратВовремя);
			
			НайденныеСтроки = ЭтотОбъект.Контейнеры.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() <> Количество Тогда
				
				ПеревозчикВозвратВовремяОдинаковые = Ложь;
				
			КонецЕсли;
			
			Если РазмерыКонтейнеровОдинаковые Тогда
				
				Строка.РазмерКонтейнера = ЭтотОбъект.Контейнеры[0].Размер; 
								
			КонецЕсли;
			
			Если ТипыКонтейнеровОдинаковые Тогда
				
				Строка.ТипКонтейнера = ЭтотОбъект.Контейнеры[0].Тип;
				
			КонецЕсли;
			
			Если ПеревозчикиКонтейнеровОдинаковые Тогда
				
				Строка.ПеревозчикАвтотранспорт = ЭтотОбъект.Контейнеры[0].ПеревозчикАвтотранспорт;
				
			КонецЕсли;
			
			Если ПеревозчикВозвратВовремяОдинаковые Тогда
				
				Строка.ПеревозчикВозвратВовремя = ?(ЭтотОбъект.Контейнеры[0].ПеревозчикВозвратВовремя, "✔", "❌");
				
			КонецЕсли;
			
			Если ТТНОдинаковые Тогда
				
				Строка.ТТН = ?(ЭтотОбъект.Контейнеры[0].ТТН, "✔", "❌");
				
			КонецЕсли;
						
			Для Каждого Стр Из ЭтотОбъект.Контейнеры Цикл
				
				Если Стр.НомерСтроки = 1 Тогда
					
					Контейнер = Строка(Стр.Контейнер);
					
					Вес = Формат(Стр.Вес, "ЧДЦ=3"); 
					
					Если РазмерыКонтейнеровОдинаковые = Ложь Тогда
						
						Строка.РазмерКонтейнера = Строка(Стр.Размер);
						
					КонецЕсли; 
					
					Если ТипыКонтейнеровОдинаковые = Ложь Тогда
						
						Строка.ТипКонтейнера = Строка(Стр.Тип);
						
					КонецЕсли; 
					
					Если ПеревозчикиКонтейнеровОдинаковые = Ложь Тогда
						
						Строка.ПеревозчикАвтотранспорт = Строка(Стр.ПеревозчикАвтотранспорт);
						
					КонецЕсли;
					
					Если ПеревозчикВозвратВовремяОдинаковые = Ложь Тогда
						
						Строка.ПеревозчикВозвратВовремя = ?(ЭтотОбъект.Контейнеры[0].ПеревозчикВозвратВовремя, "✔", "❌");
						
					КонецЕсли;
	
					Если ТТНОдинаковые = Ложь Тогда
						
						Строка.ТТН = ?(ЭтотОбъект.Контейнеры[0].ТТН, "✔", "❌");
						
					КонецЕсли; 
					
					ДатаВыгрузкиСуднаДО = ?(ЗначениеЗаполнено(Стр.ДатаВыгрузкиСуднаДО),Формат(Стр.ДатаВыгрузкиСуднаДО,"ДФ=dd.MM.yy"), "");
					ДатаОкончанияДействияРелиза = ?(ЗначениеЗаполнено(Стр.ДатаОкончанияДействияРелиза),Формат(Стр.ДатаОкончанияДействияРелиза,"ДФ=dd.MM.yy"), "");
					ДатаВывозаИзПорта = ?(ЗначениеЗаполнено(Стр.ДатаВывозаИзПорта),Формат(Стр.ДатаВывозаИзПорта,"ДФ=dd.MM.yy"), "");
					ДатаВыгрузкиУКлиента = ?(ЗначениеЗаполнено(Стр.ДатаВыгрузкиУКлиента),Формат(Стр.ДатаВыгрузкиУКлиента,"ДФ=dd.MM.yy"), "");
					ДатаСдачиПорожнегоКонтейнера = ?(ЗначениеЗаполнено(Стр.ДатаСдачиПорожнегоКонтейнера),Формат(Стр.ДатаСдачиПорожнегоКонтейнера,"ДФ=dd.MM.yy"), "");
					ДатаПолученияПорожнего = ?(ЗначениеЗаполнено(Стр.ДатаПолученияПорожнего),Формат(Стр.ДатаПолученияПорожнего,"ДФ=dd.MM.yy"), "");
					ДатаCutOff = ?(ЗначениеЗаполнено(Стр.ДатаCutOff),Формат(Стр.ДатаCutOff,"ДФ=dd.MM.yy"), "");
					ДатаETD = ?(ЗначениеЗаполнено(Стр.ДатаETD),Формат(Стр.ДатаETD,"ДФ=dd.MM.yy"), "");
						
				Иначе
					
					Контейнер = Контейнер + Символы.ПС + Строка(Стр.Контейнер);
					
					Вес = Вес + Символы.ПС + Формат(Стр.Вес, "ЧДЦ=3");
					
					Если РазмерыКонтейнеровОдинаковые = Ложь Тогда
						
						Строка.РазмерКонтейнера = Строка.РазмерКонтейнера + Символы.ПС + Стр.Размер;
						
					КонецЕсли; 
					
					Если ТипыКонтейнеровОдинаковые = Ложь Тогда
						
						Строка.ТипКонтейнера = Строка.ТипКонтейнера + Символы.ПС + Стр.Тип;
						
					КонецЕсли; 
					
					Если ПеревозчикиКонтейнеровОдинаковые = Ложь Тогда
						
						Строка.ПеревозчикАвтотранспорт = Строка.ПеревозчикАвтотранспорт + Символы.ПС + Строка(Стр.ПеревозчикАвтотранспорт);
						
					КонецЕсли;
					
					Если ПеревозчикВозвратВовремяОдинаковые = Ложь Тогда
						
						Строка.ПеревозчикВозвратВовремя = Строка.ПеревозчикВозвратВовремя + Символы.ПС + ?(ЭтотОбъект.Контейнеры[0].ПеревозчикВозвратВовремя, "✔", "❌");
						
					КонецЕсли;
	
					Если ТТНОдинаковые = Ложь Тогда
						
						Строка.ТТН = Строка.ТТН + Символы.ПС + ?(ЭтотОбъект.Контейнеры[0].ТТН, "✔", "❌");
						
					КонецЕсли;
					
					Если НЕ (РазмерыКонтейнеровОдинаковые И ТипыКонтейнеровОдинаковые) Тогда
						
						Количество = Количество + Символы.ПС + "1";
						
					КонецЕсли;  
					
					ДатаВыгрузкиСуднаДО = ДатаВыгрузкиСуднаДО + Символы.ПС + ?(ЗначениеЗаполнено(Стр.ДатаВыгрузкиСуднаДО),Формат(Стр.ДатаВыгрузкиСуднаДО,"ДФ=dd.MM.yy"), "");
					ДатаОкончанияДействияРелиза = ДатаОкончанияДействияРелиза + Символы.ПС + ?(ЗначениеЗаполнено(Стр.ДатаОкончанияДействияРелиза),Формат(Стр.ДатаОкончанияДействияРелиза,"ДФ=dd.MM.yy"), "");
					ДатаВывозаИзПорта = ДатаВывозаИзПорта + Символы.ПС + ?(ЗначениеЗаполнено(Стр.ДатаВывозаИзПорта),Формат(Стр.ДатаВывозаИзПорта,"ДФ=dd.MM.yy"), "");
					ДатаВыгрузкиУКлиента = ДатаВыгрузкиУКлиента + Символы.ПС + ?(ЗначениеЗаполнено(Стр.ДатаВыгрузкиУКлиента),Формат(Стр.ДатаВыгрузкиУКлиента,"ДФ=dd.MM.yy"), "");
					ДатаСдачиПорожнегоКонтейнера = ДатаСдачиПорожнегоКонтейнера + Символы.ПС + ?(ЗначениеЗаполнено(Стр.ДатаСдачиПорожнегоКонтейнера),Формат(Стр.ДатаСдачиПорожнегоКонтейнера,"ДФ=dd.MM.yy"), "");
					ДатаПолученияПорожнего = ДатаПолученияПорожнего + Символы.ПС + ?(ЗначениеЗаполнено(Стр.ДатаПолученияПорожнего),Формат(Стр.ДатаПолученияПорожнего,"ДФ=dd.MM.yy"), "");
				    ДатаCutOff = ДатаCutOff + Символы.ПС + ?(ЗначениеЗаполнено(Стр.ДатаCutOff),Формат(Стр.ДатаCutOff,"ДФ=dd.MM.yy"), "");
				    ДатаETD = ДатаETD + Символы.ПС + ?(ЗначениеЗаполнено(Стр.ДатаETD),Формат(Стр.ДатаETD,"ДФ=dd.MM.yy"), "");
				
				КонецЕсли;
				
			КонецЦикла;
	
		КонецЕсли;  		
		
		Строка.Контейнер = Контейнер;
		Строка.Вес = Вес;
		Строка.Количество = Строка(Количество); 
		Строка.ДатаВыгрузкиСуднаДО = ДатаВыгрузкиСуднаДО;
		Строка.ДатаОкончанияДействияРелиза = ДатаОкончанияДействияРелиза;
		Строка.ДатаВывозаИзПорта = ДатаВывозаИзПорта;
		Строка.ДатаВыгрузкиУКлиента = ДатаВыгрузкиУКлиента;
		Строка.ДатаСдачиПорожнегоКонтейнера = ДатаСдачиПорожнегоКонтейнера;
		Строка.ДатаПолученияПорожнего = ДатаПолученияПорожнего;
		Строка.ДатаCutOff = ДатаCutOff;
		Строка.ДатаETD = ДатаETD;
			
	Возврат Строка;

КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если НЕ ЗначениеЗаполнено(АдресПогрузки) ИЛИ НЕ ЗначениеЗаполнено(КонтактНаПогрузке) ИЛИ НЕ ЗначениеЗаполнено(КонтактНаВыгрузке) ИЛИ
	//	НЕ ЗначениеЗаполнено(КлассОпасности) ИЛИ НЕ ЗначениеЗаполнено(ВесБрутто) Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю();
	//	Сообщение.Текст = "Не заполнены все обязательные реквизиты";
	//	Сообщение.Поле = "Покупатель";
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	
	//	Сообщение.Сообщить();		 
	//КонецЕсли;	 

КонецПроцедуры
