
&ИзменениеИКонтроль("ПечатьДокументовПриСозданииНаСервере")
Процедура ЛГС_ПечатьДокументовПриСозданииНаСервере(Форма, ДокументыДляПечати)

	Если ДокументыДляПечати.Количество() = 1
		И ТипЗнч(ДокументыДляПечати[0]) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Элементы = Форма.Элементы;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КнопкаОтправить", "Видимость", Ложь);
		Родитель = Элементы.Найти("ГруппаСохранитьОтправить");
		Если Родитель = Неопределено Тогда
			Родитель = Элементы.Найти("ГруппаКоманднаяПанель");
		КонецЕсли;

		ДобавитьКомандыОтправкиДляФормыПечати(Форма, Родитель);
    #Вставка
ИначеЕсли СтрНайти(ВРег(Форма.ИменаМакетов), "ДОГОВОР ТЭО") > 0 ИЛИ СтрНайти(ВРег(Форма.ИменаМакетов), "ДОГОВОР ТП") > 0 Тогда
	
	Элементы = Форма.Элементы;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КнопкаОтправить", "Видимость", Ложь);
	Родитель = Элементы.Найти("ГруппаСохранитьОтправить");
	Если Родитель = Неопределено Тогда
		Родитель = Элементы.Найти("ГруппаКоманднаяПанель");
	КонецЕсли;
	
	ДобавитьКомандыОтправкиДляФормыПечати(Форма, Родитель);
	
	#КонецВставки
	КонецЕсли;

	МобильныйКлиентАдаптацияФормы(Форма);

КонецПроцедуры
