
&НаКлиенте
Процедура ЛГС_ВидПриИзмененииПосле(Элемент)
	
	Если ЭтотОбъект.Вид = "ОбособленноеПодразделение" Тогда
		 Элементы.ЛГС_ГоловнойЗаказчик.Видимость = Ложь;
	Иначе
		 Элементы.ЛГС_ГоловнойЗаказчик.Видимость = Истина;
	КонецЕсли;	
		
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	ЕстьТелефон = Ложь;
	ЕстьЭлектроннаяПочта = Ложь;
	ЕстьЭлектроннаяПочтаДляРассылкиСтатусовСделки = Ложь;
	ЕстьЭлектроннаяПочтаДляРассылкиСчетов = Ложь;
	
	СтруктураПроверкиКонтактнойИнформации = Новый Структура;
	СтруктураПроверкиКонтактнойИнформации.Вставить("ПроверкаПройденаУспешно", Истина);
	СтруктураПроверкиКонтактнойИнформации.Вставить("ТекстОшибки", "Вам запрещено записывать контрагента без указания:");
	
	Если ЗначениеЗаполнено(ЭтотОбъект.КонтактнаяИнформацияПолеEmailКонтрагенты) Тогда
		
		ЕстьЭлектроннаяПочта = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.КонтактнаяИнформацияПолеТелефонКонтрагента) Тогда
		
		ЕстьТелефон = Истина;
				
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Вычислить("ЭтотОбъект.КонтактнаяИнформацияПоле" + СтрЗаменить(Строка(Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Email для отправки счетов").УникальныйИдентификатор()), "-", "x") + "1")) Тогда
		
		ЕстьЭлектроннаяПочтаДляРассылкиСчетов = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Вычислить("ЭтотОбъект.КонтактнаяИнформацияПоле" + СтрЗаменить(Строка(Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Email для отправки статусов сделки").УникальныйИдентификатор()), "-", "x") + "1")) Тогда
		
		ЕстьЭлектроннаяПочтаДляРассылкиСтатусовСделки = Истина;
		
	КонецЕсли;
	
	Если НЕ ЛогистикаСервер.ЕстьРоль("ЛогистикаБухгалтер") И НЕ ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") Тогда
		
		Если НЕ ЕстьТелефон Тогда
			
			СтруктураПроверкиКонтактнойИнформации.ТекстОшибки = СтруктураПроверкиКонтактнойИнформации.ТекстОшибки + ", " + "Номера телефона";
			СтруктураПроверкиКонтактнойИнформации.ПроверкаПройденаУспешно = Ложь;
			
		КонецЕсли;
		
		Если НЕ ЕстьЭлектроннаяПочта Тогда
			
			СтруктураПроверкиКонтактнойИнформации.ТекстОшибки = СтруктураПроверкиКонтактнойИнформации.ТекстОшибки + ", " + "Электронной почты";
			СтруктураПроверкиКонтактнойИнформации.ПроверкаПройденаУспешно = Ложь;
			
		КонецЕсли; 
		
		Если НЕ ЕстьЭлектроннаяПочтаДляРассылкиСтатусовСделки Тогда
			
			СтруктураПроверкиКонтактнойИнформации.ТекстОшибки = СтруктураПроверкиКонтактнойИнформации.ТекстОшибки + ", " + "Электронной почты для рассылки статусов сделки";
			СтруктураПроверкиКонтактнойИнформации.ПроверкаПройденаУспешно = Ложь;
			
		КонецЕсли;
		
		Если НЕ ЕстьЭлектроннаяПочтаДляРассылкиСчетов Тогда
			
			СтруктураПроверкиКонтактнойИнформации.ТекстОшибки = СтруктураПроверкиКонтактнойИнформации.ТекстОшибки + ", " + "Электронной почты для рассылки счетов";
			СтруктураПроверкиКонтактнойИнформации.ПроверкаПройденаУспешно = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли ЛогистикаСервер.ЕстьРоль("ЛогистикаБухгалтер") ИЛИ ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") Тогда
		
		Если НЕ Объект.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Поставщики") Тогда
			
			Если НЕ ЕстьТелефон Тогда
				
				СтруктураПроверкиКонтактнойИнформации.ТекстОшибки = СтруктураПроверкиКонтактнойИнформации.ТекстОшибки + ", " + "Номера телефона";
				СтруктураПроверкиКонтактнойИнформации.ПроверкаПройденаУспешно = Ложь;
				
			КонецЕсли;
			
			Если НЕ ЕстьЭлектроннаяПочта Тогда
				
				СтруктураПроверкиКонтактнойИнформации.ТекстОшибки = СтруктураПроверкиКонтактнойИнформации.ТекстОшибки + ", " + "Электронной почты";
				СтруктураПроверкиКонтактнойИнформации.ПроверкаПройденаУспешно = Ложь;
				
			КонецЕсли; 
			
			Если НЕ ЕстьЭлектроннаяПочтаДляРассылкиСтатусовСделки Тогда
				
				СтруктураПроверкиКонтактнойИнформации.ТекстОшибки = СтруктураПроверкиКонтактнойИнформации.ТекстОшибки + ", " + "Электронной почты для рассылки статусов сделки";
				СтруктураПроверкиКонтактнойИнформации.ПроверкаПройденаУспешно = Ложь;
				
			КонецЕсли;
			
			Если НЕ ЕстьЭлектроннаяПочтаДляРассылкиСчетов Тогда
				
				СтруктураПроверкиКонтактнойИнформации.ТекстОшибки = СтруктураПроверкиКонтактнойИнформации.ТекстОшибки + ", " + "Электронной почты для рассылки счетов";
				СтруктураПроверкиКонтактнойИнформации.ПроверкаПройденаУспешно = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ СтруктураПроверкиКонтактнойИнформации.ПроверкаПройденаУспешно Тогда
		
		 Сообщить(СтруктураПроверкиКонтактнойИнформации.ТекстОшибки);
		 
		 Отказ = Истина;
		 
		 Возврат;
		
	КонецЕсли;	
		
КонецПроцедуры
