
&ИзменениеИКонтроль("ПодготовитьДанныеДляЗаполнения")
Процедура ЛГС_ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища)

	УстановитьПривилегированныйРежим(Истина);
	СтруктураДанныхЗаполнения = Новый Структура();
	СтруктураДанныхЗаполнения.Вставить("Успешно", Ложь);

	Если НЕ ПроверитьОтложенныеРасчеты(СтруктураПараметров) Тогда
		ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);
		Возврат;
	КонецЕсли;

	// Подготовим переменные
	СчетаИсключения             = СчетаИсключения();
	ТаблицаПоДаннымОрганизации = НовыйТаблицаДокументов();
	КэшМетаданных              = Новый Соответствие; // Используется для получения представления документов
	Запрос = ПодготовитьЗапрос(СтруктураПараметров, СчетаИсключения);
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	ЭтоЭлектронныйДокумент = Ложь;
	Если СтруктураПараметров.Свойство("ЭтоЭлектронныйДокумент") Тогда
		ЭтоЭлектронныйДокумент = СтруктураПараметров.ЭтоЭлектронныйДокумент;
	КонецЕсли;

	// Остаток на начало
	ВыборкаОстатокНаНачало = РезультатЗапроса[1].Выбрать();
	ВыборкаОстатокНаНачало.Следующий();
	СтруктураДанныхЗаполнения.Вставить("ОстатокНаНачало", ВыборкаОстатокНаНачало.ОстатокНаНачало);

	// Первоначальное заполнение таблицы по данным организации
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Дебет = 0 И Выборка.Кредит = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		#Вставка
		
		Если НЕ СтруктураПараметров.Свойство("ВидДоговораКонтрагентаМассив")  
			ИЛИ СтруктураПараметров.ВидДоговораКонтрагентаМассив.Найти(Выборка.Договор.ВидДоговора) <> Неопределено
			ИЛИ СтруктураПараметров.ВидДоговораКонтрагентаМассив.Количество() = 0 Тогда 
			
			а="";
		#КонецВставки
			
			НоваяСтрока = ТаблицаПоДаннымОрганизации.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			РеквизитыДокумента = РеквизитыДокумента(
			СтруктураПараметров,
			Выборка,
			КэшМетаданных,
			СчетаИсключения);
			
			Если РеквизитыДокумента.НомерДокумента = "" Тогда
				ТекстПередДатой = "";
			Иначе
				ТекстПередДатой = " " + НСтр("ru='от'") + " ";
			КонецЕсли;
			
			ДатаДокументаТекст = ТекстПередДатой + Формат(РеквизитыДокумента.ДатаДокумента, "ДЛФ=D; ДП='  .  .    '");
			
			НоваяСтрока.Представление  = СтрШаблон("%1 (%2%3)",
			РеквизитыДокумента.Представление,
			РеквизитыДокумента.НомерДокумента,
			ДатаДокументаТекст);
			
			Если ЭтоЭлектронныйДокумент Тогда
				Если РеквизитыДокумента.НомерДокумента = "" Тогда
					НоваяСтрока.НомерДокумента = НСтр("ru='б/н'");
				Иначе
					НоваяСтрока.НомерДокумента = РеквизитыДокумента.НомерДокумента;
				КонецЕсли;
				НоваяСтрока.ДатаДокумента  = РеквизитыДокумента.ДатаДокумента;
				НоваяСтрока.НаименованиеДокумента = Строка(ТипЗнч(Выборка.Документ));
				НоваяСтрока.НаименованиеОперации = РеквизитыДокумента.НаименованиеОперации;
			КонецЕсли;
		#Вставка
		КонецЕсли;
		#КонецВставки
		
	КонецЦикла;

	// Дополним таблицу валютной суммой
	ДополнитьТаблицуВалютнойСуммой(ТаблицаПоДаннымОрганизации, СтруктураПараметров);

	// Дополним таблицу счетами-фактурами
	ДополнитьТаблицуСчетамиФактурами(ТаблицаПоДаннымОрганизации, СтруктураПараметров);

	// Сортируем таблицу
	КолонкиДляСортировки = ?(СтруктураПараметров.РазбитьПоДоговорам, 
	"Договор, Дата, Документ, Представление, НомерДокумента, ДатаДокумента, НаименованиеДокумента, НаименованиеОперации",
	"Дата, Документ, Представление, Договор, НомерДокумента, ДатаДокумента, НаименованиеДокумента, НаименованиеОперации");
	ТаблицаПоДаннымОрганизации.Сортировать(КолонкиДляСортировки, Новый СравнениеЗначений);

	// Заполним возвращаемую структуру
	СтруктураДанныхЗаполнения.Вставить("ПоДаннымОрганизации", ТаблицаПоДаннымОрганизации);
	Если СтруктураПараметров.ЗаполнятьДанныеКонтрагента Тогда
		СтруктураДанныхЗаполнения.Вставить("ПоДаннымКонтрагента", ТаблицаПоДаннымКонтрагента(ТаблицаПоДаннымОрганизации));
	КонецЕсли;
	СтруктураДанныхЗаполнения.Успешно = Истина;
	ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);

КонецПроцедуры

Функция ПечатьАктаСверкиЛК(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСверкиВзаиморасчетов";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктСверкиВзаиморасчетов.ПФ_MXL_АктСверки");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыАктСверки();
	
	Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Получаем области
		ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьНачОстатки   = Макет.ПолучитьОбласть("НачОстатки");
		ОбластьДоговор      = Макет.ПолучитьОбласть("Договор");
		ОбластьДоговорИтоги = Макет.ПолучитьОбласть("ДоговорИтоги");
		ОбластьОбороты      = Макет.ПолучитьОбласть("Обороты");
		ОбластьОборотыИтог  = Макет.ПолучитьОбласть("ОборотыИтог");
		ОбластьКонОстатки   = Макет.ПолучитьОбласть("КонОстатки");
		ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
		
		// Заполняем шапку
		ПараметрыЗаголовок = Новый Структура;
		
		// Название организации
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаАктаСверки);
		
		НазваниеОрганизации = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
		
		ИННОрганизации = "";
		Если Не ПустаяСтрока(СведенияОбОрганизации.ИНН) Тогда
			ИННОрганизации = СтрШаблон(НСтр("ru='(ИНН %1)'"), СведенияОбОрганизации.ИНН);
		КонецЕсли;
		
		ПараметрыЗаголовок.Вставить("НазваниеОрганизации", НазваниеОрганизации);
		ПараметрыЗаголовок.Вставить("ИННОрганизации",      ИННОрганизации);
		
		// Наименование контрагента
		СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.ДатаАктаСверки);
		
		НаименованиеКонтрагента = СведенияОКонтрагенте.НаименованиеДляПечатныхФорм;
		
		ИННКонтрагента = "";
		Если Не ПустаяСтрока(СведенияОКонтрагенте.ИНН) Тогда
			ИННКонтрагента = СтрШаблон(НСтр("ru='(ИНН %1)'"), СведенияОКонтрагенте.ИНН);
		КонецЕсли;
		
		Если Шапка.СОбособленнымиПодразделениями Тогда
			НаименованиеКонтрагента = НаименованиеКонтрагента + " " + НСтр("ru='с обособленными подразделениями'");
		КонецЕсли;
		ПараметрыЗаголовок.Вставить("НаименованиеКонтрагента", НаименованиеКонтрагента);
		ПараметрыЗаголовок.Вставить("ИННКонтрагента",          ИННКонтрагента);
		
		// За период
		ДатаНачалаОтчета = ?(ЗначениеЗаполнено(Шапка.ДатаНачала), Шапка.ДатаНачала, Шапка.МинДата);
		Если ЗначениеЗаполнено(ДатаНачалаОтчета) Тогда
			ЗаПериод = ПредставлениеПериода(НачалоДня(ДатаНачалаОтчета), КонецДня(Шапка.ДатаОкончания), "ФП = Истина");
			ПараметрыЗаголовок.Вставить("ЗаПериод", СтрШаблон(НСтр("ru='за период: %1'"), ЗаПериод));
		КонецЕсли;
		
		// По договору
		Если ЗначениеЗаполнено(Шапка.ДоговорКонтрагентаВШапке) И НЕ Шапка.ДоговорКонтрагентаВШапкеЭтоГруппа Тогда
			ПараметрыЗаголовок.Вставить("ПоДоговору",
				Символы.ПС + СтрШаблон(НСтр("ru='по договору %1'"), Шапка.ДоговорКонтрагентаВШапке));
		КонецЕсли;
		
		// Валюта документа
		ПараметрыЗаголовок.Вставить("ВалютаДокумента", Шапка.ВалютаДокумента);
		
		// Представитель организации
		ДанныеПредставителяОрганизации = ДанныеПредставителяОрганизации(Шапка);
		Если СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			// Для ИП выводим только информацию об организации
			ПредставительОрганизации = НазваниеОрганизации;
		Иначе
			ПредставительОрганизации = СтрШаблон("%1 %2 %3",
				ДанныеПредставителяОрганизации.Должность,
				НазваниеОрганизации, 
				ДанныеПредставителяОрганизации.ФИОПолные);
		КонецЕсли;
		ПараметрыЗаголовок.Вставить("ПредставительОрганизации", ПредставительОрганизации);
		
		// Представитель контрагента
		ДанныеПредставителяКонтрагента = ДанныеПредставителяКонтрагента(Шапка);
		Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			// Для физического лица выводим только информацию об организации
			ПредставительКонтрагента = НаименованиеКонтрагента;
		Иначе
			ПредставительКонтрагента = СтрШаблон("%1 %2 %3", 
				ДанныеПредставителяКонтрагента.Должность, 
				НаименованиеКонтрагента,
				ДанныеПредставителяКонтрагента.ФИОПолные);
		КонецЕсли;
		ПараметрыЗаголовок.Вставить("ПредставительКонтрагента", ПредставительКонтрагента);
		
		// Выводим шапку
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		// Строки таблицы
		ПараметрыНачальныеОстатки = Новый Структура;
		ПараметрыНачальныеОстатки.Вставить("СуммаНачальныйОстатокДт", ?(Шапка.ОстатокНаНачало > 0, Шапка.ОстатокНаНачало, 0));
		ПараметрыНачальныеОстатки.Вставить("СуммаНачальныйОстатокКт", ?(Шапка.ОстатокНаНачало < 0, -Шапка.ОстатокНаНачало, 0));
		ОбластьНачОстатки.Параметры.Заполнить(ПараметрыНачальныеОстатки);
		ТабличныйДокумент.Вывести(ОбластьНачОстатки);
		
		РазбиватьДанныеПоДоговорам = Не ЗначениеЗаполнено(Шапка.ДоговорКонтрагентаВШапке) Или Шапка.ДоговорКонтрагентаВШапкеЭтоГруппа = Истина;
		
		Если Шапка.РазбитьПоДоговорам Тогда 
			СальдоПоДоговорам = НачальноеСальдоПоДоговорам(Шапка);
			НачальноеСальдоПоДоговорамАкта      = СальдоПоДоговорам.ПоДоговорамАкта;
			НачальноеСальдоПоОстальнымДоговорам = СальдоПоДоговорам.ПоОстальнымДоговорам;
			
			Если РазбиватьДанныеПоДоговорам Тогда
			// Для акта сверки в электронном виде возможно формирование по выбранному договору,
			// при этом "Разбить по договорам" = Истина используется для унификации,чтобы данные по договору всегда собирать из строки табличной части.
				ВывестиСальдоПоОстальнымДоговорам(
					НачальноеСальдоПоОстальнымДоговорам,
					ОбластьДоговор,
					ОбластьДоговорИтоги,
					ТабличныйДокумент,
					Шапка);
			КонецЕсли;
		КонецЕсли;
		
		ОбходПоДоговорам = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Договор");
		Пока ОбходПоДоговорам.Следующий() Цикл
			
			// Собираем данные
			ОбходПоДокументам = ОбходПоДоговорам.Выбрать();
			
			// Создадим список документов по организации и контрагенту.
			СписокДокументов  = Новый Массив;
			СписокДокументовК = Новый Массив;
			
			Пока ОбходПоДокументам.Следующий() Цикл
				Если ОбходПоДокументам.Дата <> NULL Тогда
					СтруктураДокумента = НовыйСтруктураДокумента();
					ЗаполнитьЗначенияСвойств(СтруктураДокумента, ОбходПоДокументам);
					СписокДокументов.Добавить(СтруктураДокумента);
				КонецЕсли;
				Если ОбходПоДокументам.ДатаКонтр <> NULL Тогда
					СтруктураДокумента = НовыйСтруктураДокумента(Истина);
					ЗаполнитьЗначенияСвойств(СтруктураДокумента, ОбходПоДокументам);
					СписокДокументовК.Добавить(СтруктураДокумента);
				КонецЕсли;
			КонецЦикла;
			
			// Не отображаем информацию по контрагенту, если не введены документы и сверка не согласована.
			// В этом случае будут пустые строки и итоги со стороны контрагента.
			ЗаполнятьДанныеКонтрагента = (Шапка.СверкаСогласована ИЛИ (СписокДокументовК.Количество() <> 0));
			
			// Выравняем таблицы по количеству строк
			РазницаСтрок = СписокДокументов.Количество() - СписокДокументовК.Количество();
			Если РазницаСтрок > 0 Тогда
				ДополняемаяТаблица = СписокДокументовК;
				НоваяСтрока = НовыйСтруктураДокумента(Истина);
			ИначеЕсли РазницаСтрок < 0 Тогда
				РазницаСтрок = -РазницаСтрок;
				ДополняемаяТаблица = СписокДокументов;
				НоваяСтрока = НовыйСтруктураДокумента();
			КонецЕсли;
			Для Счетчик = 1 По РазницаСтрок Цикл
				ДополняемаяТаблица.Добавить(НоваяСтрока);
			КонецЦикла;
			
			ЕстьСтрокиДокументов = (СписокДокументов.Количество() <> 0);
			
			// Выводим данные в табличный документ
			Если Шапка.РазбитьПоДоговорам И ЕстьСтрокиДокументов И РазбиватьДанныеПоДоговорам Тогда
				ОбластьДоговор.Параметры.Заполнить(ОбходПоДоговорам);
				НачальноеСальдоПоДоговору = НачальноеСальдоПоДоговорамАкта.Скопировать(
					Новый Структура("Договор", ОбходПоДоговорам.Договор));
				СтруктураСальдоПоДоговору = Новый Структура;
				СтруктураСальдоПоДоговору.Вставить("НачОстатокПоДоговоруДт",
					НачальноеСальдоПоДоговору.Итог("НачОстатокПоДоговоруДт"));
				СтруктураСальдоПоДоговору.Вставить("НачОстатокПоДоговоруКт",
					НачальноеСальдоПоДоговору.Итог("НачОстатокПоДоговоруКт"));
				ОбластьДоговор.Параметры.Заполнить(СтруктураСальдоПоДоговору);
				
				ТабличныйДокумент.Вывести(ОбластьДоговор);
			КонецЕсли;
			
			Для Счетчик = 0 По СписокДокументов.Количество() - 1 Цикл
				// Выводим обороты
				ОбластьОбороты.Параметры.Заполнить(СписокДокументов[Счетчик]);
				ОбластьОбороты.Параметры.Заполнить(СписокДокументовК[Счетчик]);
				ТабличныйДокумент.Вывести(ОбластьОбороты);
			КонецЦикла;
			
			Если Шапка.РазбитьПоДоговорам И ЕстьСтрокиДокументов И РазбиватьДанныеПоДоговорам Тогда
				ОбластьДоговорИтоги.Параметры.Заполнить(ОбходПоДоговорам);
				// Конечное сальдо по договору
				СтруктураКонСальдоПоДоговору = Новый Структура;
				КонОстатокПоДоговоруДт = СтруктураСальдоПоДоговору.НачОстатокПоДоговоруДт + ОбходПоДоговорам.СуммаОборотДт;
				КонОстатокПоДоговоруКт = СтруктураСальдоПоДоговору.НачОстатокПоДоговоруКт + ОбходПоДоговорам.СуммаОборотКт;
				КонОстатокПоДоговору   = КонОстатокПоДоговоруДт - КонОстатокПоДоговоруКт;
				Если КонОстатокПоДоговору < 0 Тогда
					СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруДт", 0);
					СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруКт",-КонОстатокПоДоговору);
				Иначе
					СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруДт", КонОстатокПоДоговору);
					СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруКт", 0);
				КонецЕсли;
				
				Если НЕ ЗаполнятьДанныеКонтрагента Тогда
					СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруДтКонтр", 0);
					СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруКтКонтр", 0);
				Иначе
					КонОстатокПоДоговоруДтКонтр = СтруктураСальдоПоДоговору.НачОстатокПоДоговоруКт + ОбходПоДоговорам.СуммаОборотДтКонтр;
					КонОстатокПоДоговоруКтКонтр = СтруктураСальдоПоДоговору.НачОстатокПоДоговоруДт + ОбходПоДоговорам.СуммаОборотКтКонтр;
					КонОстатокПоДоговоруКонтр = КонОстатокПоДоговоруДтКонтр - КонОстатокПоДоговоруКтКонтр;
					Если КонОстатокПоДоговоруКонтр < 0 Тогда
						СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруДтКонтр", 0);
						СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруКтКонтр",-КонОстатокПоДоговоруКонтр);
					Иначе
						СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруДтКонтр", КонОстатокПоДоговоруКонтр);
						СтруктураКонСальдоПоДоговору.Вставить("КонОстатокПоДоговоруКтКонтр", 0);
					КонецЕсли;
				КонецЕсли;
				
				ОбластьДоговорИтоги.Параметры.Заполнить(СтруктураКонСальдоПоДоговору);
				ТабличныйДокумент.Вывести(ОбластьДоговорИтоги);
			КонецЕсли;
			
		КонецЦикла;
		
		// Итоги по документам
		ОбластьОборотыИтог.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьОборотыИтог);
		
		// Итоги по контрагенту
		ОстатокНаКонец = Шапка.ОстатокНаНачало + Шапка.СуммаОборотДт - Шапка.СуммаОборотКт;
		Если ЗаполнятьДанныеКонтрагента Тогда
			ОстатокНаКонецКонтр = Шапка.ОстатокНаНачало - Шапка.СуммаОборотДтКонтр + Шапка.СуммаОборотКтКонтр;
		Иначе
			ОстатокНаКонецКонтр = 0;
		КонецЕсли;
		ПараметрыИтогиПоКонтрагенту = Новый Структура;
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокДт",      ?(ОстатокНаКонец > 0, ОстатокНаКонец, 0));
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокКт",      ?(ОстатокНаКонец < 0, -ОстатокНаКонец, 0));
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокКтКонтр", ?(ОстатокНаКонецКонтр > 0, ОстатокНаКонецКонтр, 0));
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокДтКонтр", ?(ОстатокНаКонецКонтр < 0, -ОстатокНаКонецКонтр, 0));
		ОбластьКонОстатки.Параметры.Заполнить(ПараметрыИтогиПоКонтрагенту);
		ТабличныйДокумент.Вывести(ОбластьКонОстатки);
		
		// Результаты сверки
		ПараметрыПодвала = Новый Структура;
		ПараметрыПодвала.Вставить("НаименованиеКонтрагента", НаименованиеКонтрагента);
		ПараметрыПодвала.Вставить("НазваниеОрганизации",     НазваниеОрганизации);
		ПараметрыПодвала.Вставить("Должность",               ДанныеПредставителяОрганизации.Должность);
		ПараметрыПодвала.Вставить("ДолжностьК",              ДанныеПредставителяКонтрагента.Должность);
		ПараметрыПодвала.Вставить("ФИОПредставителя",        СтрШаблон("(%1)", ДанныеПредставителяОрганизации.Представление));
		ПараметрыПодвала.Вставить("ФИОПредставителяК",       СтрШаблон("(%1)", ДанныеПредставителяКонтрагента.Представление));
		ПараметрыПодвала.Вставить("РезультатыСверки",
			РезультатСверки(Шапка, ОстатокНаКонец, НазваниеОрганизации, НаименованиеКонтрагента));
		Если ЗаполнятьДанныеКонтрагента Тогда
			ПараметрыПодвала.Вставить("РезультатыСверкиК",
				РезультатСверки(Шапка, ОстатокНаКонецКонтр, НазваниеОрганизации, НаименованиеКонтрагента));
		КонецЕсли;
		
		// Итог сверки выводим если нашли расхождение и сверка согласована.
		Если Шапка.Расхождение <> 0 И Шапка.СверкаСогласована Тогда
			СуммаРасхождение = ?(Шапка.Расхождение > 0, Шапка.Расхождение, -Шапка.Расхождение);
			ИтогСверки = СтрШаблон(НСтр("ru='В результате сверки выявлено расхождение информации о состоянии расчетов в размере %1 %2 %3'"),
				Формат(СуммаРасхождение, "ЧЦ=21; ЧДЦ=2"),
				Строка(Шапка.ВалютаДокумента),
				УчетДенежныхСредствБП.ФорматироватьСуммуПрописьюПлатежногоДокумента(СуммаРасхождение, Шапка.ВалютаДокумента, Ложь));
			ПараметрыПодвала.Вставить("ИтогСверки", Символы.ПС + ИтогСверки + Символы.ПС + " ");
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Заполнить(ПараметрыПодвала);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Документ);
		
		УправлениеПечатьюБП.ДоработатьФаксимильнуюПодписьИПечать(ТабличныйДокумент, ОбъектыПечати, Шапка.Организация, Шапка.Документ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

//&ИзменениеИКонтроль("ПодготовитьДанныеДляЗаполнения")
//Процедура ЛГС_ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища)

//	УстановитьПривилегированныйРежим(Истина);
//	СтруктураДанныхЗаполнения = Новый Структура();
//	СтруктураДанныхЗаполнения.Вставить("Успешно", Ложь);

//	Если НЕ ПроверитьОтложенныеРасчеты(СтруктураПараметров) Тогда
//		ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);
//		Возврат;
//	КонецЕсли;

//	// Подготовим переменные
//	СчетаИсключения             = СчетаИсключения();
//	ТаблицаПоДаннымОрганизации = НовыйТаблицаДокументов();
//	КэшМетаданных              = Новый Соответствие; // Используется для получения представления документов
//	Запрос = ПодготовитьЗапрос(СтруктураПараметров, СчетаИсключения);
//	РезультатЗапроса = Запрос.ВыполнитьПакет();

//	ЭтоЭлектронныйДокумент = Ложь;
//	Если СтруктураПараметров.Свойство("ЭтоЭлектронныйДокумент") Тогда
//		ЭтоЭлектронныйДокумент = СтруктураПараметров.ЭтоЭлектронныйДокумент;
//	КонецЕсли;

//	// Остаток на начало
//	ВыборкаОстатокНаНачало = РезультатЗапроса[1].Выбрать();
//	ВыборкаОстатокНаНачало.Следующий();
//	СтруктураДанныхЗаполнения.Вставить("ОстатокНаНачало", ВыборкаОстатокНаНачало.ОстатокНаНачало);

//	// Первоначальное заполнение таблицы по данным организации
//	Выборка = РезультатЗапроса[2].Выбрать();
//	Пока Выборка.Следующий() Цикл
//		Если Выборка.Дебет = 0 И Выборка.Кредит = 0 Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		#Вставка
//		//Если  СтруктураПараметров.ВидДоговораКонтрагента = Перечисления.ВидыДоговоровКонтрагентов.ПустаяСсылка() ИЛИ
//		//		СтруктураПараметров.ВидДоговораКонтрагента = Выборка.Договор.ВидДоговора Тогда
//		#КонецВставки
//		
//		НоваяСтрока = ТаблицаПоДаннымОрганизации.Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);

//		РеквизитыДокумента = РеквизитыДокумента(
//		СтруктураПараметров,
//		Выборка,
//		КэшМетаданных,
//		СчетаИсключения);

//		Если РеквизитыДокумента.НомерДокумента = "" Тогда
//			ТекстПередДатой = "";
//		Иначе
//			ТекстПередДатой = " " + НСтр("ru='от'") + " ";
//		КонецЕсли;

//		ДатаДокументаТекст = ТекстПередДатой + Формат(РеквизитыДокумента.ДатаДокумента, "ДЛФ=D; ДП='  .  .    '");

//		НоваяСтрока.Представление  = СтрШаблон("%1 (%2%3)",
//		РеквизитыДокумента.Представление,
//		РеквизитыДокумента.НомерДокумента,
//		ДатаДокументаТекст);

//		Если ЭтоЭлектронныйДокумент Тогда
//			Если РеквизитыДокумента.НомерДокумента = "" Тогда
//				НоваяСтрока.НомерДокумента = НСтр("ru='б/н'");
//			Иначе
//				НоваяСтрока.НомерДокумента = РеквизитыДокумента.НомерДокумента;
//			КонецЕсли;
//			НоваяСтрока.ДатаДокумента  = РеквизитыДокумента.ДатаДокумента;
//			НоваяСтрока.НаименованиеДокумента = Строка(ТипЗнч(Выборка.Документ));
//			НоваяСтрока.НаименованиеОперации = РеквизитыДокумента.НаименованиеОперации;
//		КонецЕсли;
//		#Вставка
//		//КонецЕсли;
//		#КонецВставки
//	КонецЦикла;

//	// Дополним таблицу валютной суммой
//	ДополнитьТаблицуВалютнойСуммой(ТаблицаПоДаннымОрганизации, СтруктураПараметров);

//	// Дополним таблицу счетами-фактурами
//	ДополнитьТаблицуСчетамиФактурами(ТаблицаПоДаннымОрганизации, СтруктураПараметров);

//	// Сортируем таблицу
//	КолонкиДляСортировки = ?(СтруктураПараметров.РазбитьПоДоговорам, 
//	"Договор, Дата, Документ, Представление, НомерДокумента, ДатаДокумента, НаименованиеДокумента, НаименованиеОперации",
//	"Дата, Документ, Представление, Договор, НомерДокумента, ДатаДокумента, НаименованиеДокумента, НаименованиеОперации");
//	ТаблицаПоДаннымОрганизации.Сортировать(КолонкиДляСортировки, Новый СравнениеЗначений);

//	// Заполним возвращаемую структуру
//	СтруктураДанныхЗаполнения.Вставить("ПоДаннымОрганизации", ТаблицаПоДаннымОрганизации);
//	Если СтруктураПараметров.ЗаполнятьДанныеКонтрагента Тогда
//		СтруктураДанныхЗаполнения.Вставить("ПоДаннымКонтрагента", ТаблицаПоДаннымКонтрагента(ТаблицаПоДаннымОрганизации));
//	КонецЕсли;
//	СтруктураДанныхЗаполнения.Успешно = Истина;
//	ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);

//КонецПроцедуры
