&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ПериодОтчета.ДатаНачала = НачалоГода(ТекущаяДата());
	ЭтотОбъект.ПериодОтчета.ДатаОкончания = КонецГода(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Если ЗначениеЗаполнено(ПериодОтчета.ДатаНачала) И ЗначениеЗаполнено(ПериодОтчета.ДатаОкончания) Тогда
		
		Если ПериодОтчета.ДатаНачала <= ПериодОтчета.ДатаОкончания Тогда
			
			КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ОтчетНачисленияПремийПоСделкам");    
			// Добавляем в коллекцию (тип массив) сформированный Табличный документ
			КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьОтчетНаСервере(); 
			// если требуется устанавливаем параметры печати
			КоллекцияПечатныхФорм[0].СинонимМакета = "Сводка по выручке и профитам по клиентам";
			
			КоллекцияПечатныхФорм[0].Экземпляров = 1;
			
			УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);  
			
		Иначе 
			
			Сообщить("Невозможно вывести отчет: конец периода должен быть больше начала периода");  
			
		КонецЕсли; 
		
	Иначе
		
		ПоказатьПредупреждение(,"Невозможно вывести отчет: период отчета должен быть заполнен",,"ОШИБКА");
		
		//Сообщить("Невозможно вывести отчет: период должен быть заполнен");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	ТЗ_Начисления = Новый ТаблицаЗначений;
	ТЗ_Начисления.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТЗ_Начисления.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗ_Начисления.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
	ТЗ_Начисления.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТЗ_Начисления.Колонки.Добавить("Профит", Новый ОписаниеТипов("Число"));
	ТЗ_Начисления.Колонки.Добавить("Премия", Новый ОписаниеТипов("Число"));
	ТЗ_Начисления.Колонки.Добавить("Отдел", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100))); 
	ТЗ_Начисления.Колонки.Добавить("ТипПремииСлуж", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТЗ_Начисления.Колонки.Добавить("СуммаАктРеализации", Новый ОписаниеТипов("Число"));
	ТЗ_Начисления.Колонки.Добавить("СуммаАктПоступление", Новый ОписаниеТипов("Число"));
	
	ОрганизацияОтчета = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	
	//Если ОрганизацияОтчета.ИНН = "5074080761" Тогда // Декларант
	//	
	//	ЗаполнитьТЗДанными(ТЗ_Начисления); 
	//	
	Если ОрганизацияОтчета.ИНН = "2315213101" Тогда // Логист (ОСНО)
		
		ЗаполнитьТЗДаннымиЛогист(ТЗ_Начисления); 
		
	Иначе 
		
		ЗаполнитьТЗДанными(ТЗ_Начисления);	 //Декларант (УПРОЩЕНКА)
		
	КонецЕсли;
	
	
	
	ИтогСуммаОтделПродаж = 0;
	ИтогСуммаОтделКлиенты = 0;
	ИтогСуммаАвтоСобств = 0;
	
	Для каждого СтрТЗ из ТЗ_Начисления Цикл
		
		Если СтрТЗ.Отдел = "ИтогСуммаОтделПродаж" Тогда
			
			ИтогСуммаОтделПродаж = ИтогСуммаОтделПродаж + СтрТЗ.Профит;
			
		ИначеЕсли СтрТЗ.Отдел = "АвтоперевозкиСобств" Тогда	
			
			ИтогСуммаАвтоСобств = ИтогСуммаАвтоСобств + СтрТЗ.Профит;
			
		ИначеЕсли СтрТЗ.Отдел = "ОтделРаботыСКлиентами" Тогда	
			
			ИтогСуммаОтделКлиенты = ИтогСуммаОтделКлиенты + СтрТЗ.Профит;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ПроцентРОП = ?(ИтогСуммаОтделПродаж < 6000000,2,3);
	ПроцентАвтоСобств = ?(ИтогСуммаАвтоСобств < 2160000,0.5,1);   
	
	ПрофитРОП = 0; 
	
	ВремТЗ = ТЗ_Начисления.Скопировать();
	
	Для каждого СтрВремТЗ из ВремТЗ Цикл
		
		Если СтрВремТЗ.Отдел = "ОтделПродаж" И (СтрВремТЗ.Сотрудник <> "Мельникова Елена Александровна" 
			И СтрВремТЗ.Сотрудник <> "Куршин Александр Владимирович") Тогда
			// Руководитель отдела продаж
			СтрТЗ = ТЗ_Начисления.Добавить(); 
			СтрТЗ.Сотрудник =  "А_Руководитель отдела продаж";
			СтрТЗ.Контрагент = СтрВремТЗ.Контрагент;
			СтрТЗ.Сделка = СтрВремТЗ.Сделка;
			СтрТЗ.Номенклатура = СтрВремТЗ.Номенклатура;
			СтрТЗ.Премия = СтрВремТЗ.Профит * ПроцентРОП / 100;
			СтрТЗ.Профит = СтрВремТЗ.Профит;
			СтрТЗ.Отдел = "ОтделПродаж";
			СтрТЗ.ТипПремииСлуж = "Отдел продаж";
			СтрТЗ.СуммаАктРеализации = СтрВремТЗ.СуммаАктРеализации;
			СтрТЗ.СуммаАктПоступление = СтрВремТЗ.СуммаАктПоступление;
			
			
		КонецЕсли;		
		
		
		Если СтрВремТЗ.Отдел = "ОтделРаботыСКлиентами" Тогда
			
			// Руководитель отдела работы склиентами
			СтрТЗ = ТЗ_Начисления.Добавить(); 
			СтрТЗ.Сотрудник =  "А_Руководитель отдела по работе с клиентами";
			СтрТЗ.Контрагент = СтрВремТЗ.Контрагент;
			СтрТЗ.Сделка = СтрВремТЗ.Сделка; 
			СтрТЗ.Номенклатура = СтрВремТЗ.Номенклатура;
			СтрТЗ.Премия = СтрВремТЗ.Профит * 3 / 100;
			СтрТЗ.Профит = СтрВремТЗ.Профит;
			СтрТЗ.Отдел = "ОтделРаботыСКлиентами";
			СтрТЗ.ТипПремииСлуж = "Отдел работы с клиентами"; 
			СтрТЗ.СуммаАктРеализации = СтрВремТЗ.СуммаАктРеализации;
			СтрТЗ.СуммаАктПоступление = СтрВремТЗ.СуммаАктПоступление;
			
		КонецЕсли;
		
	КонецЦикла;	  
	
	
	Для каждого стрТЗ_Начисления из ТЗ_Начисления Цикл
		
		Если стрТЗ_Начисления.Отдел = "АвтоперевозкиСобств" Тогда
			
			стрТЗ_Начисления.Премия = стрТЗ_Начисления.Профит * ПроцентАвтоСобств / 100;
			
		КонецЕсли;
		
		
	КонецЦикла;	
	
	
	
	ДанныеДляРасчетов = Новый Структура;
	ДанныеДляРасчетов.Вставить("ИтогСуммаОтделПродаж",ИтогСуммаОтделПродаж);
	ДанныеДляРасчетов.Вставить("ИтогСуммаОтделКлиенты",ИтогСуммаОтделКлиенты);
	ДанныеДляРасчетов.Вставить("ИтогСуммаАвтоСобств",ИтогСуммаАвтоСобств);
	ДанныеДляРасчетов.Вставить("ПроцентРОП",ПроцентРОП);
	ДанныеДляРасчетов.Вставить("ПроцентАвтоСобств",ПроцентАвтоСобств);
	ДанныеДляРасчетов.Вставить("ТЗ_Начисления",ТЗ_Начисления);
	
	Отчет = СформироватьПечатнуюФорму(ДанныеДляРасчетов);  
	
	Возврат Отчет;
	
КонецФункции  

// Для Декларанта
&НаСервере
Процедура ЗаполнитьТЗДанными(ТЗ_Начисления)
	
	Счета76 = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Код ПОДОБНО ""76%""
		|";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		Счета76.Добавить(Выборка.Ссылка);
		
	КонецЦикла;	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сделка.Ссылка КАК Сделка,
	               |	Сделка.Контрагент КАК Контрагент,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделка_1.Ссылка) КАК Номер
	               |ПОМЕСТИТЬ ВТ_НомераСделок
	               |ИЗ
	               |	Документ.Сделка КАК Сделка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка_1
	               |		ПО Сделка.МоментВремени >= Сделка_1.МоментВремени
	               |			И Сделка.Контрагент = Сделка_1.Контрагент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Сделка.Контрагент,
	               |	Сделка.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КорректировкаПоступленияТовары.Ссылка.ДокументПоступления КАК ДокументПоступления,
	               |	КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения КАК Сумма,
	               |	КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения КАК СуммаНДС
	               |ПОМЕСТИТЬ ВТ_Корр
	               |ИЗ
	               |	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаПоступленияУслуги.Ссылка.ДокументПоступления,
	               |	КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаДоИзменения,
	               |	КорректировкаПоступленияУслуги.СуммаНДС - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения
	               |ИЗ
	               |	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаПоступленияАгентскиеУслуги.Ссылка.ДокументПоступления,
	               |	КорректировкаПоступленияАгентскиеУслуги.Сумма - КорректировкаПоступленияАгентскиеУслуги.СуммаДоИзменения,
	               |	КорректировкаПоступленияАгентскиеУслуги.СуммаНДС - КорректировкаПоступленияАгентскиеУслуги.СуммаНДСДоИзменения
	               |ИЗ
	               |	Документ.КорректировкаПоступления.АгентскиеУслуги КАК КорректировкаПоступленияАгентскиеУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КорректировкаРеализацииТовары.Ссылка.ДокументРеализации КАК ДокументРеализации,
	               |	КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения КАК Сумма,
	               |	КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения КАК СуммаНДС
	               |ПОМЕСТИТЬ ВТ_КоррРеализации
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаРеализацииУслуги.Ссылка.ДокументРеализации,
	               |	КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения,
	               |	КорректировкаРеализацииУслуги.СуммаНДС - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаРеализацииАгентскиеУслуги.Ссылка.ДокументРеализации,
	               |	КорректировкаРеализацииАгентскиеУслуги.Сумма - КорректировкаРеализацииАгентскиеУслуги.СуммаДоИзменения,
	               |	КорректировкаРеализацииАгентскиеУслуги.СуммаНДС - КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоИзменения
	               |ИЗ
	               |	Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |			ТОГДА ВЫБОР
	               |					КОГДА РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |							И РеализацияТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |						ТОГДА 0
	               |					ИНАЧЕ РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |						И РеализацияТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |					ТОГДА 0
	               |				ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СуммаАкта,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка
	               |ПОМЕСТИТЬ ВТ_Реализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	               |		ПО РеализацияТоваровУслугТовары.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |			ТОГДА ВЫБОР
	               |					КОГДА РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |							И РеализацияТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |						ТОГДА 0
	               |					ИНАЧЕ РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |						И РеализацияТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |					ТОГДА 0
	               |				ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |			КОНЕЦ
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(РеализацияТоваровУслугУслуги.Номенклатура, РеализацияТоваровУслугУслуги.Содержание),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |								И РеализацияТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	               |							ТОГДА 0
	               |						ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |							И РеализацияТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	               |						ТОГДА 0
	               |					ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	               |		ПО РеализацияТоваровУслугУслуги.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	ЕСТЬNULL(РеализацияТоваровУслугУслуги.Номенклатура, РеализацияТоваровУслугУслуги.Содержание)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(РеализацияТоваровУслугАгентскиеУслуги.Номенклатура, РеализацияТоваровУслугАгентскиеУслуги.Содержание),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |								И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	               |							ТОГДА 0
	               |						ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |							И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	               |						ТОГДА 0
	               |					ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	               |		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	ЕСТЬNULL(РеализацияТоваровУслугАгентскиеУслуги.Номенклатура, РеализацияТоваровУслугАгентскиеУслуги.Содержание)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СУММА(СделкаВнутренниеДоходы.Сумма),
	               |	СделкаВнутренниеДоходы.Ссылка
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	               |ГДЕ
	               |	СделкаВнутренниеДоходы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СделкаВнутренниеДоходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажахТовары.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |							И ОтчетКомитентуОПродажахТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |						ТОГДА 0
	               |					ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |						И ОтчетКомитентуОПродажахТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |					ТОГДА 0
	               |				ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |ГДЕ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОтчетКомитентуОПродажахТовары.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВТ_Реализации.СуммаАкта, 0)) КАК СуммаАкта,
	               |	ВТ_Реализации.Номенклатура КАК Номенклатура,
	               |	ВТ_Реализации.Сделка КАК Сделка
	               |ПОМЕСТИТЬ ВТ_Исходящие
	               |ИЗ
	               |	ВТ_Реализации КАК ВТ_Реализации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Реализации.Номенклатура,
	               |	ВТ_Реализации.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |								И ПоступлениеТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	               |							ТОГДА 0
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |												ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |											ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |										ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |							И ПоступлениеТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК СуммаАкта,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
	               |	ЕСТЬNULL(ПоступлениеТоваровУслугУслуги.Номенклатура, ПоступлениеТоваровУслугУслуги.Содержание) КАК Номенклатура,
	               |	ВТ_Корр.Сумма КАК Сумма,
	               |	ВТ_Корр.СуммаНДС КАК СуммаНДС
	               |ПОМЕСТИТЬ ВТ_Поступления
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	               |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = ВТ_Корр.ДокументПоступления
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
	               |	ЕСТЬNULL(ПоступлениеТоваровУслугУслуги.Номенклатура, ПоступлениеТоваровУслугУслуги.Содержание),
	               |	ВТ_Корр.Сумма,
	               |	ВТ_Корр.СуммаНДС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	               |	СделкаВнутренниеРасходы.Ссылка,
	               |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	               |ГДЕ
	               |	СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	               |	И СделкаВнутренниеРасходы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	               |	СделкаВнутренниеРасходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |								И ПоступлениеТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |							ТОГДА 0
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |												ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |											ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |										ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |							И ПоступлениеТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура,
	               |	ВТ_Корр.Сумма,
	               |	ВТ_Корр.СуммаНДС
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	               |			ПО ПоступлениеТоваровУслугТовары.Ссылка = ВТ_Корр.ДокументПоступления
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура,
	               |	ВТ_Корр.Сумма,
	               |	ВТ_Корр.СуммаНДС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |								И ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	               |							ТОГДА 0
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |												ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |											ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |										ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |							И ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	               |	ЕСТЬNULL(ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура, ПоступлениеТоваровУслугАгентскиеУслуги.Содержание),
	               |	ВТ_Корр.Сумма,
	               |	ВТ_Корр.СуммаНДС
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	               |			ПО ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ВТ_Корр.ДокументПоступления
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	               |			И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	               |	ЕСТЬNULL(ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура, ПоступлениеТоваровУслугАгентскиеУслуги.Содержание),
	               |	ВТ_Корр.Сумма,
	               |	ВТ_Корр.СуммаНДС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВТ_Поступления.СуммаАкта, 0)) КАК СуммаАкта,
	               |	ВТ_Поступления.Сделка КАК Сделка,
	               |	ВТ_Поступления.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Входящие
	               |ИЗ
	               |	ВТ_Поступления КАК ВТ_Поступления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Поступления.Сделка,
	               |	ВТ_Поступления.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ_Входящие.СуммаАкта) КАК СуммаАктаВходящего,
	               |	СУММА(ВТ_Исходящие.СуммаАкта) КАК СуммаАктаИсходящего,
	               |	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка) КАК Сделка,
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент) КАК Контрагент,
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный) КАК Ответственный,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаАкта, 0) - ЕСТЬNULL(ВТ_Входящие.СуммаАкта, 0)) КАК ПрофитПоАктам,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент)).Наименование КАК КонтрагентНаименование,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный)).Наименование КАК ОтветственныйНаименование,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка)).Дата КАК СделкаДата
	               |ПОМЕСТИТЬ ИВТ_ИтоговыеДанные
	               |ИЗ
	               |	ВТ_Входящие КАК ВТ_Входящие
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Исходящие КАК ВТ_Исходящие
	               |		ПО ВТ_Входящие.Сделка = ВТ_Исходящие.Сделка
	               |			И ВТ_Входящие.Номенклатура = ВТ_Исходящие.Номенклатура
	               |ГДЕ
	               |	(ВТ_Входящие.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ ВТ_Исходящие.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура),
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка),
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент),
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный),
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент)).Наименование,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный)).Наименование,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка)).Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИВТ_ИтоговыеДанные.Ответственный КАК Ответственный,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.СуммаАктаВходящего КАК СуммаАктаВходящего,
	               |	ИВТ_ИтоговыеДанные.СуммаАктаИсходящего КАК СуммаАктаИсходящего,
	               |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК Профит,
	               |	(ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0)) * 0.04 КАК Премия,
	               |	ИВТ_ИтоговыеДанные.Сделка.МенеджерПоРаботеСКлиентами КАК СделкаМенеджерПоРаботеСКлиентами
	               |ПОМЕСТИТЬ ВТ_ДанныеДляОтделаКлиенты
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	               |ГДЕ
	               |	НЕ ИВТ_ИтоговыеДанные.Сделка.Вид В (&ВидыСделокАСД)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.Номенклатура, """") КАК Номенклатура,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) КАК СуммаАктаИсходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК СуммаАктаВходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК ПрофитАвто
	               |ПОМЕСТИТЬ ВТ_АвтоСобственное
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	               |ГДЕ
	               |	ИВТ_ИтоговыеДанные.Номенклатура = &Номенклатура4
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИВТ_ИтоговыеДанные.СуммаАктаВходящего КАК СуммаАктаВходящего,
	               |	ИВТ_ИтоговыеДанные.СуммаАктаИсходящего КАК СуммаАктаИсходящего,
	               |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ИВТ_ИтоговыеДанные.Ответственный КАК Ответственный,
	               |	ИВТ_ИтоговыеДанные.ПрофитПоАктам КАК ПрофитПоАктам,
	               |	ИВТ_ИтоговыеДанные.КонтрагентНаименование КАК КонтрагентНаименование,
	               |	ИВТ_ИтоговыеДанные.ОтветственныйНаименование КАК ОтветственныйНаименование,
	               |	ИВТ_ИтоговыеДанные.СделкаДата КАК СделкаДата,
	               |	ВТ_НомераСделок.Номер КАК НомерСделки,
	               |	ИВТ_ИтоговыеДанные.Сделка.Менеджер КАК МенеджерПоПродажам,
	               |	ВЫБОР
	               |		КОГДА ИВТ_ИтоговыеДанные.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |			ТОГДА ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.04
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПремияРукОтдДекл,
	               |	ВЫБОР
	               |		КОГДА ВТ_НомераСделок.Номер = 1
	               |			ТОГДА ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.1
	               |		ИНАЧЕ ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.075
	               |	КОНЕЦ КАК ПремияМенеджерПродаж,
	               |	ИВТ_ИтоговыеДанные.Сделка.МенеджерПоРаботеСКлиентами КАК СделкаМенеджерПоРаботеСКлиентами
	               |ПОМЕСТИТЬ ВТ_ИтогДанныеСНомерамиСделок
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераСделок КАК ВТ_НомераСделок
	               |		ПО ИВТ_ИтоговыеДанные.Сделка = ВТ_НомераСделок.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) КАК СуммаАктаИсходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК СуммаАктаВходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК ПрофитСделкаАвто
	               |ПОМЕСТИТЬ ВТ_СделкаАвтоперевозка
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	               |ГДЕ
	               |	ИВТ_ИтоговыеДанные.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Автоперевозка)
	               |	И ИВТ_ИтоговыеДанные.СуммаАктаВходящего > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.Номенклатура, """") КАК Номенклатура,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) КАК СуммаАктаИсходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК СуммаАктаВходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК ПрофитАвто
	               |ПОМЕСТИТЬ ВТ_Экспедирование
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные"; 
	
	Запрос.УстановитьПараметр("Счета76", Счета76);
	
	ПониженнаяСтавка = УчетНДС.ПрименяетсяПониженнаяСтавкаНДС(Справочники.Организации.ОрганизацияПоУмолчанию(), ТекущаяДата());
	
	Запрос.УстановитьПараметр("ПониженнаяСтавка", ПониженнаяСтавка);
	
	Если Справочники.Организации.ОрганизацияПоУмолчанию().ИНН = "5074080761" Тогда    // Декларант
		
		Номенклатура1 = Справочники.Номенклатура.НайтиПоКоду("00-00000013"); // ФРАХТ (00-00000041)
		Номенклатура2 = Справочники.Номенклатура.НайтиПоКоду("00-00000008"); // Экспедирование (00-00000019)
		Номенклатура3 = Справочники.Номенклатура.НайтиПоКоду("00-00000029"); // Складские услуги (00-00000055)
		Номенклатура4 = Справочники.Номенклатура.НайтиПоКоду("00-00000004"); // АВТО Собственные (00-00000079)
		Номенклатура5 = Справочники.Номенклатура.НайтиПоКоду("00-00000025"); // <> Таможенные платежи 
		Номенклатура6 = Справочники.Номенклатура.НайтиПоКоду("00-00000046"); // <> Таможенный транзит
		Номенклатура7 = Справочники.Номенклатура.НайтиПоКоду("00-00000047"); // <> Пассажирская декларация
		Номенклатура8 = Справочники.Номенклатура.НайтиПоКоду("00-00000066"); // <> Экспедирование (автовывоз контейнеры)
		Номенклатура9 = Справочники.Номенклатура.НайтиПоКоду("00-00000067"); // <> Экспедирование (автовывоз прочий транспорт)
		Номенклатура10 = Справочники.Номенклатура.НайтиПоКоду("00-00000068"); // <> Экспедирование (автовывоз с перетаркой)
		
	ИначеЕсли  Справочники.Организации.ОрганизацияПоУмолчанию().ИНН = "2315213101" Тогда   // Логистик
		
		Номенклатура1 = Справочники.Номенклатура.НайтиПоКоду("00-00000041"); // ФРАХТ (00-00000041)
		Номенклатура2 = Справочники.Номенклатура.НайтиПоКоду("00-00000019"); // Экспедирование (00-00000019)
		Номенклатура3 = Справочники.Номенклатура.НайтиПоКоду("00-00000055"); // Складские услуги (00-00000055)
		Номенклатура4 = Справочники.Номенклатура.НайтиПоКоду("00-00000079"); // АВТО Собственные (00-00000079)
		Номенклатура5 = Справочники.Номенклатура.НайтиПоКоду("00-00000389"); // <> Таможенные платежи 
		Номенклатура6 = Справочники.Номенклатура.НайтиПоКоду("00-00000392"); // <> Таможенный транзит 
		Номенклатура7 = Справочники.Номенклатура.НайтиПоКоду("00-00000393"); // <> Пассажирская декларация
		Номенклатура8 = Справочники.Номенклатура.НайтиПоКоду("00-00000399"); // <> Экспедирование (автовывоз контейнеры)
		Номенклатура9 = Справочники.Номенклатура.НайтиПоКоду("00-00000400"); // <> Экспедирование (автовывоз прочий транспорт)
		Номенклатура10 = Справочники.Номенклатура.НайтиПоКоду("00-00000401"); // <> Экспедирование (автовывоз с перетаркой)
		
	КонецЕсли;
	
	МассивВидовСделокАСД = Новый Массив;
	
	МассивВидовСделокАСД.Добавить(Перечисления.ВидыСделок.Автоперевозка);
	МассивВидовСделокАСД.Добавить(Перечисления.ВидыСделок.Декларирование);
	МассивВидовСделокАСД.Добавить(Перечисления.ВидыСделок.Сертификация);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("КонецПериода", ПериодОтчета.ДатаОкончания); 
	Запрос.УстановитьПараметр("НачалоПериода", ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("Номенклатура1", Номенклатура1);
	Запрос.УстановитьПараметр("Номенклатура2", Номенклатура2);
	Запрос.УстановитьПараметр("Номенклатура3", Номенклатура3);
	Запрос.УстановитьПараметр("Номенклатура4", Номенклатура4);
	Запрос.УстановитьПараметр("Номенклатура5", Номенклатура5);
	Запрос.УстановитьПараметр("Номенклатура6", Номенклатура6);
	Запрос.УстановитьПараметр("Номенклатура7", Номенклатура7);
	Запрос.УстановитьПараметр("Номенклатура8", Номенклатура8);
	Запрос.УстановитьПараметр("Номенклатура9", Номенклатура9);
	Запрос.УстановитьПараметр("Номенклатура10", Номенклатура10);
	Запрос.УстановитьПараметр("ВидыСделокАСД", МассивВидовСделокАСД);
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
	
	////Отдел экспедирования
	//Выборка = Результат[10].Выгрузить();
	//Для каждого стрВыборка из Выборка Цикл
	//	
	//	СтрТЗ = ТЗ_Начисления.Добавить(); 
	//	СтрТЗ.Сотрудник =  стрВыборка.Ответственный.Наименование;
	//	СтрТЗ.Контрагент = стрВыборка.Контрагент;
	//	СтрТЗ.Сделка = стрВыборка.Сделка;
	//	СтрТЗ.Номенклатура = Строка(СтрВыборка.Номенклатура);
	//	СтрТЗ.Премия = стрВыборка.Премия;
	//	СтрТЗ.Профит = стрВыборка.Профит;
	//	СтрТЗ.Отдел = "ОтделЭкспедирования";
	//	СтрТЗ.ТипПремииСлуж = ""; 
	//	
	//КонецЦикла;
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = "ВЫБРАТЬ
	                |	Сделка.Ссылка КАК Сделка,
	                |	Сделка.Контрагент КАК Контрагент,
	                |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделка_1.Ссылка) КАК Номер
	                |ПОМЕСТИТЬ ВТ_НомераСделок
	                |ИЗ
	                |	Документ.Сделка КАК Сделка
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка_1
	                |		ПО Сделка.МоментВремени >= Сделка_1.МоментВремени
	                |			И Сделка.Контрагент = Сделка_1.Контрагент
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Сделка.Контрагент,
	                |	Сделка.Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	КорректировкаПоступленияТовары.Ссылка.ДокументПоступления КАК ДокументПоступления,
	                |	КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения КАК Сумма,
	                |	КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения КАК СуммаНДС
	                |ПОМЕСТИТЬ ВТ_Корр
	                |ИЗ
	                |	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	КорректировкаПоступленияУслуги.Ссылка.ДокументПоступления,
	                |	КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаДоИзменения,
	                |	КорректировкаПоступленияУслуги.СуммаНДС - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения
	                |ИЗ
	                |	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	КорректировкаПоступленияАгентскиеУслуги.Ссылка.ДокументПоступления,
	                |	КорректировкаПоступленияАгентскиеУслуги.Сумма - КорректировкаПоступленияАгентскиеУслуги.СуммаДоИзменения,
	                |	КорректировкаПоступленияАгентскиеУслуги.СуммаНДС - КорректировкаПоступленияАгентскиеУслуги.СуммаНДСДоИзменения
	                |ИЗ
	                |	Документ.КорректировкаПоступления.АгентскиеУслуги КАК КорректировкаПоступленияАгентскиеУслуги
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	КорректировкаРеализацииТовары.Ссылка.ДокументРеализации КАК ДокументРеализации,
	                |	КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения КАК Сумма,
	                |	КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения КАК СуммаНДС
	                |ПОМЕСТИТЬ ВТ_КоррРеализации
	                |ИЗ
	                |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	КорректировкаРеализацииУслуги.Ссылка.ДокументРеализации,
	                |	КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения,
	                |	КорректировкаРеализацииУслуги.СуммаНДС - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	                |ИЗ
	                |	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	КорректировкаРеализацииАгентскиеУслуги.Ссылка.ДокументРеализации,
	                |	КорректировкаРеализацииАгентскиеУслуги.Сумма - КорректировкаРеализацииАгентскиеУслуги.СуммаДоИзменения,
	                |	КорректировкаРеализацииАгентскиеУслуги.СуммаНДС - КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоИзменения
	                |ИЗ
	                |	Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	                |	СУММА(ВЫБОР
	                |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                |				ТОГДА ВЫБОР
	                |						КОГДА РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |								И РеализацияТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	                |							ТОГДА 0
	                |						ИНАЧЕ РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	                |					КОНЕЦ
	                |			ИНАЧЕ ВЫБОР
	                |					КОГДА РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |							И РеализацияТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	                |						ТОГДА 0
	                |					ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	                |				КОНЕЦ
	                |		КОНЕЦ) КАК СуммаАкта,
	                |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка
	                |ПОМЕСТИТЬ ВТ_Реализации
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	                |		ПО РеализацияТоваровУслугТовары.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	                |ГДЕ
	                |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РеализацияТоваровУслугТовары.Номенклатура,
	                |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ЕСТЬNULL(РеализацияТоваровУслугУслуги.Номенклатура, РеализацияТоваровУслугУслуги.Содержание),
	                |	СУММА(ВЫБОР
	                |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	                |				ТОГДА ВЫБОР
	                |						КОГДА РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |								И РеализацияТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	                |							ТОГДА 0
	                |						ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	                |					КОНЕЦ
	                |			ИНАЧЕ ВЫБОР
	                |					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |							И РеализацияТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	                |						ТОГДА 0
	                |					ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	                |				КОНЕЦ
	                |		КОНЕЦ),
	                |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	                |		ПО РеализацияТоваровУслугУслуги.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	                |ГДЕ
	                |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	                |	ЕСТЬNULL(РеализацияТоваровУслугУслуги.Номенклатура, РеализацияТоваровУслугУслуги.Содержание)
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ЕСТЬNULL(РеализацияТоваровУслугАгентскиеУслуги.Номенклатура, РеализацияТоваровУслугАгентскиеУслуги.Содержание),
	                |	СУММА(ВЫБОР
	                |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	                |				ТОГДА ВЫБОР
	                |						КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |								И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	                |							ТОГДА 0
	                |						ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	                |					КОНЕЦ
	                |			ИНАЧЕ ВЫБОР
	                |					КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |							И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	                |						ТОГДА 0
	                |					ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	                |				КОНЕЦ
	                |		КОНЕЦ),
	                |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	                |		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	                |ГДЕ
	                |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	                |	ЕСТЬNULL(РеализацияТоваровУслугАгентскиеУслуги.Номенклатура, РеализацияТоваровУслугАгентскиеУслуги.Содержание)
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	СделкаВнутренниеДоходы.НаименованиеДохода,
	                |	СУММА(СделкаВнутренниеДоходы.Сумма),
	                |	СделкаВнутренниеДоходы.Ссылка
	                |ИЗ
	                |	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	                |ГДЕ
	                |	СделкаВнутренниеДоходы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	СделкаВнутренниеДоходы.НаименованиеДохода,
	                |	СделкаВнутренниеДоходы.Ссылка
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ОтчетКомитентуОПродажахТовары.Номенклатура,
	                |	ВЫБОР
	                |		КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                |			ТОГДА ВЫБОР
	                |					КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |							И ОтчетКомитентуОПродажахТовары.Номенклатура.Наименование = ""Таможенные платежи""
	                |						ТОГДА 0
	                |					ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	                |				КОНЕЦ
	                |		ИНАЧЕ ВЫБОР
	                |				КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |						И ОтчетКомитентуОПродажахТовары.Номенклатура.Наименование = ""Таможенные платежи""
	                |					ТОГДА 0
	                |				ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	                |			КОНЕЦ
	                |	КОНЕЦ,
	                |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка
	                |ИЗ
	                |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	                |ГДЕ
	                |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ЕСТЬNULL(ВТ_Реализации.СуммаАкта, 0)) КАК СуммаАкта,
	                |	ВТ_Реализации.Номенклатура КАК Номенклатура,
	                |	ВТ_Реализации.Сделка КАК Сделка
	                |ПОМЕСТИТЬ ВТ_Исходящие
	                |ИЗ
	                |	ВТ_Реализации КАК ВТ_Реализации
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_Реализации.Номенклатура,
	                |	ВТ_Реализации.Сделка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ВЫБОР
	                |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
	                |				ТОГДА ВЫБОР
	                |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |								И ПоступлениеТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	                |							ТОГДА 0
	                |						ИНАЧЕ ВЫБОР
	                |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	                |										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	                |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	                |								ИНАЧЕ ВЫБОР
	                |										КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	                |												ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	                |											ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	                |										ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
	                |									КОНЕЦ
	                |							КОНЕЦ
	                |					КОНЕЦ
	                |			ИНАЧЕ ВЫБОР
	                |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |							И ПоступлениеТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	                |						ТОГДА 0
	                |					ИНАЧЕ ВЫБОР
	                |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	                |									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	                |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	                |							ИНАЧЕ ВЫБОР
	                |									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	                |											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	                |										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	                |									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
	                |								КОНЕЦ
	                |						КОНЕЦ
	                |				КОНЕЦ
	                |		КОНЕЦ) КАК СуммаАкта,
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
	                |	ЕСТЬNULL(ПоступлениеТоваровУслугУслуги.Номенклатура, ПоступлениеТоваровУслугУслуги.Содержание) КАК Номенклатура,
	                |	ВТ_Корр.Сумма КАК Сумма,
	                |	ВТ_Корр.СуммаНДС КАК СуммаНДС
	                |ПОМЕСТИТЬ ВТ_Поступления
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	                |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = ВТ_Корр.ДокументПоступления
	                |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	                |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	                |ГДЕ
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	                |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
	                |	ЕСТЬNULL(ПоступлениеТоваровУслугУслуги.Номенклатура, ПоступлениеТоваровУслугУслуги.Содержание),
	                |	ВТ_Корр.Сумма,
	                |	ВТ_Корр.СуммаНДС
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
	                |	СделкаВнутренниеРасходы.Ссылка,
	                |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	                |	NULL,
	                |	NULL
	                |ИЗ
	                |	Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	                |ГДЕ
	                |	СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	                |	И СделкаВнутренниеРасходы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	                |	СделкаВнутренниеРасходы.Ссылка
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	СУММА(ВЫБОР
	                |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                |				ТОГДА ВЫБОР
	                |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |								И ПоступлениеТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	                |							ТОГДА 0
	                |						ИНАЧЕ ВЫБОР
	                |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	                |										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	                |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	                |								ИНАЧЕ ВЫБОР
	                |										КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	                |												ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	                |											ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	                |										ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
	                |									КОНЕЦ
	                |							КОНЕЦ
	                |					КОНЕЦ
	                |			ИНАЧЕ ВЫБОР
	                |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |							И ПоступлениеТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи""
	                |						ТОГДА 0
	                |					ИНАЧЕ ВЫБОР
	                |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	                |									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	                |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	                |							ИНАЧЕ ВЫБОР
	                |									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	                |											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	                |										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	                |									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
	                |								КОНЕЦ
	                |						КОНЕЦ
	                |				КОНЕЦ
	                |		КОНЕЦ),
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	                |	ПоступлениеТоваровУслугТовары.Номенклатура,
	                |	ВТ_Корр.Сумма,
	                |	ВТ_Корр.СуммаНДС
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	                |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	                |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	                |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ВТ_Корр.ДокументПоступления
	                |ГДЕ
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	                |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	                |	ПоступлениеТоваровУслугТовары.Номенклатура,
	                |	ВТ_Корр.Сумма,
	                |	ВТ_Корр.СуммаНДС
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	СУММА(ВЫБОР
	                |			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	                |				ТОГДА ВЫБОР
	                |						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |								И ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	                |							ТОГДА 0
	                |						ИНАЧЕ ВЫБОР
	                |								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	                |										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	                |									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	                |								ИНАЧЕ ВЫБОР
	                |										КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	                |												ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	                |											ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	                |										ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
	                |									КОНЕЦ
	                |							КОНЕЦ
	                |					КОНЕЦ
	                |			ИНАЧЕ ВЫБОР
	                |					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |							И ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи""
	                |						ТОГДА 0
	                |					ИНАЧЕ ВЫБОР
	                |							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	                |									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	                |								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	                |							ИНАЧЕ ВЫБОР
	                |									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	                |											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	                |										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	                |									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
	                |								КОНЕЦ
	                |						КОНЕЦ
	                |				КОНЕЦ
	                |		КОНЕЦ),
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	                |	ЕСТЬNULL(ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура, ПоступлениеТоваровУслугАгентскиеУслуги.Содержание),
	                |	ВТ_Корр.Сумма,
	                |	ВТ_Корр.СуммаНДС
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	                |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	                |			И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	                |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка = ВТ_Корр.ДокументПоступления
	                |ГДЕ
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	                |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	                |	ЕСТЬNULL(ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура, ПоступлениеТоваровУслугАгентскиеУслуги.Содержание),
	                |	ВТ_Корр.Сумма,
	                |	ВТ_Корр.СуммаНДС
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ЕСТЬNULL(ВТ_Поступления.СуммаАкта, 0) + ЕСТЬNULL(ВТ_Поступления.Сумма, 0) + ЕСТЬNULL(ВТ_Поступления.СуммаНДС, 0)) КАК СуммаАкта,
	                |	ВТ_Поступления.Сделка КАК Сделка,
	                |	ВТ_Поступления.Номенклатура КАК Номенклатура
	                |ПОМЕСТИТЬ ВТ_Входящие
	                |ИЗ
	                |	ВТ_Поступления КАК ВТ_Поступления
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_Поступления.Сделка,
	                |	ВТ_Поступления.Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ВТ_Входящие.СуммаАкта) КАК СуммаАктаВходящего,
	                |	СУММА(ВТ_Исходящие.СуммаАкта) КАК СуммаАктаИсходящего,
	                |	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура) КАК Номенклатура,
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка) КАК Сделка,
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент) КАК Контрагент,
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный) КАК Ответственный,
	                |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаАкта, 0) - ЕСТЬNULL(ВТ_Входящие.СуммаАкта, 0)) КАК ПрофитПоАктам,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент)).Наименование КАК КонтрагентНаименование,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный)).Наименование КАК ОтветственныйНаименование,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка)).Дата КАК СделкаДата
	                |ПОМЕСТИТЬ ИВТ_ИтоговыеДанные
	                |ИЗ
	                |	ВТ_Входящие КАК ВТ_Входящие
	                |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Исходящие КАК ВТ_Исходящие
	                |		ПО ВТ_Входящие.Сделка = ВТ_Исходящие.Сделка
	                |			И ВТ_Входящие.Номенклатура = ВТ_Исходящие.Номенклатура
	                |ГДЕ
	                |	(ВТ_Входящие.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |			ИЛИ ВТ_Исходящие.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура),
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка),
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент),
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный),
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент)).Наименование,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный)).Наименование,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка)).Дата
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ИВТ_ИтоговыеДанные.Ответственный КАК Ответственный,
	                |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	                |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	                |	ИВТ_ИтоговыеДанные.СуммаАктаВходящего КАК СуммаАктаВходящего,
	                |	ИВТ_ИтоговыеДанные.СуммаАктаИсходящего КАК СуммаАктаИсходящего,
	                |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК Профит,
	                |	(ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0)) * 0.04 КАК Премия,
	                |	ИВТ_ИтоговыеДанные.Сделка.МенеджерПоРаботеСКлиентами КАК СделкаМенеджерПоРаботеСКлиентами
	                |ПОМЕСТИТЬ ВТ_ДанныеДляОтделаКлиенты
	                |ИЗ
	                |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	                |ГДЕ
	                |	НЕ ИВТ_ИтоговыеДанные.Сделка.Вид В (&ВидыСделокАСД)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ИВТ_ИтоговыеДанные.СуммаАктаВходящего КАК СуммаАктаВходящего,
	                |	ИВТ_ИтоговыеДанные.СуммаАктаИсходящего КАК СуммаАктаИсходящего,
	                |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	                |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	                |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	                |	ИВТ_ИтоговыеДанные.Ответственный КАК Ответственный,
	                |	ИВТ_ИтоговыеДанные.ПрофитПоАктам КАК ПрофитПоАктам,
	                |	ИВТ_ИтоговыеДанные.КонтрагентНаименование КАК КонтрагентНаименование,
	                |	ИВТ_ИтоговыеДанные.ОтветственныйНаименование КАК ОтветственныйНаименование,
	                |	ИВТ_ИтоговыеДанные.СделкаДата КАК СделкаДата,
	                |	ВТ_НомераСделок.Номер КАК НомерСделки,
	                |	ИВТ_ИтоговыеДанные.Сделка.Менеджер КАК МенеджерПоПродажам,
	                |	ВЫБОР
	                |		КОГДА ИВТ_ИтоговыеДанные.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |			ТОГДА ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.04
	                |		ИНАЧЕ 0
	                |	КОНЕЦ КАК ПремияРукОтдДекл,
	                |	ВЫБОР
	                |		КОГДА ВТ_НомераСделок.Номер = 1
	                |			ТОГДА ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.1
	                |		ИНАЧЕ ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.075
	                |	КОНЕЦ КАК ПремияМенеджерПродаж,
	                |	ИВТ_ИтоговыеДанные.Сделка.МенеджерПоРаботеСКлиентами КАК СделкаМенеджерПоРаботеСКлиентами
	                |ПОМЕСТИТЬ ВТ_ИтогДанныеСНомерамиСделок
	                |ИЗ
	                |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераСделок КАК ВТ_НомераСделок
	                |		ПО ИВТ_ИтоговыеДанные.Сделка = ВТ_НомераСделок.Сделка";
	
	Запрос1.УстановитьПараметр("ПониженнаяСтавка", ПониженнаяСтавка);
	Запрос1.УстановитьПараметр("КонецПериода", ПериодОтчета.ДатаОкончания); 
	Запрос1.УстановитьПараметр("НачалоПериода", ПериодОтчета.ДатаНачала);
	Запрос1.УстановитьПараметр("ВидыСделокАСД", МассивВидовСделокАСД);
	
	Результат1 = Запрос1.ВыполнитьПакетСПромежуточнымиДанными();
	
	// Отдел работы с клиентами
	Выборка = Результат1[8].Выгрузить();
	Для каждого стрВыборка из Выборка Цикл
		
		СтрТЗ = ТЗ_Начисления.Добавить(); 
		СтрТЗ.Сотрудник =  стрВыборка.СделкаМенеджерПоРаботеСКлиентами.Наименование;
		СтрТЗ.Контрагент = стрВыборка.Контрагент;
		СтрТЗ.Сделка = стрВыборка.Сделка;
		СтрТЗ.Номенклатура = Строка(СтрВыборка.Номенклатура);
		СтрТЗ.Премия = стрВыборка.Премия;
		СтрТЗ.Профит = стрВыборка.Профит;
		СтрТЗ.Отдел = "ОтделРаботыСКлиентами";
		СтрТЗ.ТипПремииСлуж = "Отдел работы с клиентами"; 
		СтрТЗ.СуммаАктРеализации = стрВыборка.СуммаАктаИсходящего;
		СтрТЗ.СуммаАктПоступление = стрВыборка.СуммаАктаВходящего;
		
	КонецЦикла;	
	
	// Авто собственное
	ВыборкаАвто = Результат[9].Выгрузить(); 
	СотрудникПоАвтоСобственное = Справочники.Пользователи.НайтиПоНаименованию("Мельникова Елена Александровнаа");
    Для каждого стрВыборкаАвто из ВыборкаАвто Цикл
		
			СтрТЗ = ТЗ_Начисления.Добавить(); 
			СтрТЗ.Сотрудник =  "Мельникова Елена Александровна"; 
			СтрТЗ.Контрагент = стрВыборкаАвто.Контрагент;
			СтрТЗ.Сделка = стрВыборкаАвто.Сделка;
			СтрТЗ.Номенклатура = Строка(стрВыборкаАвто.Номенклатура); //+ "(Авто собственное)";
			СтрТЗ.Премия = 0;
			СтрТЗ.Профит = стрВыборкаАвто.ПрофитАвто;
			СтрТЗ.Отдел = "АвтоперевозкиСобств";
			СтрТЗ.ТипПремииСлуж = "Автоперевозки собственные"; 
			СтрТЗ.СуммаАктРеализации = стрВыборкаАвто.СуммаАктаИсходящего;
			СтрТЗ.СуммаАктПоступление = стрВыборкаАвто.СуммаАктаВходящего;
		
	КонецЦикла;	  
	
	// Сделка - Автоперевозка
	ВыборкаСделкаАвтоперевозка = Результат[11].Выгрузить();
    Для каждого стрВыборкаСделкаАвтоперевозка из ВыборкаСделкаАвтоперевозка Цикл
		
			СтрТЗ = ТЗ_Начисления.Добавить(); 
			СтрТЗ.Сотрудник =  "Мельникова Елена Александровна"; 
			СтрТЗ.Контрагент = стрВыборкаСделкаАвтоперевозка.Контрагент;
			СтрТЗ.Сделка = стрВыборкаСделкаАвтоперевозка.Сделка;
			СтрТЗ.Номенклатура = Строка(стрВыборкаСделкаАвтоперевозка.Номенклатура); // + "(Сделка - Автоперевозка)";
			СтрТЗ.Премия = стрВыборкаСделкаАвтоперевозка.ПрофитСделкаАвто * 0.015 ;
			СтрТЗ.Профит = стрВыборкаСделкаАвтоперевозка.ПрофитСделкаАвто;
			СтрТЗ.Отдел = "СделкаАвтоперевозка";
			СтрТЗ.ТипПремииСлуж = "Автоперевозка";
			СтрТЗ.СуммаАктРеализации = стрВыборкаСделкаАвтоперевозка.СуммаАктаИсходящего;
			СтрТЗ.СуммаАктПоступление = стрВыборкаСделкаАвтоперевозка.СуммаАктаВходящего;
		
	КонецЦикла;	  
	
	//Продажи, ОтделДекларирования, сертификация
	Выборка = Результат1[9].Выгрузить();
    Для каждого СтрВыборка из Выборка Цикл
		// менеджер продаж
		
		НомерСделки = ПолучитьНомерСделки(стрВыборка.Сделка);
		
		СтрТЗ = ТЗ_Начисления.Добавить(); 
		СтрТЗ.Сотрудник =  СтрВыборка.МенеджерПоПродажам.Наименование;
		СтрТЗ.Контрагент = СтрВыборка.Контрагент;
		СтрТЗ.Сделка = СтрВыборка.Сделка;
		СтрТЗ.Номенклатура = Строка(СтрВыборка.Номенклатура);//  + "(Отдел продаж)";
		СтрТЗ.Премия = ?(НомерСделки = 1, СтрВыборка.ПрофитПоАктам * 0.1, СтрВыборка.ПрофитПоАктам * 0.075); //СтрВыборка.ПремияМенеджерПродаж;
		СтрТЗ.Профит = СтрВыборка.ПрофитПоАктам;
		СтрТЗ.Отдел = "ОтделПродаж";
		СтрТЗ.ТипПремииСлуж = "Отдел продаж"; 
		СтрТЗ.СуммаАктРеализации = СтрВыборка.СуммаАктаИсходящего;
		СтрТЗ.СуммаАктПоступление = СтрВыборка.СуммаАктаВходящего;
		
		
		//руководитель отдела декларирования
		Если СтрВыборка.Сделка.Вид = Перечисления.ВидыСделок.Декларирование Тогда
			СтрТЗ = ТЗ_Начисления.Добавить(); 
			СтрТЗ.Сотрудник =  "А_Руководитель отдела декларирования";
			СтрТЗ.Контрагент = СтрВыборка.Контрагент;
			СтрТЗ.Сделка = СтрВыборка.Сделка;
			СтрТЗ.Номенклатура = Строка(СтрВыборка.Номенклатура);
			СтрТЗ.Премия = СтрВыборка.ПремияРукОтдДекл;
			СтрТЗ.Профит = СтрВыборка.ПрофитПоАктам;
			СтрТЗ.Отдел = "Декларирование";
			СтрТЗ.ТипПремииСлуж = "Декларирование"; 
			СтрТЗ.СуммаАктРеализации = СтрВыборка.СуммаАктаИсходящего;
			СтрТЗ.СуммаАктПоступление = СтрВыборка.СуммаАктаВходящего;
		КонецЕсли;
		
		// Премия по сертификации
		Если СтрВыборка.Сделка.Вид = Перечисления.ВидыСделок.Сертификация Тогда
			СтрТЗ = ТЗ_Начисления.Добавить(); 
			СтрТЗ.Сотрудник =  "Мельникова Елена Александровна"; 
			СтрТЗ.Контрагент = СтрВыборка.Контрагент;
			СтрТЗ.Сделка = СтрВыборка.Сделка;
			СтрТЗ.Номенклатура = СтрВыборка.Сделка.НомераСертификатов;
			СтрТЗ.Премия = СтрВыборка.Сделка.КоличествоСертификатов * 500;
			СтрТЗ.Профит = 0;
			СтрТЗ.Отдел = "Сертификация";
			СтрТЗ.ТипПремииСлуж = "Сертификация";
			СтрТЗ.СуммаАктРеализации = СтрВыборка.СуммаАктаИсходящего;
			СтрТЗ.СуммаАктПоступление = СтрВыборка.СуммаАктаВходящего;
		КонецЕсли; 
		
	КонецЦикла;	

		
КонецПроцедуры
//Для Логиста
&НаСервере
Процедура ЗаполнитьТЗДаннымиЛогист(ТЗ_Начисления)
	
	ТЗСтавкиНДС = ПолучитьТаблицуСтавокНДС();
	
	Счета76 = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Код ПОДОБНО ""76%""
	|";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		Счета76.Добавить(Выборка.Ссылка);
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сделка.Ссылка КАК Сделка,
	               |	Сделка.Контрагент КАК Контрагент,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделка_1.Ссылка) КАК Номер
	               |ПОМЕСТИТЬ ВТ_НомераСделок
	               |ИЗ
	               |	Документ.Сделка КАК Сделка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка_1
	               |		ПО Сделка.МоментВремени >= Сделка_1.МоментВремени
	               |			И Сделка.Контрагент = Сделка_1.Контрагент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Сделка.Контрагент,
	               |	Сделка.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиНДС.СтавкаНДС КАК СтавкаНДС,
	               |	СтавкиНДС.СтавкаНДСЧисло КАК СтавкаНДСЧисло
	               |ПОМЕСТИТЬ ВТ_СтавкиНДС
	               |ИЗ
	               |	&СтавкиНДС КАК СтавкиНДС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КорректировкаПоступленияТовары.Ссылка.ДокументПоступления КАК ДокументПоступления,
	               |	КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения КАК Сумма,
	               |	КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения КАК СуммаНДС
	               |ПОМЕСТИТЬ ВТ_Корр
	               |ИЗ
	               |	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаПоступленияУслуги.Ссылка.ДокументПоступления,
	               |	КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаДоИзменения,
	               |	КорректировкаПоступленияУслуги.СуммаНДС - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения
	               |ИЗ
	               |	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаПоступленияАгентскиеУслуги.Ссылка.ДокументПоступления,
	               |	КорректировкаПоступленияАгентскиеУслуги.Сумма - КорректировкаПоступленияАгентскиеУслуги.СуммаДоИзменения,
	               |	КорректировкаПоступленияАгентскиеУслуги.СуммаНДС - КорректировкаПоступленияАгентскиеУслуги.СуммаНДСДоИзменения
	               |ИЗ
	               |	Документ.КорректировкаПоступления.АгентскиеУслуги КАК КорректировкаПоступленияАгентскиеУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КорректировкаРеализацииТовары.Ссылка.ДокументРеализации КАК ДокументРеализации,
	               |	КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения КАК Сумма,
	               |	КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения КАК СуммаНДС
	               |ПОМЕСТИТЬ ВТ_КоррРеализации
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаРеализацииУслуги.Ссылка.ДокументРеализации,
	               |	КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения,
	               |	КорректировкаРеализацииУслуги.СуммаНДС - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаРеализацииАгентскиеУслуги.Ссылка.ДокументРеализации,
	               |	КорректировкаРеализацииАгентскиеУслуги.Сумма - КорректировкаРеализацииАгентскиеУслуги.СуммаДоИзменения,
	               |	КорректировкаРеализацииАгентскиеУслуги.СуммаНДС - КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоИзменения
	               |ИЗ
	               |	Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0) - (РеализацияТоваровУслугТовары.СуммаНДС + ЕСТЬNULL(ВТ_КоррРеализации.СуммаНДС, 0))
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0)
	               |		КОНЕЦ) КАК СуммаАкта,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка
	               |ПОМЕСТИТЬ ВТ_Реализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	               |		ПО РеализацияТоваровУслугТовары.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(РеализацияТоваровУслугУслуги.Номенклатура, РеализацияТоваровУслугУслуги.Содержание),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0) - (РеализацияТоваровУслугУслуги.СуммаНДС + ЕСТЬNULL(ВТ_КоррРеализации.СуммаНДС, 0))
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0)
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	               |		ПО РеализацияТоваровУслугУслуги.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	ЕСТЬNULL(РеализацияТоваровУслугУслуги.Номенклатура, РеализацияТоваровУслугУслуги.Содержание)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(РеализацияТоваровУслугАгентскиеУслуги.Номенклатура, РеализацияТоваровУслугАгентскиеУслуги.Содержание),
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0) - (РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС + ЕСТЬNULL(ВТ_КоррРеализации.СуммаНДС, 0))
	               |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0)
	               |		КОНЕЦ),
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	               |		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	               |	ЕСТЬNULL(РеализацияТоваровУслугАгентскиеУслуги.Номенклатура, РеализацияТоваровУслугАгентскиеУслуги.Содержание)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СУММА(СделкаВнутренниеДоходы.Сумма),
	               |	СделкаВнутренниеДоходы.Ссылка
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	               |ГДЕ
	               |	СделкаВнутренниеДоходы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаВнутренниеДоходы.НаименованиеДохода,
	               |	СделкаВнутренниеДоходы.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажахТовары.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |							И ОтчетКомитентуОПродажахТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |						ТОГДА 0
	               |					ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |						И ОтчетКомитентуОПродажахТовары.Номенклатура.Наименование = ""Таможенные платежи""
	               |					ТОГДА 0
	               |				ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |ГДЕ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен
	               |	И НЕ ОтчетКомитентуОПродажахТовары.Ссылка.ПометкаУдаления
	               |	И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВТ_Реализации.СуммаАкта, 0)) КАК СуммаАкта,
	               |	ВТ_Реализации.Номенклатура КАК Номенклатура,
	               |	ВТ_Реализации.Сделка КАК Сделка
	               |ПОМЕСТИТЬ ВТ_Исходящие
	               |ИЗ
	               |	ВТ_Реализации КАК ВТ_Реализации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Реализации.Номенклатура,
	               |	ВТ_Реализации.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	               |				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	               |			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	               |						И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	               |					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	               |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ / (1 + ВТ_СтавкиНДС.СтавкаНДСЧисло / 100) КАК СуммаАкта,
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
	               |	ЕСТЬNULL(ПоступлениеТоваровУслугУслуги.Номенклатура, ПоступлениеТоваровУслугУслуги.Содержание) КАК Номенклатура,
	               |	ВТ_Корр.Сумма КАК Сумма,
	               |	ВТ_Корр.СуммаНДС КАК СуммаНДС
	               |ПОМЕСТИТЬ ВТ_ПоступленияСтавкаНДС
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНДС КАК ВТ_СтавкиНДС
	               |			ПО ПоступлениеТоваровУслугУслуги.СтавкаНДС = ВТ_СтавкиНДС.СтавкаНДС
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	               |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = ВТ_Корр.ДокументПоступления
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0),
	               |	СделкаВнутренниеРасходы.Ссылка,
	               |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	               |ГДЕ
	               |	СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	               |	И СделкаВнутренниеРасходы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	               |				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	               |			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	               |						И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	               |					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	               |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ / (1 + ВТ_СтавкиНДС.СтавкаНДСЧисло / 100),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура,
	               |	ВТ_Корр.Сумма,
	               |	ВТ_Корр.СуммаНДС
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНДС КАК ВТ_СтавкиНДС
	               |			ПО ПоступлениеТоваровУслугТовары.Сумма = ВТ_СтавкиНДС.СтавкаНДС
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	               |			ПО ПоступлениеТоваровУслугТовары.Ссылка = ВТ_Корр.ДокументПоступления
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	               |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	               |				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	               |			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	               |						И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	               |					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	               |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ / (1 + ВТ_СтавкиНДС.СтавкаНДСЧисло / 100),
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	               |	ЕСТЬNULL(ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура, ПоступлениеТоваровУслугАгентскиеУслуги.Содержание),
	               |	ВТ_Корр.Сумма,
	               |	ВТ_Корр.СуммаНДС
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНДС КАК ВТ_СтавкиНДС
	               |			ПО ПоступлениеТоваровУслугАгентскиеУслуги.СтавкаНДС = ВТ_СтавкиНДС.СтавкаНДС
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	               |			ПО ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ВТ_Корр.ДокументПоступления
	               |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	               |			И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	               |ГДЕ
	               |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ_ПоступленияСтавкаНДС.СуммаАкта) КАК СуммаАкта,
	               |	ВТ_ПоступленияСтавкаНДС.Сделка КАК Сделка,
	               |	ВТ_ПоступленияСтавкаНДС.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Поступления
	               |ИЗ
	               |	ВТ_ПоступленияСтавкаНДС КАК ВТ_ПоступленияСтавкаНДС
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПоступленияСтавкаНДС.Номенклатура,
	               |	ВТ_ПоступленияСтавкаНДС.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВТ_Поступления.СуммаАкта, 0)) КАК СуммаАкта,
	               |	ВТ_Поступления.Сделка КАК Сделка,
	               |	ВТ_Поступления.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Входящие
	               |ИЗ
	               |	ВТ_Поступления КАК ВТ_Поступления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Поступления.Сделка,
	               |	ВТ_Поступления.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ_Входящие.СуммаАкта) КАК СуммаАктаВходящего,
	               |	СУММА(ВТ_Исходящие.СуммаАкта) КАК СуммаАктаИсходящего,
	               |	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка) КАК Сделка,
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент) КАК Контрагент,
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный) КАК Ответственный,
	               |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаАкта, 0) - ЕСТЬNULL(ВТ_Входящие.СуммаАкта, 0)) КАК ПрофитПоАктам,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент)).Наименование КАК КонтрагентНаименование,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный)).Наименование КАК ОтветственныйНаименование,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка)).Дата КАК СделкаДата
	               |ПОМЕСТИТЬ ИВТ_ИтоговыеДанные
	               |ИЗ
	               |	ВТ_Входящие КАК ВТ_Входящие
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Исходящие КАК ВТ_Исходящие
	               |		ПО ВТ_Входящие.Сделка = ВТ_Исходящие.Сделка
	               |			И ВТ_Входящие.Номенклатура = ВТ_Исходящие.Номенклатура
	               |ГДЕ
	               |	(ВТ_Входящие.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ ВТ_Исходящие.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура),
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка),
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент),
	               |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный),
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент)).Наименование,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный)).Наименование,
	               |	(ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка)).Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИВТ_ИтоговыеДанные.Ответственный КАК Ответственный,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.СуммаАктаВходящего КАК СуммаАктаВходящего,
	               |	ИВТ_ИтоговыеДанные.СуммаАктаИсходящего КАК СуммаАктаИсходящего,
	               |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК Профит,
	               |	(ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0)) * 0.04 КАК Премия,
	               |	ИВТ_ИтоговыеДанные.Сделка.МенеджерПоРаботеСКлиентами КАК МенеджерПоРаботеСКлиентами
	               |ПОМЕСТИТЬ ВТ_ДанныеДляОтделаКлиенты
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	               |ГДЕ
	               |	НЕ ИВТ_ИтоговыеДанные.Сделка.Вид В (&ВидыСделокАСД)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.Номенклатура, """""""") КАК Номенклатура,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) КАК СуммаАктаИсходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК СуммаАктаВходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК ПрофитАвто
	               |ПОМЕСТИТЬ ВТ_АвтоСобственное
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	               |ГДЕ
	               |	ИВТ_ИтоговыеДанные.Номенклатура = &Номенклатура4
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИВТ_ИтоговыеДанные.СуммаАктаВходящего КАК СуммаАктаВходящего,
	               |	ИВТ_ИтоговыеДанные.СуммаАктаИсходящего КАК СуммаАктаИсходящего,
	               |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ИВТ_ИтоговыеДанные.Ответственный КАК Ответственный,
	               |	ИВТ_ИтоговыеДанные.ПрофитПоАктам КАК ПрофитПоАктам,
	               |	ИВТ_ИтоговыеДанные.КонтрагентНаименование КАК КонтрагентНаименование,
	               |	ИВТ_ИтоговыеДанные.ОтветственныйНаименование КАК ОтветственныйНаименование,
	               |	ИВТ_ИтоговыеДанные.СделкаДата КАК СделкаДата,
	               |	ВТ_НомераСделок.Номер КАК НомерСделки,
	               |	ИВТ_ИтоговыеДанные.Сделка.Менеджер КАК МенеджерПоПродажам,
	               |	ВЫБОР
	               |		КОГДА ИВТ_ИтоговыеДанные.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	               |			ТОГДА ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.04
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПремияРукОтдДекл,
	               |	ВЫБОР
	               |		КОГДА ВТ_НомераСделок.Номер = 1
	               |			ТОГДА ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.1
	               |		ИНАЧЕ ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.075
	               |	КОНЕЦ КАК ПремияМенеджерПродаж
	               |ПОМЕСТИТЬ ВТ_ИтогДанныеСНомерамиСделок
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераСделок КАК ВТ_НомераСделок
	               |		ПО ИВТ_ИтоговыеДанные.Сделка = ВТ_НомераСделок.Сделка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) КАК СуммаАктаИсходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК СуммаАктаВходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК ПрофитСделкаАвто
	               |ПОМЕСТИТЬ ВТ_СделкаАвтоперевозка
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	               |ГДЕ
	               |	ИВТ_ИтоговыеДанные.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Автоперевозка)
	               |	И ИВТ_ИтоговыеДанные.СуммаАктаВходящего > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.Номенклатура, """""""") КАК Номенклатура,
	               |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	               |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) КАК СуммаАктаИсходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК СуммаАктаВходящего,
	               |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК ПрофитАвто
	               |ПОМЕСТИТЬ ВТ_Экспедирование
	               |ИЗ
	               |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные";  
	
	Запрос.УстановитьПараметр("Счета76", Счета76); 
	Запрос.УстановитьПараметр("СтавкиНДС", ТЗСтавкиНДС);
	
	Если Справочники.Организации.ОрганизацияПоУмолчанию().ИНН = "5074080761" Тогда    // Декларант
		
		Номенклатура1 = Справочники.Номенклатура.НайтиПоКоду("00-00000013"); // ФРАХТ (00-00000041)
		Номенклатура2 = Справочники.Номенклатура.НайтиПоКоду("00-00000008"); // Экспедирование (00-00000019)
		Номенклатура3 = Справочники.Номенклатура.НайтиПоКоду("00-00000029"); // Складские услуги (00-00000055)
		Номенклатура4 = Справочники.Номенклатура.НайтиПоКоду("00-00000004"); // АВТО Собственные (00-00000079)
		Номенклатура5 = Справочники.Номенклатура.НайтиПоКоду("00-00000025"); // <> Таможенные платежи 
		Номенклатура6 = Справочники.Номенклатура.НайтиПоКоду("00-00000046"); // <> Таможенный транзит
		Номенклатура7 = Справочники.Номенклатура.НайтиПоКоду("00-00000047"); // <> Пассажирская декларация
		Номенклатура8 = Справочники.Номенклатура.НайтиПоКоду("00-00000066"); // <> Экспедирование (автовывоз контейнеры)
		Номенклатура9 = Справочники.Номенклатура.НайтиПоКоду("00-00000067"); // <> Экспедирование (автовывоз прочий транспорт)
		Номенклатура10 = Справочники.Номенклатура.НайтиПоКоду("00-00000068"); // <> Экспедирование (автовывоз с перетаркой)
		
	ИначеЕсли  Справочники.Организации.ОрганизацияПоУмолчанию().ИНН = "2315213101" Тогда   // Логистик
		
		Номенклатура1 = Справочники.Номенклатура.НайтиПоКоду("00-00000041"); // ФРАХТ (00-00000041)
		Номенклатура2 = Справочники.Номенклатура.НайтиПоКоду("00-00000019"); // Экспедирование (00-00000019)
		Номенклатура3 = Справочники.Номенклатура.НайтиПоКоду("00-00000055"); // Складские услуги (00-00000055)
		Номенклатура4 = Справочники.Номенклатура.НайтиПоКоду("00-00000079"); // АВТО Собственные (00-00000079)
		Номенклатура5 = Справочники.Номенклатура.НайтиПоКоду("00-00000389"); // <> Таможенные платежи
		Номенклатура6 = Справочники.Номенклатура.НайтиПоКоду("00-00000392"); // <> Таможенный транзит 
		Номенклатура7 = Справочники.Номенклатура.НайтиПоКоду("00-00000393"); // <> Пассажирская декларация
		Номенклатура8 = Справочники.Номенклатура.НайтиПоКоду("00-00000399"); // <> Экспедирование (автовывоз контейнеры)
		Номенклатура9 = Справочники.Номенклатура.НайтиПоКоду("00-00000400"); // <> Экспедирование (автовывоз прочий транспорт)
		Номенклатура10 = Справочники.Номенклатура.НайтиПоКоду("00-00000401"); // <> Экспедирование (автовывоз с перетаркой)
		
	КонецЕсли;
	
	МассивВидовСделокАСД = Новый Массив;
	
	МассивВидовСделокАСД.Добавить(Перечисления.ВидыСделок.Автоперевозка);
	МассивВидовСделокАСД.Добавить(Перечисления.ВидыСделок.Декларирование);
	МассивВидовСделокАСД.Добавить(Перечисления.ВидыСделок.Сертификация);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("КонецПериода", ПериодОтчета.ДатаОкончания); 
	Запрос.УстановитьПараметр("НачалоПериода", ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("Номенклатура1", Номенклатура1);
	Запрос.УстановитьПараметр("Номенклатура2", Номенклатура2);
	Запрос.УстановитьПараметр("Номенклатура3", Номенклатура3);
	Запрос.УстановитьПараметр("Номенклатура4", Номенклатура4);
	Запрос.УстановитьПараметр("Номенклатура5", Номенклатура5);
	Запрос.УстановитьПараметр("Номенклатура6", Номенклатура6);
	Запрос.УстановитьПараметр("Номенклатура7", Номенклатура7);
	Запрос.УстановитьПараметр("Номенклатура8", Номенклатура8);
	Запрос.УстановитьПараметр("Номенклатура9", Номенклатура9);
	Запрос.УстановитьПараметр("Номенклатура10", Номенклатура10);
	Запрос.УстановитьПараметр("ВидыСделокАСД", МассивВидовСделокАСД);
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
	
	////Отдел экспедирования
	//Выборка = Результат[10].Выгрузить();
	//Для каждого стрВыборка из Выборка Цикл
	//	
	//	СтрТЗ = ТЗ_Начисления.Добавить(); 
	//	СтрТЗ.Сотрудник =  стрВыборка.Ответственный.Наименование;
	//	СтрТЗ.Контрагент = стрВыборка.Контрагент;
	//	СтрТЗ.Сделка = стрВыборка.Сделка;
	//	СтрТЗ.Номенклатура = Строка(СтрВыборка.Номенклатура);
	//	СтрТЗ.Премия = стрВыборка.Премия;
	//	СтрТЗ.Профит = стрВыборка.Профит;
	//	СтрТЗ.Отдел = "ОтделЭкспедирования";
	//	СтрТЗ.ТипПремииСлуж = ""; 
	//	
	//КонецЦикла;	
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = "ВЫБРАТЬ
	                |	Сделка.Ссылка КАК Сделка,
	                |	Сделка.Контрагент КАК Контрагент,
	                |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделка_1.Ссылка) КАК Номер
	                |ПОМЕСТИТЬ ВТ_НомераСделок
	                |ИЗ
	                |	Документ.Сделка КАК Сделка
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка_1
	                |		ПО Сделка.МоментВремени >= Сделка_1.МоментВремени
	                |			И Сделка.Контрагент = Сделка_1.Контрагент
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Сделка.Контрагент,
	                |	Сделка.Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СтавкиНДС.СтавкаНДС КАК СтавкаНДС,
	                |	СтавкиНДС.СтавкаНДСЧисло КАК СтавкаНДСЧисло
	                |ПОМЕСТИТЬ ВТ_СтавкиНДС
	                |ИЗ
	                |	&СтавкиНДС КАК СтавкиНДС
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	КорректировкаПоступленияТовары.Ссылка.ДокументПоступления КАК ДокументПоступления,
	                |	КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаДоИзменения КАК Сумма,
	                |	КорректировкаПоступленияТовары.СуммаНДС - КорректировкаПоступленияТовары.СуммаНДСДоИзменения КАК СуммаНДС
	                |ПОМЕСТИТЬ ВТ_Корр
	                |ИЗ
	                |	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	КорректировкаПоступленияУслуги.Ссылка.ДокументПоступления,
	                |	КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаДоИзменения,
	                |	КорректировкаПоступленияУслуги.СуммаНДС - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения
	                |ИЗ
	                |	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	КорректировкаПоступленияАгентскиеУслуги.Ссылка.ДокументПоступления,
	                |	КорректировкаПоступленияАгентскиеУслуги.Сумма - КорректировкаПоступленияАгентскиеУслуги.СуммаДоИзменения,
	                |	КорректировкаПоступленияАгентскиеУслуги.СуммаНДС - КорректировкаПоступленияАгентскиеУслуги.СуммаНДСДоИзменения
	                |ИЗ
	                |	Документ.КорректировкаПоступления.АгентскиеУслуги КАК КорректировкаПоступленияАгентскиеУслуги
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	КорректировкаРеализацииТовары.Ссылка.ДокументРеализации КАК ДокументРеализации,
	                |	КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения КАК Сумма,
	                |	КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения КАК СуммаНДС
	                |ПОМЕСТИТЬ ВТ_КоррРеализации
	                |ИЗ
	                |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	КорректировкаРеализацииУслуги.Ссылка.ДокументРеализации,
	                |	КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения,
	                |	КорректировкаРеализацииУслуги.СуммаНДС - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	                |ИЗ
	                |	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	КорректировкаРеализацииАгентскиеУслуги.Ссылка.ДокументРеализации,
	                |	КорректировкаРеализацииАгентскиеУслуги.Сумма - КорректировкаРеализацииАгентскиеУслуги.СуммаДоИзменения,
	                |	КорректировкаРеализацииАгентскиеУслуги.СуммаНДС - КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоИзменения
	                |ИЗ
	                |	Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	                |	СУММА(ВЫБОР
	                |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	                |				ТОГДА РеализацияТоваровУслугТовары.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0) - (РеализацияТоваровУслугТовары.СуммаНДС + ЕСТЬNULL(ВТ_КоррРеализации.СуммаНДС, 0))
	                |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0)
	                |		КОНЕЦ) КАК СуммаАкта,
	                |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка
	                |ПОМЕСТИТЬ ВТ_Реализации
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	                |		ПО РеализацияТоваровУслугТовары.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	                |ГДЕ
	                |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РеализацияТоваровУслугТовары.Номенклатура,
	                |	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ЕСТЬNULL(РеализацияТоваровУслугУслуги.Номенклатура, РеализацияТоваровУслугУслуги.Содержание),
	                |	СУММА(ВЫБОР
	                |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	                |				ТОГДА РеализацияТоваровУслугУслуги.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0) - (РеализацияТоваровУслугУслуги.СуммаНДС + ЕСТЬNULL(ВТ_КоррРеализации.СуммаНДС, 0))
	                |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0)
	                |		КОНЕЦ),
	                |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	                |		ПО РеализацияТоваровУслугУслуги.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	                |ГДЕ
	                |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	                |	ЕСТЬNULL(РеализацияТоваровУслугУслуги.Номенклатура, РеализацияТоваровУслугУслуги.Содержание)
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ЕСТЬNULL(РеализацияТоваровУслугАгентскиеУслуги.Номенклатура, РеализацияТоваровУслугАгентскиеУслуги.Содержание),
	                |	СУММА(ВЫБОР
	                |			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	                |				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0) - (РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС + ЕСТЬNULL(ВТ_КоррРеализации.СуммаНДС, 0))
	                |			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + ЕСТЬNULL(ВТ_КоррРеализации.Сумма, 0)
	                |		КОНЕЦ),
	                |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоррРеализации КАК ВТ_КоррРеализации
	                |		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = ВТ_КоррРеализации.ДокументРеализации
	                |ГДЕ
	                |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
	                |	ЕСТЬNULL(РеализацияТоваровУслугАгентскиеУслуги.Номенклатура, РеализацияТоваровУслугАгентскиеУслуги.Содержание)
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	СделкаВнутренниеДоходы.НаименованиеДохода,
	                |	СУММА(СделкаВнутренниеДоходы.Сумма),
	                |	СделкаВнутренниеДоходы.Ссылка
	                |ИЗ
	                |	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
	                |ГДЕ
	                |	СделкаВнутренниеДоходы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	СделкаВнутренниеДоходы.НаименованиеДохода,
	                |	СделкаВнутренниеДоходы.Ссылка
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ОтчетКомитентуОПродажахТовары.Номенклатура,
	                |	ВЫБОР
	                |		КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	                |			ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
	                |		ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
	                |	КОНЕЦ,
	                |	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка
	                |ИЗ
	                |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	                |ГДЕ
	                |	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен
	                |	И НЕ ОтчетКомитентуОПродажахТовары.Ссылка.ПометкаУдаления
	                |	И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ЕСТЬNULL(ВТ_Реализации.СуммаАкта, 0)) КАК СуммаАкта,
	                |	ВТ_Реализации.Номенклатура КАК Номенклатура,
	                |	ВТ_Реализации.Сделка КАК Сделка
	                |ПОМЕСТИТЬ ВТ_Исходящие
	                |ИЗ
	                |	ВТ_Реализации КАК ВТ_Реализации
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_Реализации.Номенклатура,
	                |	ВТ_Реализации.Сделка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВЫБОР
	                |		КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
	                |				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
	                |			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
	                |		ИНАЧЕ ВЫБОР
	                |				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
	                |						И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
	                |					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
	                |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
	                |			КОНЕЦ
	                |	КОНЕЦ / (1 + ВТ_СтавкиНДС.СтавкаНДСЧисло / 100) КАК СуммаАкта,
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
	                |	ЕСТЬNULL(ПоступлениеТоваровУслугУслуги.Номенклатура, ПоступлениеТоваровУслугУслуги.Содержание) КАК Номенклатура,
	                |	ВТ_Корр.Сумма КАК Сумма,
	                |	ВТ_Корр.СуммаНДС КАК СуммаНДС
	                |ПОМЕСТИТЬ ВТ_ПоступленияСтавкаНДС
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНДС КАК ВТ_СтавкиНДС
	                |			ПО ПоступлениеТоваровУслугУслуги.СтавкаНДС = ВТ_СтавкиНДС.СтавкаНДС
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	                |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = ВТ_Корр.ДокументПоступления
	                |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
	                |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	                |ГДЕ
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
	                |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0),
	                |	СделкаВнутренниеРасходы.Ссылка,
	                |	СделкаВнутренниеРасходы.НаименованиеРасхода,
	                |	NULL,
	                |	NULL
	                |ИЗ
	                |	Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
	                |ГДЕ
	                |	СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
	                |	И СделкаВнутренниеРасходы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ВЫБОР
	                |		КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
	                |				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
	                |			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
	                |		ИНАЧЕ ВЫБОР
	                |				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
	                |						И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
	                |					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
	                |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
	                |			КОНЕЦ
	                |	КОНЕЦ / (1 + ВТ_СтавкиНДС.СтавкаНДСЧисло / 100),
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
	                |	ПоступлениеТоваровУслугТовары.Номенклатура,
	                |	ВТ_Корр.Сумма,
	                |	ВТ_Корр.СуммаНДС
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНДС КАК ВТ_СтавкиНДС
	                |			ПО ПоступлениеТоваровУслугТовары.Сумма = ВТ_СтавкиНДС.СтавкаНДС
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	                |			ПО ПоступлениеТоваровУслугТовары.Ссылка = ВТ_Корр.ДокументПоступления
	                |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
	                |			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	                |ГДЕ
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
	                |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ВЫБОР
	                |		КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
	                |				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
	                |			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
	                |		ИНАЧЕ ВЫБОР
	                |				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
	                |						И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
	                |					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
	                |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
	                |			КОНЕЦ
	                |	КОНЕЦ / (1 + ВТ_СтавкиНДС.СтавкаНДСЧисло / 100),
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
	                |	ЕСТЬNULL(ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура, ПоступлениеТоваровУслугАгентскиеУслуги.Содержание),
	                |	ВТ_Корр.Сумма,
	                |	ВТ_Корр.СуммаНДС
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНДС КАК ВТ_СтавкиНДС
	                |			ПО ПоступлениеТоваровУслугАгентскиеУслуги.СтавкаНДС = ВТ_СтавкиНДС.СтавкаНДС
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корр КАК ВТ_Корр
	                |			ПО ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ВТ_Корр.ДокументПоступления
	                |		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
	                |			И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
	                |ГДЕ
	                |	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	                |	И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ВТ_ПоступленияСтавкаНДС.СуммаАкта) КАК СуммаАкта,
	                |	ВТ_ПоступленияСтавкаНДС.Сделка КАК Сделка,
	                |	ВТ_ПоступленияСтавкаНДС.Номенклатура КАК Номенклатура
	                |ПОМЕСТИТЬ ВТ_Поступления
	                |ИЗ
	                |	ВТ_ПоступленияСтавкаНДС КАК ВТ_ПоступленияСтавкаНДС
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_ПоступленияСтавкаНДС.Номенклатура,
	                |	ВТ_ПоступленияСтавкаНДС.Сделка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ЕСТЬNULL(ВТ_Поступления.СуммаАкта, 0)) КАК СуммаАкта,
	                |	ВТ_Поступления.Сделка КАК Сделка,
	                |	ВТ_Поступления.Номенклатура КАК Номенклатура
	                |ПОМЕСТИТЬ ВТ_Входящие
	                |ИЗ
	                |	ВТ_Поступления КАК ВТ_Поступления
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_Поступления.Сделка,
	                |	ВТ_Поступления.Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ВТ_Входящие.СуммаАкта) КАК СуммаАктаВходящего,
	                |	СУММА(ВТ_Исходящие.СуммаАкта) КАК СуммаАктаИсходящего,
	                |	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура) КАК Номенклатура,
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка) КАК Сделка,
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент) КАК Контрагент,
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный) КАК Ответственный,
	                |	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаАкта, 0) - ЕСТЬNULL(ВТ_Входящие.СуммаАкта, 0)) КАК ПрофитПоАктам,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент)).Наименование КАК КонтрагентНаименование,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный)).Наименование КАК ОтветственныйНаименование,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка)).Дата КАК СделкаДата
	                |ПОМЕСТИТЬ ИВТ_ИтоговыеДанные
	                |ИЗ
	                |	ВТ_Входящие КАК ВТ_Входящие
	                |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Исходящие КАК ВТ_Исходящие
	                |		ПО ВТ_Входящие.Сделка = ВТ_Исходящие.Сделка
	                |			И ВТ_Входящие.Номенклатура = ВТ_Исходящие.Номенклатура
	                |ГДЕ
	                |	(ВТ_Входящие.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	                |			ИЛИ ВТ_Исходящие.Сделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЕСТЬNULL(ВТ_Исходящие.Номенклатура, ВТ_Входящие.Номенклатура),
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка),
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент),
	                |	ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный),
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Контрагент, ВТ_Входящие.Сделка.Контрагент)).Наименование,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка.Ответственный, ВТ_Входящие.Сделка.Ответственный)).Наименование,
	                |	(ЕСТЬNULL(ВТ_Исходящие.Сделка, ВТ_Входящие.Сделка)).Дата
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ИВТ_ИтоговыеДанные.Ответственный КАК Ответственный,
	                |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	                |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	                |	ИВТ_ИтоговыеДанные.СуммаАктаВходящего КАК СуммаАктаВходящего,
	                |	ИВТ_ИтоговыеДанные.СуммаАктаИсходящего КАК СуммаАктаИсходящего,
	                |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК Профит,
	                |	(ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0)) * 0.04 КАК Премия,
	                |	ИВТ_ИтоговыеДанные.Сделка.МенеджерПоРаботеСКлиентами КАК МенеджерПоРаботеСКлиентами
	                |ПОМЕСТИТЬ ВТ_ДанныеДляОтделаКлиенты
	                |ИЗ
	                |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	                |ГДЕ
	                |	НЕ ИВТ_ИтоговыеДанные.Сделка.Вид В (&ВидыСделокАСД)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.Номенклатура, """""""") КАК Номенклатура,
	                |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	                |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) КАК СуммаАктаИсходящего,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК СуммаАктаВходящего,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК ПрофитАвто
	                |ПОМЕСТИТЬ ВТ_АвтоСобственное
	                |ИЗ
	                |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	                |ГДЕ
	                |	ИВТ_ИтоговыеДанные.Номенклатура = &Номенклатура4
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ИВТ_ИтоговыеДанные.СуммаАктаВходящего КАК СуммаАктаВходящего,
	                |	ИВТ_ИтоговыеДанные.СуммаАктаИсходящего КАК СуммаАктаИсходящего,
	                |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	                |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	                |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	                |	ИВТ_ИтоговыеДанные.Ответственный КАК Ответственный,
	                |	ИВТ_ИтоговыеДанные.ПрофитПоАктам КАК ПрофитПоАктам,
	                |	ИВТ_ИтоговыеДанные.КонтрагентНаименование КАК КонтрагентНаименование,
	                |	ИВТ_ИтоговыеДанные.ОтветственныйНаименование КАК ОтветственныйНаименование,
	                |	ИВТ_ИтоговыеДанные.СделкаДата КАК СделкаДата,
	                |	ВТ_НомераСделок.Номер КАК НомерСделки,
	                |	ИВТ_ИтоговыеДанные.Сделка.Менеджер КАК МенеджерПоПродажам,
	                |	ВЫБОР
	                |		КОГДА ИВТ_ИтоговыеДанные.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
	                |			ТОГДА ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.04
	                |		ИНАЧЕ 0
	                |	КОНЕЦ КАК ПремияРукОтдДекл,
	                |	ВЫБОР
	                |		КОГДА ВТ_НомераСделок.Номер = 1
	                |			ТОГДА ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.1
	                |		ИНАЧЕ ИВТ_ИтоговыеДанные.ПрофитПоАктам * 0.075
	                |	КОНЕЦ КАК ПремияМенеджерПродаж
	                |ПОМЕСТИТЬ ВТ_ИтогДанныеСНомерамиСделок
	                |ИЗ
	                |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераСделок КАК ВТ_НомераСделок
	                |		ПО ИВТ_ИтоговыеДанные.Сделка = ВТ_НомераСделок.Сделка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ИВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	                |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	                |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) КАК СуммаАктаИсходящего,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК СуммаАктаВходящего,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК ПрофитСделкаАвто
	                |ПОМЕСТИТЬ ВТ_СделкаАвтоперевозка
	                |ИЗ
	                |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные
	                |ГДЕ
	                |	ИВТ_ИтоговыеДанные.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Автоперевозка)
	                |	И ИВТ_ИтоговыеДанные.СуммаАктаВходящего > 0
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.Номенклатура, """""""") КАК Номенклатура,
	                |	ИВТ_ИтоговыеДанные.Сделка КАК Сделка,
	                |	ИВТ_ИтоговыеДанные.Контрагент КАК Контрагент,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) КАК СуммаАктаИсходящего,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК СуммаАктаВходящего,
	                |	ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаИсходящего, 0) - ЕСТЬNULL(ИВТ_ИтоговыеДанные.СуммаАктаВходящего, 0) КАК ПрофитАвто
	                |ПОМЕСТИТЬ ВТ_Экспедирование
	                |ИЗ
	                |	ИВТ_ИтоговыеДанные КАК ИВТ_ИтоговыеДанные";
	
	Запрос1.УстановитьПараметр("СтавкиНДС", ТЗСтавкиНДС);
	Запрос1.УстановитьПараметр("КонецПериода", ПериодОтчета.ДатаОкончания); 
	Запрос1.УстановитьПараметр("НачалоПериода", ПериодОтчета.ДатаНачала);
	Запрос1.УстановитьПараметр("ВидыСделокАСД", МассивВидовСделокАСД);
	
	Результат1 = Запрос1.ВыполнитьПакетСПромежуточнымиДанными();
	
	// Отдел работы с клиентами
	Выборка = Результат1[10].Выгрузить();
	Для каждого стрВыборка из Выборка Цикл
		
		СтрТЗ = ТЗ_Начисления.Добавить(); 
		СтрТЗ.Сотрудник =  стрВыборка.МенеджерПоРаботеСКлиентами.Наименование;
		СтрТЗ.Контрагент = стрВыборка.Контрагент;
		СтрТЗ.Сделка = стрВыборка.Сделка;
		СтрТЗ.Номенклатура = Строка(СтрВыборка.Номенклатура);
		СтрТЗ.Премия = стрВыборка.Премия;
		СтрТЗ.Профит = стрВыборка.Профит;
		СтрТЗ.Отдел = "ОтделРаботыСКлиентами";
		СтрТЗ.ТипПремииСлуж = "Отдел работы с клиентами";
		СтрТЗ.СуммаАктРеализации = стрВыборка.СуммаАктаИсходящего; 
		СтрТЗ.СуммаАктПоступление = стрВыборка.СуммаАктаВходящего;
		
		
	КонецЦикла;	
	
	// Авто собственное
	ВыборкаАвто = Результат[11].Выгрузить(); 
	СотрудникПоАвтоСобственное = Справочники.Пользователи.НайтиПоНаименованию("Мельникова Елена Александровнаа");
	Для каждого стрВыборкаАвто из ВыборкаАвто Цикл
		
		СтрТЗ = ТЗ_Начисления.Добавить(); 
		СтрТЗ.Сотрудник =  "Мельникова Елена Александровна"; 
		СтрТЗ.Контрагент = стрВыборкаАвто.Контрагент;
		СтрТЗ.Сделка = стрВыборкаАвто.Сделка;
		СтрТЗ.Номенклатура = Строка(стрВыборкаАвто.Номенклатура); //+ "(Авто собственное)";
		СтрТЗ.Премия = 0;
		СтрТЗ.Профит = стрВыборкаАвто.ПрофитАвто;
		СтрТЗ.Отдел = "АвтоперевозкиСобств";
		СтрТЗ.ТипПремииСлуж = "Автоперевозки собственные"; 
		СтрТЗ.СуммаАктРеализации = стрВыборкаАвто.СуммаАктаИсходящего; 
		СтрТЗ.СуммаАктПоступление = стрВыборкаАвто.СуммаАктаВходящего;
		
	КонецЦикла;	  
	
	// Сделка - Автоперевозка
	ВыборкаСделкаАвтоперевозка = Результат[13].Выгрузить();
	Для каждого стрВыборкаСделкаАвтоперевозка из ВыборкаСделкаАвтоперевозка Цикл
		
		СтрТЗ = ТЗ_Начисления.Добавить(); 
		СтрТЗ.Сотрудник =  "Мельникова Елена Александровна"; 
		СтрТЗ.Контрагент = стрВыборкаСделкаАвтоперевозка.Контрагент;
		СтрТЗ.Сделка = стрВыборкаСделкаАвтоперевозка.Сделка;
		СтрТЗ.Номенклатура = Строка(стрВыборкаСделкаАвтоперевозка.Номенклатура); // + "(Сделка - Автоперевозка)";
		СтрТЗ.Премия = стрВыборкаСделкаАвтоперевозка.ПрофитСделкаАвто * 0.015 ;
		СтрТЗ.Профит = стрВыборкаСделкаАвтоперевозка.ПрофитСделкаАвто;
		СтрТЗ.Отдел = "СделкаАвтоперевозка";
		СтрТЗ.ТипПремииСлуж = "Автоперевозка"; 
		СтрТЗ.СуммаАктРеализации = стрВыборкаСделкаАвтоперевозка.СуммаАктаИсходящего; 
		СтрТЗ.СуммаАктПоступление = стрВыборкаСделкаАвтоперевозка.СуммаАктаВходящего;
		
	КонецЦикла;	  
	
	//Продажи, ОтделДекларирования, сертификация
	Выборка = Результат1[12].Выгрузить();
	Для каждого СтрВыборка из Выборка Цикл
		// менеджер продаж     
		
		НомерСделки = ПолучитьНомерСделки(стрВыборка.Сделка);
		
		СтрТЗ = ТЗ_Начисления.Добавить(); 
		СтрТЗ.Сотрудник =  СтрВыборка.МенеджерПоПродажам.Наименование;
		СтрТЗ.Контрагент = СтрВыборка.Контрагент;
		СтрТЗ.Сделка = СтрВыборка.Сделка;
		СтрТЗ.Номенклатура = Строка(СтрВыборка.Номенклатура);//  + "(Отдел продаж)";
		СтрТЗ.Премия = ?(НомерСделки = 1, СтрВыборка.ПрофитПоАктам * 0.1, СтрВыборка.ПрофитПоАктам * 0.075);//СтрВыборка.ПремияМенеджерПродаж;
		СтрТЗ.Профит = СтрВыборка.ПрофитПоАктам;
		СтрТЗ.Отдел = "ОтделПродаж";
		СтрТЗ.ТипПремииСлуж = "Отдел продаж"; 
		СтрТЗ.СуммаАктРеализации = СтрВыборка.СуммаАктаИсходящего;
		СтрТЗ.СуммаАктПоступление = СтрВыборка.СуммаАктаВходящего; 
		
		//руководитель отдела декларирования
		Если СтрВыборка.Сделка.Вид = Перечисления.ВидыСделок.Декларирование Тогда
			СтрТЗ = ТЗ_Начисления.Добавить(); 
			СтрТЗ.Сотрудник =  "А_Руководитель отдела декларирования";
			СтрТЗ.Контрагент = СтрВыборка.Контрагент;
			СтрТЗ.Сделка = СтрВыборка.Сделка;
			СтрТЗ.Номенклатура = Строка(СтрВыборка.Номенклатура);
			СтрТЗ.Премия = СтрВыборка.ПремияРукОтдДекл;
			СтрТЗ.Профит = СтрВыборка.ПрофитПоАктам;
			СтрТЗ.Отдел = "Декларирование";
			СтрТЗ.ТипПремииСлуж = "Декларирование"; 
			СтрТЗ.СуммаАктРеализации = СтрВыборка.СуммаАктаИсходящего;
			СтрТЗ.СуммаАктПоступление = СтрВыборка.СуммаАктаВходящего; 
		КонецЕсли;
		
		// Премия по сертификации
		Если СтрВыборка.Сделка.Вид = Перечисления.ВидыСделок.Сертификация Тогда
			СтрТЗ = ТЗ_Начисления.Добавить(); 
			СтрТЗ.Сотрудник =  "Мельникова Елена Александровна"; 
			СтрТЗ.Контрагент = СтрВыборка.Контрагент;
			СтрТЗ.Сделка = СтрВыборка.Сделка;
			СтрТЗ.Номенклатура = СтрВыборка.Сделка.НомераСертификатов;
			СтрТЗ.Премия = СтрВыборка.Сделка.КоличествоСертификатов * 500;
			СтрТЗ.Профит = 0;
			СтрТЗ.Отдел = "Сертификация";
			СтрТЗ.ТипПремииСлуж = "Сертификация";
			СтрТЗ.СуммаАктРеализации = СтрВыборка.СуммаАктаИсходящего;
			СтрТЗ.СуммаАктПоступление = СтрВыборка.СуммаАктаВходящего; 
		КонецЕсли; 
		
	КонецЦикла;	
	
	
КонецПроцедуры 

//Заполение табличного документа с отбором по сотрудникам
&НаСервере
Функция СформироватьПечатнуюФорму(ДанныеДляРасчетов) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина; 
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	Обработка =  РеквизитФормыВЗначение("Объект");
	МакетОбработки = Обработка.ПолучитьМакет("Макет"); 
	
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка");  
	
	ОбластьШапка.Параметры.ПериодНачисления = "с " + Формат(ПериодОтчета.ДатаНачала,"ДФ='dd.MM.yyyy ""г.""'") + " по " + 
	Формат(ПериодОтчета.ДатаОкончания,"ДФ='dd.MM.yyyy ""г.""'");
	
	ТабличныйДокумент.Вывести(ОбластьШапка); 
	
	Запрос = Новый Запрос;
	
	//========= + УСЛОВИЕ ОТБОРА ПО СОТРУДНИКАМ
	//+ Задаем секцию ГДЕ в запросе исходя из значения текущего пользователя
	ТекущийСотрудник = Пользователи.ТекущийПользователь(); 
	
	Если ТекущийСотрудник.Наименование = "Куршин Александр Владимирович" ИЛИ ТекущийСотрудник.Наименование = "Колодкин Максим Евгеньевич"
		ИЛИ ТекущийСотрудник.Наименование = "Власенко Виктория Андреевна" ИЛИ ТекущийСотрудник.Наименование = "Дорошенко Ксения Викторовна"
		ИЛИ ТекущийСотрудник.Наименование = "Токарева Вероника Валерьевна" 
		ИЛИ РольДоступна("АдминистраторСистемы") Тогда  // Весь отчет
		
		ТекстГДЕ = "";
		
	ИначеЕсли ТекущийСотрудник.Наименование = "Палеха Надежда Алексеевна" Тогда  // Руководитель Отдела работы с клиентами
		
		//ТекстГДЕ = "     
		//		   |ГДЕ
		//           |	ТаблицаДанных.Сотрудник = &Сотрудник
		//           |	ИЛИ ТаблицаДанных.Сотрудник = &РуководительОтдела"; 
		//Запрос.УстановитьПараметр("Сотрудник",ТекущийСотрудник.Наименование);
		//Запрос.УстановитьПараметр("РуководительОтдела","А_Руководитель отдела по работе с клиентами"); 
		
		ТекстГДЕ = "
		|ГДЕ
		|	ТаблицаДанных.Отдел = &Отдел";
		Запрос.УстановитьПараметр("Отдел","ОтделРаботыСКлиентами");
		
	ИначеЕсли ТекущийСотрудник.Наименование = "Кочвар Татьяна Николаевна" Тогда  // Руководитель Отдела Декларирования
		
		//ТекстГДЕ = "
		//		   |ГДЕ
		//           |	ТаблицаДанных.Сотрудник = &Сотрудник
		//           |	ИЛИ ТаблицаДанных.Сотрудник = &РуководительОтдела"; 
		//Запрос.УстановитьПараметр("Сотрудник",ТекущийСотрудник.Наименование);
		//Запрос.УстановитьПараметр("РуководительОтдела","А_Руководитель отдела декларирования"); 
		
		ТекстГДЕ = "
		|ГДЕ
		|	ТаблицаДанных.Отдел = &Отдел";
		Запрос.УстановитьПараметр("Отдел","Декларирование");
		
	Иначе                                                                        // Отдельно по менеджерам
		
		//Если  Лев(ТекущийСотрудник.Наименование,7) = "1cuser6" Тогда           // для разработчика
		//	ТекстГДЕ = "";	
		//Иначе	
		ТекстГДЕ = "
		|ГДЕ
		|	ТаблицаДанных.Сотрудник = &Сотрудник"; 
		Запрос.УстановитьПараметр("Сотрудник",ТекущийСотрудник.Наименование);
		//КонецЕсли;
		
	КонецЕсли;	
	//-  ===========================================================
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаДанных.Сотрудник КАК Сотрудник,
	|	ТаблицаДанных.Контрагент КАК Контрагент,
	|	ТаблицаДанных.Сделка КАК Сделка,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Профит КАК Профит,
	|	ТаблицаДанных.Премия КАК Премия,
	|	ТаблицаДанных.СуммаАктРеализации КАК СуммаАктРеализации,
	|	ТаблицаДанных.СуммаАктПоступление КАК СуммаАктПоступление,
	|	ТаблицаДанных.Отдел КАК Отдел,
	|	ТаблицаДанных.ТипПремииСлуж КАК ТипПремииСлуж
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных " + ТекстГДЕ + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Сотрудник КАК Сотрудник,
	|	ВТ_Данные.Контрагент КАК Контрагент,
	|	ВТ_Данные.Сделка КАК Сделка,
	|	ВТ_Данные.Профит КАК Профит,
	|	ВТ_Данные.Премия КАК Премия,
	|	ВТ_Данные.Отдел КАК Отдел,
	|	ВТ_Данные.ТипПремииСлуж КАК ТипПремииСлуж,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.СуммаАктРеализации КАК СуммаАктРеализации,
	|	ВТ_Данные.СуммаАктПоступление КАК СуммаАктПоступление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Контрагент,
	|	Сделка
	|ИТОГИ
	|	СУММА(Профит),
	|	СУММА(Премия),
	|	СУММА(СуммаАктРеализации),
	|	СУММА(СуммаАктПоступление)
	|ПО
	|	ТипПремииСлуж,
	|	Сотрудник,
	|	Контрагент,
	|	Сделка"; 
	Запрос.УстановитьПараметр("ТаблицаДанных",ДанныеДляРасчетов.ТЗ_Начисления);
	
	Результат = Запрос.Выполнить();
	//ВыборкаСотрудник = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОтдел = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	Пока ВыборкаОтдел.Следующий() Цикл
		
		ОбластьОтдел = МакетОбработки.ПолучитьОбласть("СтрОтдел");
		//ОблстьОтдел.Параметры.Отдел = ВыборкаОтдел.Отдел;
		ОбластьОтдел.Параметры.Отдел = ВыборкаОтдел.ТипПремииСлуж;
		ОбластьОтдел.Параметры.Профит = ВыборкаОтдел.Профит; 
		ОбластьОтдел.Параметры.Комиссия = ВыборкаОтдел.Премия;
		ОбластьОтдел.Параметры.СуммаАктРеализации = ВыборкаОтдел.СуммаАктРеализации; 
		
		Если ВыборкаОтдел.ТипПремииСлуж  =  "Сертификация" Тогда
			Маржа = 100;
		Иначе
			
			Если ВыборкаОтдел.СуммаАктРеализации > 0 и ВыборкаОтдел.Профит > 0 Тогда
				Маржа = ВыборкаОтдел.Профит / ВыборкаОтдел.СуммаАктРеализации * 100;
			Иначе         
				Маржа = 0;
			КонецЕсли;
			
		КонецЕсли;	
		
		ОбластьОтдел.Параметры.Маржа = Маржа;
		ТабличныйДокумент.Вывести(ОбластьОтдел,1);
		
		ВыборкаСотрудник = ВыборкаОтдел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСотрудник.Следующий() Цикл 
			//	ОбластьСотрудник  
			ОбластьСотрудник = МакетОбработки.ПолучитьОбласть("СтрСотрудник");
			
			Если Лев(ВыборкаСотрудник.Сотрудник,2) = "А_" Тогда
				ОбластьСотрудник.Параметры.Сотрудник = Прав(ВыборкаСотрудник.Сотрудник,СтрДлина(ВыборкаСотрудник.Сотрудник)-2);
			Иначе
				ОбластьСотрудник.Параметры.Сотрудник = ВыборкаСотрудник.Сотрудник; 
			КонецЕсли;
			
			ОбластьСотрудник.Параметры.Профит = ВыборкаСотрудник.Профит;
			ОбластьСотрудник.Параметры.Комиссия = ВыборкаСотрудник.Премия;
			ОбластьСотрудник.Параметры.СуммаАктРеализации = ВыборкаСотрудник.СуммаАктРеализации;  
			
			Если ВыборкаСотрудник.ТипПремииСлуж  =  "Сертификация" Тогда
				Маржа = 100;
			Иначе
				
				Если ВыборкаСотрудник.СуммаАктРеализации > 0 и ВыборкаСотрудник.Профит > 0 Тогда
					Маржа = ВыборкаСотрудник.Профит / ВыборкаСотрудник.СуммаАктРеализации * 100;
				Иначе         
					Маржа = 0;
				КонецЕсли;
				
			КонецЕсли;	
			
			ОбластьСотрудник.Параметры.Маржа = Маржа;
			
			ТабличныйДокумент.Вывести(ОбластьСотрудник,2);
			
			ВыборкаКонтрагент = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагент.Следующий() Цикл
				//	ОбластьКлиент
				ОбластьКлиент = МакетОбработки.ПолучитьОбласть("СтрКлиент");
				
				ОбластьКлиент.Параметры.Клиент = ВыборкаКонтрагент.Контрагент;
				ОбластьКлиент.Параметры.Профит = ВыборкаКонтрагент.Профит;
				ОбластьКлиент.Параметры.Комиссия = ВыборкаКонтрагент.Премия;
				ОбластьКлиент.Параметры.СуммаАктРеализации = ВыборкаКонтрагент.СуммаАктРеализации; 
				
				Если ВыборкаКонтрагент.ТипПремииСлуж  =  "Сертификация" Тогда
					Маржа = 100;
				Иначе
					
					Если ВыборкаКонтрагент.СуммаАктРеализации > 0 и ВыборкаКонтрагент.Профит > 0 Тогда
						Маржа = ВыборкаКонтрагент.Профит / ВыборкаКонтрагент.СуммаАктРеализации * 100;
					Иначе         
						Маржа = 0;
					КонецЕсли;
					
				КонецЕсли;	
				
				ОбластьКлиент.Параметры.Маржа = Маржа;
				
				ТабличныйДокумент.Вывести(ОбластьКлиент,3);
				
				ВыборкаСделка = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСделка.Следующий() Цикл
					//	ОбластьСделка 
					ОбластьСделка = МакетОбработки.ПолучитьОбласть("СтрСделка");
					
					ОбластьСделка.Параметры.Сделка = ВыборкаСделка.Сделка;
					ОбластьСделка.Параметры.Профит = ВыборкаСделка.Профит;
					ОбластьСделка.Параметры.Комиссия = ВыборкаСделка.Премия;
					ОбластьСделка.Параметры.СуммаАктРеализации = ВыборкаСделка.СуммаАктРеализации;
					
					Если ВыборкаСделка.ТипПремииСлуж  =  "Сертификация" Тогда
						Маржа = 100;
					Иначе
						
						Если ВыборкаСделка.СуммаАктРеализации > 0 и ВыборкаСделка.Профит > 0 Тогда
							Маржа = ВыборкаСделка.Профит / ВыборкаСделка.СуммаАктРеализации * 100;
						Иначе         
							Маржа = 0;
						КонецЕсли;
						
					КонецЕсли;	
					
					ОбластьСделка.Параметры.Маржа = Маржа ;
					
					ТабличныйДокумент.Вывести(ОбластьСделка,4);
					
					ВыборкаНоменклатура = ВыборкаСделка.Выбрать();
					Пока ВыборкаНоменклатура.Следующий() Цикл
						//ОбластьНоменклатура
						ОбластьНоменклатура = МакетОбработки.ПолучитьОбласть("СтрНоменклатура");
						
						ОбластьНоменклатура.Параметры.Номенклатура = ВыборкаНоменклатура.Номенклатура;
						ОбластьНоменклатура.Параметры.Профит = ВыборкаНоменклатура.Профит;
						ОбластьНоменклатура.Параметры.Комиссия = ВыборкаНоменклатура.Премия;
						ОбластьНоменклатура.Параметры.СуммаАктРеализации = ВыборкаНоменклатура.СуммаАктРеализации; 
						
						Если ВыборкаНоменклатура.ТипПремииСлуж  =  "Сертификация" Тогда
							Маржа = 100;
						Иначе
							
							Если ВыборкаНоменклатура.СуммаАктРеализации > 0 и ВыборкаНоменклатура.Профит > 0 Тогда
								Маржа = ВыборкаНоменклатура.Профит / ВыборкаНоменклатура.СуммаАктРеализации * 100;
							Иначе         
								Маржа = 0;
							КонецЕсли;
							
						КонецЕсли;	
						
						ОбластьНоменклатура.Параметры.Маржа = Маржа;
						
						ТабличныйДокумент.Вывести(ОбластьНоменклатура,5);
						
					КонецЦикла;
					
				КонецЦикла;	
				
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуСтавокНДС()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТЗ.Колонки.Добавить("СтавкаНДСЧисло", Новый ОписаниеТипов("Число"));
	
	Для Н1=1 ПО  Перечисления.СтавкиНДС.Количество() Цикл  
		
		СтавкаНДС = Перечисления.СтавкиНДС.Получить(Н1-1); 
		
		СтрТЗ = ТЗ.Добавить();
		СтрТЗ.СтавкаНДС = СтавкаНДС;
		СтрТЗ.СтавкаНДСЧисло = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС);
		
	КонецЦикла;	
	
	Возврат ТЗ;	
	
КонецФункции 

&НаСервере
Функция ПолучитьНомерСделки(Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Сделка.Ссылка) КАК Номер,
	|	Сделка.Контрагент КАК Контрагент,
	|	Сделка.Вид КАК Вид
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.Дата <= &Дата
	|	И Сделка.Контрагент = &Контрагент
	|	И Сделка.Вид = &Вид
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделка.Контрагент,
	|	Сделка.Вид
	|";
	Запрос.УстановитьПараметр("Дата",Сделка.Дата);
	Запрос.УстановитьПараметр("Контрагент",Сделка.Контрагент);
	Запрос.УстановитьПараметр("Вид",Сделка.Вид);  
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Результат.Пустой() Тогда
		НомерСделки = 1;
	Иначе	
		Выборка.Следующий();
		НомерСделки =Выборка.Номер;
	КонецЕсли;
	
	Возврат НомерСделки;
	
КонецФункции

#Область ПереместитьСюдаДляУдаления

#КонецОбласти 

