

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьПуть(Ссыл)
	
	Возврат Ссыл.ПутьКПапке;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УсловияОтбораГруппойИли = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    УсловияОтбораГруппойИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
	УсловияОтбораГруппойИли.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.КонтрольПередЗакрытием);
	
	ЭлементОтбора = УсловияОтбораГруппойИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов;
	
	ЭлементОтбора = УсловияОтбораГруппойИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  	
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Закрыта);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Завершена);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Отменена);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов; 
		
КонецПроцедуры
