&После("ПриЗаписи")
Процедура ЛГС_ПриЗаписи(Отказ)
		
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сделка");
	
	Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамУслуги Цикл
		
		СтрТЗ = ТЗ.Добавить();
		СтрТЗ.Сделка = Стр.Сделка;
		
	КонецЦикла;
	
	Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамТовары Цикл
		
		СтрТЗ = ТЗ.Добавить();
		СтрТЗ.Сделка = Стр.Сделка;
		
	КонецЦикла;
	
	Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамАгентскиеУслуги Цикл
		
		СтрТЗ = ТЗ.Добавить();
		СтрТЗ.Сделка = Стр.Сделка;
		
	КонецЦикла;
	
	ТЗ.Свернуть("Сделка");
	
	СтрокаСделки = "";
	АдресаПапок = "";
	
	Для Каждого Стр ИЗ ТЗ Цикл
		
		Если СтрокаСделки = "" Тогда
			
			СтрокаСделки = Стр.Сделка.Номер;
			
		Иначе
			
			СтрокаСделки = СтрокаСделки + ", " + Стр.Сделка.Номер;
			
		КонецЕсли;
		
		Если АдресаПапок = "" Тогда
			
			АдресаПапок = Стр.Сделка.ПутьКПапке;
			
		Иначе
			
			АдресаПапок = АдресаПапок + Символы.ПС + Стр.Сделка.ПутьКПапке;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ЛогистикаСервер.ДублируетПоВходящимРеквизитам(ЭтотОбъект) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Для данного контрагента на данную дату уже есть входящее поступление с этим номером!'");
		Сообщение.Поле = "НомерВходящегоДокумента";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ДанныеПоступленийДляВыводаВСписках.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Поступление.Установить(ЭтотОбъект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись ИЗ НЗ Цикл
			
			Запись.Поступление = ЭтотОбъект.Ссылка;
			Запись.АдресаПапок = АдресаПапок;
			Запись.Сделки = СтрокаСделки;
						
		КонецЦикла;
		
	НЗ.Записать();	
		
	Иначе
		
		Запись = РегистрыСведений.ДанныеПоступленийДляВыводаВСписках.СоздатьМенеджерЗаписи(); 
		
		Запись.Поступление = ЭтотОбъект.Ссылка; 
		Запись.АдресаПапок = АдресаПапок;
		Запись.Сделки = СтрокаСделки;
		
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура ЛГС_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	    
	Если Товары.Количество() > 0 Тогда          
		
		Для Каждого СтрТовары Из Товары  Цикл 
			
			Сделка = ПолучитьСделку(СтрТовары.КлючСвязиРаспределения,ДанныеЗаполнения.РаспределениеСуммПоСделкамТовары );
			
			Если Сделка.Количество() > 0 Тогда
				
				Для Каждого СтрСделка Из Сделка Цикл
				
				СтрРаспределениеСуммПоСделкамТовары = РаспределениеСуммПоСделкамТовары.Добавить();
				СтрРаспределениеСуммПоСделкамТовары.КлючСвязи = СтрСделка.КлючСвязи;
				СтрРаспределениеСуммПоСделкамТовары.Сделка = СтрСделка.Сделка;
				СтрРаспределениеСуммПоСделкамТовары.СуммаРаспределения = СтрСделка.СуммаРаспределения;  
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;	
		 
	КонецЕсли;
	
	Если Услуги.Количество() > 0 Тогда
		
		Для Каждого СтрУслуги Из Услуги  Цикл 
			
			Сделка = ПолучитьСделку(СтрУслуги.КлючСвязиРаспределения,ДанныеЗаполнения.РаспределениеСуммПоСделкамТовары );
			
			Если Сделка.Количество() > 0 Тогда
				
				Для Каждого СтрСделка Из Сделка Цикл
					
					СтрРаспределениеСуммПоСделкамУслуги = РаспределениеСуммПоСделкамУслуги.Добавить();
					СтрРаспределениеСуммПоСделкамУслуги.КлючСвязи = СтрСделка.КлючСвязи;
					СтрРаспределениеСуммПоСделкамУслуги.Сделка = СтрСделка.Сделка;
					СтрРаспределениеСуммПоСделкамУслуги.СуммаРаспределения = СтрСделка.СуммаРаспределения; 
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;	
		 
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСделку(КлючСвязи,ТабРаспределениеСуммПоСделкамТовары)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КлючСвязи", КлючСвязи); 
	
	Результат = ТабРаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора);
	
	Возврат Результат;

КонецФункции	

&После("ОбработкаПроведения")
Процедура ЛГС_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьРаспределениеСуммПоСделкам(Отказ);
	
	Движения.ПеревыставляемыеТоварыУслуги.Записывать = Истина;		
	
	Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамАгентскиеУслуги Цикл
		
		ПараметрыОтбора = Новый Структура("КлючСвязиРаспределения", Стр.КлючСвязи);	
		
		НайденныеСтроки = ЭтотОбъект.АгентскиеУслуги.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Движение = Движения.ПеревыставляемыеТоварыУслуги.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = НайденныеСтроки[0].Номенклатура;
			Движение.Контрагент = ЭтотОбъект.Контрагент;
			Движение.Сделка = Стр.Сделка;
			Движение.Сумма = Стр.СуммаРаспределения * ЭтотОбъект.КурсВзаиморасчетов / ЭтотОбъект.КратностьВзаиморасчетов;   
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамУслуги Цикл
		
		ПараметрыОтбора = Новый Структура("КлючСвязиРаспределения", Стр.КлючСвязи);	
		
		НайденныеСтроки = ЭтотОбъект.Услуги.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Движение = Движения.ПеревыставляемыеТоварыУслуги.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = НайденныеСтроки[0].Номенклатура;
			Движение.Контрагент = ЭтотОбъект.Контрагент;
			Движение.Сделка = Стр.Сделка;
			Движение.Сумма = Стр.СуммаРаспределения * ЭтотОбъект.КурсВзаиморасчетов / ЭтотОбъект.КратностьВзаиморасчетов;   
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамТовары Цикл
		
		ПараметрыОтбора = Новый Структура("КлючСвязиРаспределения", Стр.КлючСвязи);	
		
		НайденныеСтроки = ЭтотОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Движение = Движения.ПеревыставляемыеТоварыУслуги.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = НайденныеСтроки[0].Номенклатура;
			Движение.Контрагент = ЭтотОбъект.Контрагент;
			Движение.Сделка = Стр.Сделка;
			Движение.Сумма = Стр.СуммаРаспределения * ЭтотОбъект.КурсВзаиморасчетов / ЭтотОбъект.КратностьВзаиморасчетов;   
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьСделкиНаАрхивность(ТабличнаяЧасть)
	
	ТЗ = ТабличнаяЧасть.Выгрузить();
	ТЗ.Свернуть("Сделка");
	
	СделкиСОшибками = Новый Массив;
	
	Для каждого СтрокаТЗ из ТЗ Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыСделок.Сделка КАК Сделка,
		|	СтатусыСделок.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыСделок КАК СтатусыСделок
		|ГДЕ
		|	СтатусыСделок.Сделка = &Сделка";
		
		Запрос.УстановитьПараметр("Сделка", СтрокаТЗ.Сделка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл  
			Если Выборка.Статус = Перечисления.СтатусыСделок.Закрыта 
				ИЛИ Выборка.Статус = Перечисления.СтатусыСделок.Завершена Тогда
				
				СделкиСОшибками.Добавить(СтрокаТЗ.Сделка);
				Прервать; // Выходим из цикла, так как ошибка уже найдена
			КонецЕсли;
		КонецЦикла; 
		
	КонецЦикла;
	
	Возврат СделкиСОшибками;
	
КонецФункции

&Перед("ПередЗаписью")
Процедура ЛГС_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 

	ГрупповоеПерепроведение = ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект);
	
	Если ГрупповоеПерепроведение Тогда
		Возврат;
	КонецЕсли;
	
	//Ошибки = Новый Массив;
	//
	//Если Не ЭтотОбъект.Администратор тогда
	//// Проверяем все табличные части
	//ОшибочныеСделкиУслуги = ПроверитьСделкиНаАрхивность(ЭтотОбъект.РаспределениеСуммПоСделкамУслуги);
	//ОшибочныеСделкиАгентские = ПроверитьСделкиНаАрхивность(ЭтотОбъект.РаспределениеСуммПоСделкамАгентскиеУслуги);
	//ОшибочныеСделкиТовары = ПроверитьСделкиНаАрхивность(ЭтотОбъект.РаспределениеСуммПоСделкамТовары);
	//
	//// Формируем общее сообщение об ошибках
	//ТекстОшибки = "";
	//
	//Если ОшибочныеСделкиУслуги.Количество() > 0 Тогда
	//	ТекстОшибки = ТекстОшибки + "Услуги: " + СтрСоединить(ОшибочныеСделкиУслуги, ", ") + Символы.ПС;
	//КонецЕсли;
	//
	//Если ОшибочныеСделкиАгентские.Количество() > 0 Тогда
	//	ТекстОшибки = ТекстОшибки + "Агентские услуги: " + СтрСоединить(ОшибочныеСделкиАгентские, ", ") + Символы.ПС;
	//КонецЕсли;
	//
	//Если ОшибочныеСделкиТовары.Количество() > 0 Тогда
	//	ТекстОшибки = ТекстОшибки + "Товары: " + СтрСоединить(ОшибочныеСделкиТовары, ", ") + Символы.ПС;
	//КонецЕсли;
	//
	//// Если есть ошибки - показываем сообщение
	//Если ТекстОшибки <> "" Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Не удалось провести документ, т.к. в составе сделок есть архивные:" 
	//	+ Символы.ПС + Символы.ПС + ТекстОшибки;
	//	Сообщение.Сообщить();
	//	Отказ = Истина;
	//КонецЕсли;	
	//
	//КонецЕсли;
	
	МассивУдаляемых = Новый Массив;
    
    Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамАгентскиеУслуги Цикл
        
        ПараметрыОтбора = Новый Структура;
        
        ПараметрыОтбора.Вставить("КлючСвязиРаспределения", Стр.КлючСвязи); 
        
        НайденныеСтроки = ЭтотОбъект.АгентскиеУслуги.НайтиСтроки(ПараметрыОтбора);
        
        Если НайденныеСтроки.Количество() = 0 Тогда
            
            МассивУдаляемых.Добавить(Стр);    
            
        КонецЕсли;
        
    КонецЦикла; 
    
    Для Каждого Стр Из МассивУдаляемых Цикл
        
        ЭтотОбъект.РаспределениеСуммПоСделкамАгентскиеУслуги.Удалить(Стр);  
        
    КонецЦикла;
    
    МассивУдаляемых = Новый Массив;
    
    Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамУслуги Цикл
        
        ПараметрыОтбора = Новый Структура;
        
        ПараметрыОтбора.Вставить("КлючСвязиРаспределения", Стр.КлючСвязи); 
        
        НайденныеСтроки = ЭтотОбъект.Услуги.НайтиСтроки(ПараметрыОтбора);
        
        Если НайденныеСтроки.Количество() = 0 Тогда
            
            МассивУдаляемых.Добавить(Стр);    
            
        КонецЕсли;
        
    КонецЦикла; 
    
    Для Каждого Стр Из МассивУдаляемых Цикл
        
        ЭтотОбъект.РаспределениеСуммПоСделкамУслуги.Удалить(Стр);  
        
    КонецЦикла;
    
    МассивУдаляемых = Новый Массив;
    
    Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамТовары Цикл
        
        ПараметрыОтбора = Новый Структура;
        
        ПараметрыОтбора.Вставить("КлючСвязиРаспределения", Стр.КлючСвязи); 
        
        НайденныеСтроки = ЭтотОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
        
        Если НайденныеСтроки.Количество() = 0 Тогда
            
            МассивУдаляемых.Добавить(Стр);    
            
        КонецЕсли;
        
    КонецЦикла; 
    
    Для Каждого Стр Из МассивУдаляемых Цикл
        
        ЭтотОбъект.РаспределениеСуммПоСделкамТовары.Удалить(Стр);  
        
	КонецЦикла;
	//Заполнение Распределения сделок
	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда
		
		Для Каждого Стр из ЭтотОбъект.Товары Цикл
			
			ПараметрыОтбора = Новый Структура;
			
			ПараметрыОтбора.Вставить("КлючСвязи", Стр.КлючСвязиРаспределения); 	
			
			НайденныеСтроки = ЭтотОбъект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				СтрДобавления = ЭтотОбъект.РаспределениеСуммПоСделкамТовары.Добавить();
				СтрДобавления.КлючСвязи =  Стр.КлючСвязиРаспределения;
				СтрДобавления.Сделка =  ЭтотОбъект.ДокументОснование;
				СтрДобавления.СуммаРаспределения =   Стр.Сумма;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Стр из ЭтотОбъект.Услуги Цикл
			
			ПараметрыОтбора = Новый Структура;
			
			ПараметрыОтбора.Вставить("КлючСвязи", Стр.КлючСвязиРаспределения); 	
			
			НайденныеСтроки = ЭтотОбъект.РаспределениеСуммПоСделкамУслуги.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				СтрДобавления = ЭтотОбъект.РаспределениеСуммПоСделкамУслуги.Добавить();
				СтрДобавления.КлючСвязи =  Стр.КлючСвязиРаспределения;
				СтрДобавления.Сделка =  ЭтотОбъект.ДокументОснование;
				СтрДобавления.СуммаРаспределения =   Стр.Сумма;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Стр из ЭтотОбъект.АгентскиеУслуги Цикл
			
			ПараметрыОтбора = Новый Структура;
			
			ПараметрыОтбора.Вставить("КлючСвязи", Стр.КлючСвязиРаспределения); 	
			
			НайденныеСтроки = ЭтотОбъект.РаспределениеСуммПоСделкамАгентскиеУслуги.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				СтрДобавления = ЭтотОбъект.РаспределениеСуммПоСделкамАгентскиеУслуги.Добавить();
				СтрДобавления.КлючСвязи =  Стр.КлючСвязиРаспределения;
				СтрДобавления.Сделка =  ЭтотОбъект.ДокументОснование;
				СтрДобавления.СуммаРаспределения =   Стр.Сумма;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура ЛГС_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьРаспределениеСуммПоСделкам(Отказ)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;	
	КонецЕсли;
	
	ТекстЗапросаПроверкиРаспределенияСумм = ТекстЗапросаПроверкиРаспределенияСумм();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроверкиРаспределенияСумм; 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	Для каждого РезультатЗапроса Из РезультатыЗапросов Цикл
	
		Если РезультатЗапроса.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.ОсталосьРаспределить <> 0 Тогда
			
			Отказ = Истина;
			
			Если Выборка.ОсталосьРаспределить > 0 Тогда
				ТекстСообщения = СтрШаблон("Таблица ""%1"" - общая сумма не распределена на сделки полностью.", Выборка.НаименованиеТаблицы);
			Иначе	
				ТекстСообщения = СтрШаблон("Таблица ""%1"" - общая сумма превышает сумму распределения.", Выборка.НаименованиеТаблицы);
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаПроверкиРаспределенияСумм()

	Возврат "ВЫБРАТЬ
	        |	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	        |	СУММА(ВЫБОР
	        |			КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	        |				ТОГДА ПоступлениеТоваровУслугТовары.Сумма
	        |			ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС
	        |		КОНЕЦ) КАК ВсегоПоДокументу,
	        |	СУММА(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения) КАК СуммаРаспределения,
	        |	СУММА(ЕСТЬNULL(ВЫБОР
	        |				КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	        |					ТОГДА ПоступлениеТоваровУслугТовары.Сумма
	        |				ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС
	        |			КОНЕЦ, 0) - ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)) КАК ОсталосьРаспределить,
	        |	""товары"" КАК НаименованиеТаблицы
	        |ИЗ
	        |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
	        |		ПО ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка
	        |			И ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи
	        |ГДЕ
	        |	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПоступлениеТоваровУслугТовары.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка КАК Ссылка,
	        |	СУММА(ВЫБОР
	        |			КОГДА ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	        |				ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.Сумма
	        |			ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС
	        |		КОНЕЦ) КАК ВсегоПоДокументу,
	        |	СУММА(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения) КАК СуммаРаспределения,
	        |	СУММА(ЕСТЬNULL(ВЫБОР
	        |				КОГДА ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	        |					ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.Сумма
	        |				ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС
	        |			КОНЕЦ, 0) - ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)) КАК ОсталосьРаспределить,
	        |	""агентские услуги"" КАК НаименованиеТаблицы
	        |ИЗ
	        |	Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
	        |		ПО ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка
	        |			И ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи
	        |ГДЕ
	        |	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПоступлениеТоваровУслугУслуги.Ссылка КАК Ссылка,
	        |	СУММА(ВЫБОР
	        |			КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	        |				ТОГДА ПоступлениеТоваровУслугУслуги.Сумма
	        |			ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС
	        |		КОНЕЦ) КАК ВсегоПоДокументу,
	        |	СУММА(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.СуммаРаспределения) КАК СуммаРаспределения,
	        |	СУММА(ЕСТЬNULL(ВЫБОР
	        |				КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	        |					ТОГДА ПоступлениеТоваровУслугУслуги.Сумма
	        |				ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС
	        |			КОНЕЦ, 0) - ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.СуммаРаспределения, 0)) КАК ОсталосьРаспределить,
	        |	""услуги"" КАК НаименованиеТаблицы
	        |ИЗ
	        |	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги
	        |		ПО ПоступлениеТоваровУслугУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка
	        |			И ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.КлючСвязи
	        |ГДЕ
	        |	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПоступлениеТоваровУслугУслуги.Ссылка";

КонецФункции 

#КонецОбласти

 