
&НаСервере
Функция СформироватьОтчетНаСервере()
	
	Обработка =  РеквизитФормыВЗначение("Объект");
	ТабДок = Новый ТабличныйДокумент;
	МакетОбработки = Обработка.ПолучитьМакет("Макет"); 
	Шапка = МакетОбработки.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаИнформацияОПеревозчиках.Ссылка КАК Ссылка,
	               |	СделкаИнформацияОПеревозчиках.НомерСтроки КАК НомерСтроки,
	               |	СделкаИнформацияОПеревозчиках.Перевозчик КАК Перевозчик,
	               |	СделкаИнформацияОПеревозчиках.КлючСвязи КАК КлючСвязи,
	               |	СделкаИнформацияОПеревозчиках.Направление КАК Направление,
	               |	СделкаИнформацияОПеревозчиках.СтавкаАвтоперевозки КАК СтавкаАвтоперевозки,
	               |	СделкаИнформацияОПеревозчиках.СтавкаКлиенту КАК СтавкаКлиенту,
	               |	СделкаИнформацияОПеревозчиках.Ссылка.Номер КАК Номер,
	               |	СделкаИнформацияОПеревозчиках.Ссылка.ПортПрибытия КАК ПортПрибытия,
	               |	СделкаИнформацияОПеревозчиках.Ссылка.Линия КАК Линия,
	               |	СделкаИнформацияОПеревозчиках.Ссылка.Агент КАК Агент,
	               |	СделкаИнформацияОПеревозчиках.Ссылка.Демередж КАК Демередж,
	               |	СделкаИнформацияОПеревозчиках.Ссылка.Груз КАК Груз,
	               |	СделкаКонтейнеры.Контейнер КАК Контейнер,
	               |	СделкаКонтейнеры.Тип КАК Тип,
	               |	СделкаКонтейнеры.Размер КАК Размер,
	               |	СделкаКонтейнеры.Вес КАК Вес,
	               |	СделкаИнформацияОПеревозчиках.Ссылка.ДатаПрибытия КАК ДатаПрибытия,
	               |	СделкаКонтейнеры.ДатаВыгрузкиСуднаДО КАК ДатаДО,
	               |	СделкаИнформацияОПеревозчиках.Ссылка.ВидТранспорта КАК ВидТранспорта
	               |ИЗ
	               |	Документ.Сделка.Контейнеры КАК СделкаКонтейнеры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ИнформацияОПеревозчиках КАК СделкаИнформацияОПеревозчиках
	               |		ПО СделкаКонтейнеры.Ссылка = СделкаИнформацияОПеревозчиках.Ссылка
	               |			И СделкаКонтейнеры.КлючСвязиИнформацияОПеревозчике = СделкаИнформацияОПеревозчиках.КлючСвязи
	               |ГДЕ
	               |	СделкаИнформацияОПеревозчиках.Ссылка.Проведен = ИСТИНА
	               |	И СделкаИнформацияОПеревозчиках.Перевозчик = &Перевозчик
	               |	И СделкаИнформацияОПеревозчиках.Ссылка.Статус В(&Статусы)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.СтатусыСделок.ВРаботе);
	МассивСтатусов.Добавить(Перечисления.СтатусыСделок.НаПодходе);
	МассивСтатусов.Добавить(Перечисления.СтатусыСделок.Выгружен);
	МассивСтатусов.Добавить(Перечисления.СтатусыСделок.ГотовКВывозу);
	
	Запрос.УстановитьПараметр("Перевозчик", ЭтотОбъект.Перевозчик);
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредыдущаяСделка = Неопределено;
	СчетчикСтрок = 2;
	СчетчикСтрокОбъединения = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ПредыдущаяСделка = Выборка.Ссылка Тогда
						
			ОбластьСтрока = МакетОбработки.ПолучитьОбласть("Строка");
			
			ОбластьСтрока.Параметры.НомерСделки = Выборка.Номер;
			ОбластьСтрока.Параметры.КоличествоКонтейнеров = Выборка.Ссылка.Контейнеры.Количество();
			ОбластьСтрока.Параметры.РазмерКонтейнера = Выборка.Размер;
			ОбластьСтрока.Параметры.ТипКонтейнера = Выборка.Тип;
			ОбластьСтрока.Параметры.ПортПрибытия = Выборка.ПортПрибытия;
			ОбластьСтрока.Параметры.ЛинияАгент = Строка(Выборка.Линия) + "/" + Строка(Выборка.Агент);
			ОбластьСтрока.Параметры.НомерКонтейнера = Выборка.Контейнер;
			ОбластьСтрока.Параметры.ВесТовара = Выборка.Вес;
			ОбластьСтрока.Параметры.Груз = Выборка.Груз;
			ОбластьСтрока.Параметры.Направление = Выборка.Направление;
			ОбластьСтрока.Параметры.СтавкаАвтоперевозки = Выборка.СтавкаАвтоперевозки;
			ОбластьСтрока.Параметры.Демередж = Выборка.Демередж;
			ОбластьСтрока.Параметры.ДатаДО = Выборка.ДатаДО;
			ОбластьСтрока.Параметры.Прибытие = Выборка.ДатаПрибытия;
			ОбластьСтрока.Параметры.ВидТранспорта = Выборка.ВидТранспорта;
			
			ТабДок.Вывести(ОбластьСтрока);
			
			СчетчикСтрокОбъединения = СчетчикСтрокОбъединения + 1;
			
			СчетчикСтрок = СчетчикСтрок + 1;
			 
		Иначе   
			
			Если НЕ ПредыдущаяСделка = Неопределено Тогда
				
				ТабДок.Область(СчетчикСтрок - СчетчикСтрокОбъединения,2,СчетчикСтрок,2).Объединить();
				ТабДок.Область(СчетчикСтрок - СчетчикСтрокОбъединения,3,СчетчикСтрок,3).Объединить();
				ТабДок.Область(СчетчикСтрок - СчетчикСтрокОбъединения,6,СчетчикСтрок,6).Объединить();
				ТабДок.Область(СчетчикСтрок - СчетчикСтрокОбъединения,7,СчетчикСтрок,7).Объединить();
				ТабДок.Область(СчетчикСтрок - СчетчикСтрокОбъединения,10,СчетчикСтрок,10).Объединить(); 
				ТабДок.Область(СчетчикСтрок - СчетчикСтрокОбъединения,13,СчетчикСтрок,13).Объединить();
				ТабДок.Область(СчетчикСтрок - СчетчикСтрокОбъединения,14,СчетчикСтрок,14).Объединить();
				ТабДок.Область(СчетчикСтрок - СчетчикСтрокОбъединения,16,СчетчикСтрок,16).Объединить();
				
			КонецЕсли;
							
			ОбластьСтрока = МакетОбработки.ПолучитьОбласть("Строка");
			
			ОбластьСтрока.Параметры.НомерСделки = Выборка.Номер;
			ОбластьСтрока.Параметры.КоличествоКонтейнеров = Выборка.Ссылка.Контейнеры.Количество();
			ОбластьСтрока.Параметры.РазмерКонтейнера = Выборка.Размер;
			ОбластьСтрока.Параметры.ТипКонтейнера = Выборка.Тип;
			ОбластьСтрока.Параметры.ПортПрибытия = Выборка.ПортПрибытия;
			ОбластьСтрока.Параметры.ЛинияАгент = Строка(Выборка.Линия) + "/" + Строка(Выборка.Агент);
			ОбластьСтрока.Параметры.НомерКонтейнера = Выборка.Контейнер;
			ОбластьСтрока.Параметры.ВесТовара = Выборка.Вес;
			ОбластьСтрока.Параметры.Груз = Выборка.Груз;
			ОбластьСтрока.Параметры.Направление = Выборка.Направление;
			ОбластьСтрока.Параметры.СтавкаАвтоперевозки = Выборка.СтавкаАвтоперевозки;
			ОбластьСтрока.Параметры.Демередж = Выборка.Демередж;
			ОбластьСтрока.Параметры.ДатаДО = Выборка.ДатаДО;
			ОбластьСтрока.Параметры.Прибытие = Выборка.ДатаПрибытия;
			ОбластьСтрока.Параметры.ВидТранспорта = Выборка.ВидТранспорта;
			
			ТабДок.Вывести(ОбластьСтрока); 
			
			СчетчикСтрок = СчетчикСтрок + 1; 
			
			СчетчикСтрокОбъединения = 0;
						
		КонецЕсли;
		
		ПредыдущаяСделка = Выборка.Ссылка;
		
	КонецЦикла;
	
	ТабДок.ФиксацияСверху = 2;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Защита = Ложь;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
			КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ОтчетПоПеревозчикамСделок");    
			// Добавляем в коллекцию (тип массив) сформированный Табличный документ
			КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьОтчетНаСервере(); 
			// если требуется устанавливаем параметры печати
			КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет по перевозчикам сделок";
			
			КоллекцияПечатныхФорм[0].Экземпляров = 1;
			
			УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);  
			
КонецПроцедуры
