
&НаСервере
Процедура ЛГС_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем И НЕ ЗначениеЗаполнено(Объект.Менеджер) Тогда
		
		Сообщить("Не заполнено поле <Менеджер>. Сохранение невозможно");
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ЛГС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
//	
//	КнопкаПечатьТЭО = Элементы.Добавить("Печать_ДоговорТЭО", Тип("КнопкаФормы"), Элементы.ПодменюПечатьОбычное);
//	КнопкаПечатьТЭО.ИмяКоманды = "ПечатьДоговорТЭО"; 
//	
//	КнопкаПечатьТЭО = Элементы.Добавить("Печать_ДоговорТП", Тип("КнопкаФормы"), Элементы.ПодменюПечатьОбычное);
//	КнопкаПечатьТЭО.ИмяКоманды = "ПечатьДоговорТП";

//	КнопкаПечатьТЭО = Элементы.Добавить("Печать_ДоговорТЭОФаксимиле", Тип("КнопкаФормы"), Элементы.ПодменюПечатьОбычное);
//	КнопкаПечатьТЭО.ИмяКоманды = "ПечатьДоговорТЭОФаксимиле";
//	КнопкаПечатьТЭО.Заголовок = "Договор ТЭО с подписью и печатью";
//	
//	КнопкаПечатьТЭО = Элементы.Добавить("Печать_ДоговорТПФаксимиле", Тип("КнопкаФормы"), Элементы.ПодменюПечатьОбычное);
//	КнопкаПечатьТЭО.ИмяКоманды = "ПечатьДоговорТПФаксимиле";
//	КнопкаПечатьТЭО.Заголовок = "Договор ТП с подписью и печатью";
//	
//КонецПроцедуры


//&НаКлиенте
//Процедура ЛГС_ПечатьДоговорТЭОФаксимилеПосле(Команда)

//	ОбъектыПечати = Новый СписокЗначений; 
//	ОбъектыПечати.Добавить(Объект.Ссылка, Строка(Объект.Ссылка), Истина,);
//	
//	МассивОбъектов = Новый Массив;
//	МассивОбъектов.Добавить(Объект.Ссылка);
//	
//	ИмяМакета = "ДоговорТЭОФаксимиле"; //
//	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ДоговорТЭО"); //
//	КоллекцияПечатныхФорм[0].Экземпляров = 1;
//	КоллекцияПечатныхФорм[0].СинонимМакета = "Договор ТЭО"; 
//	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуДоговорТЭО(Объект.Ссылка, ОбъектыПечати, ИмяМакета); 
//	
//	СтруктураПараметров = Новый Структура;
//	СтруктураПараметров.Вставить("ЗаголовокФормы", "Договор ТЭО №" + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ='dd.MM.yyyy""г.""'"));
//	СтруктураПараметров.Вставить("ПараметрКоманды", МассивОбъектов);
//	СтруктураПараметров.Вставить("ОбъектыПечати", ОбъектыПечати);
//	
//	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
//		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, СтруктураПараметров);
//	КонецЕсли; 

//КонецПроцедуры


//&НаКлиенте
//Процедура ЛГС_ПечатьДоговорТПФаксимилеПосле(Команда)
//	
//	ОбъектыПечати = Новый СписокЗначений; 
//	ОбъектыПечати.Добавить(Объект.Ссылка, Строка(Объект.Ссылка), Истина,);
//	
//	МассивОбъектов = Новый Массив;
//	МассивОбъектов.Добавить(Объект.Ссылка);
//	
//	ИмяМакета = "ДоговорТПФаксимиле"; 
//	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ДоговорТП");
//	КоллекцияПечатныхФорм[0].Экземпляров = 1;
//	КоллекцияПечатныхФорм[0].СинонимМакета = "Договор ТП"; 
//	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуДоговорТП(Объект.Ссылка, ОбъектыПечати, ИмяМакета); 
//	
//	СтруктураПараметров = Новый Структура;
//	СтруктураПараметров.Вставить("ЗаголовокФормы", "Договор ТП №" + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ='dd.MM.yyyy""г.""'"));
//	СтруктураПараметров.Вставить("ПараметрКоманды", МассивОбъектов);
//	СтруктураПараметров.Вставить("ОбъектыПечати", ОбъектыПечати);
//	
//	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
//		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, СтруктураПараметров);
//	КонецЕсли; 

//КонецПроцедуры


//&НаКлиенте
//Процедура ЛГС_ПечатьДоговорТЭОПосле(Команда)
//	
//	ОбъектыПечати = Новый СписокЗначений; 
//	ОбъектыПечати.Добавить(Объект.Ссылка, Строка(Объект.Ссылка), Истина,);
//	
//	МассивОбъектов = Новый Массив;
//	МассивОбъектов.Добавить(Объект.Ссылка);
//	
//	ИмяМакета = "ДоговорТЭО"; //
//	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ДоговорТЭО"); //
//	КоллекцияПечатныхФорм[0].Экземпляров = 1;
//	КоллекцияПечатныхФорм[0].СинонимМакета = "Договор ТЭО"; 
//	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуДоговорТЭО(Объект.Ссылка, ОбъектыПечати, ИмяМакета); 
//	
//	СтруктураПараметров = Новый Структура;
//	СтруктураПараметров.Вставить("ЗаголовокФормы", "Договор ТЭО №" + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ='dd.MM.yyyy""г.""'"));
//	СтруктураПараметров.Вставить("ПараметрКоманды", МассивОбъектов);
//	СтруктураПараметров.Вставить("ОбъектыПечати", ОбъектыПечати);
//	
//	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
//		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, СтруктураПараметров);
//	КонецЕсли; 
//	
//КонецПроцедуры


//&НаСервере
//Функция СформироватьПечатнуюФормуДоговорТЭО(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
//	
//	Если ИмяМакета = "ДоговорТЭОФаксимиле" Тогда 
//		ПечатьФаксимиле = Истина
//	Иначе
//		ПечатьФаксимиле = Ложь;
//	КонецЕсли;	 
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	ИмяМакета = Неопределено;
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	
//	ТабличныйДокумент.АвтоМасштаб          = Истина;
//	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
//	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДоговорТЭО"; 
//	ТабличныйДокумент.Защита = Ложь;
//	
//	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
//	
//	ТабличныйДокумент = ЗаполнитьТабличныйДокументДоговорТЭО(ТабличныйДокумент, МассивОбъектов, ПечатьФаксимиле); 
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции

//&НаСервере
//Функция ЗаполнитьТабличныйДокументДоговорТЭО(ТабДок, Договор, ПечатьФаксимиле)
//	
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДоговорыКонтрагентов.ДоговорТЭО");	
//	
//	ОбластьДоговор = Макет.ПолучитьОбласть("Договор");
//	
//	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Организация);
//	СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Владелец);

//	ОбластьДоговор.Параметры.Номер = Договор.Номер;
//	ОбластьДоговор.Параметры.Дата = Формат(Договор.Дата, "ДЛФ=DD");

//	СтруктураАдресаОрг = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(СведенияОбОрганизации.ЗначениеJSONЮридическийАдрес); 
//	
//	Если СтруктураАдресаОрг.Свойство("city") Тогда
//			
//			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.cityType + " " + СтруктураАдресаОрг.city;
//			
//	ИначеЕсли СтруктураАдресаОрг.Свойство("locality") Тогда	
//			
//			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.localityType + ". " + СтруктураАдресаОрг.locality;
//			
//	ИначеЕсли СтруктураАдресаОрг.Свойство("area") Тогда	
//			
//			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.areaType + ". " + СтруктураАдресаОрг.area;
//			
//	КонецЕсли;
//	
//	Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
//		
//		Если ЗначениеЗаполнено(Договор.ЗаРуководителяКонтрагентаПоПриказу) Тогда
//			ОбластьДоговор.Параметры.УставОГРНИПСклонение = Договор.ЗаРуководителяКонтрагентаПоПриказу;
//		Иначе
//			ОбластьДоговор.Параметры.УставОГРНИПСклонение = "Устава, ОГРН";
//		КонецЕсли;
//		
//	Иначе
//		
//		ОбластьДоговор.Параметры.УставОГРНИПСклонение = "ОГРНИП";
//		
//	КонецЕсли;
//	
//	ОбластьДоговор.Параметры.НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
//	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.ДолжностьРуководителя, 2);
//	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.Руководитель, 2);
//	
//	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаКлиентаСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.ДолжностьРуководителяКонтрагента, 2);
//	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиентаСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.РуководительКонтрагента, 2);
//	ОбластьДоговор.Параметры.ИННОрганизации = СведенияОбОрганизации.ИНН;
//	ОбластьДоговор.Параметры.КППОрганизации = СведенияОбОрганизации.КПП;
//	ОбластьДоговор.Параметры.ОГРНКлиента = СведенияОбОрганизации.ОГРН;
//	ОбластьДоговор.Параметры.ОКПООрганизации = СведенияОбОрганизации.КодПоОКПО;
//	ОбластьДоговор.Параметры.ЮрАдресОрганизации = СведенияОбОрганизации.ЮридическийАдрес;
//	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизации = Договор.Руководитель;
//	ОбластьДоговор.Параметры.ПочтаОрганизации = СведенияОбОрганизации.Email;
//	ОбластьДоговор.Параметры.РСОрганизации = СведенияОбОрганизации.НомерСчета;
//	ОбластьДоговор.Параметры.БанкОрганизации = СведенияОбОрганизации.Банк;
//	ОбластьДоговор.Параметры.КорСчетОрганизации = СведенияОбОрганизации.КоррСчет;
//	ОбластьДоговор.Параметры.БИКОрганизации = СведенияОбОрганизации.БИК;
//	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаОрганизации = Договор.ДолжностьРуководителя;
//	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизацииИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Договор.Руководитель);
//	
//	ОбластьДоговор.Параметры.НаименованиеКлиента = СведенияОКонтрагенте.ПолноеНаименование;
//	ОбластьДоговор.Параметры.ИННКлиента = СведенияОКонтрагенте.ИНН;
//	ОбластьДоговор.Параметры.КППКлиента = СведенияОКонтрагенте.КПП;
//	ОбластьДоговор.Параметры.ОГРНКлиента = СведенияОКонтрагенте.ОГРН;
//	ОбластьДоговор.Параметры.ОКПОКлиента = СведенияОКонтрагенте.КодПоОКПО;
//	ОбластьДоговор.Параметры.ЮрАдресКлиента = СведенияОКонтрагенте.ЮридическийАдрес;
//	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиента = Договор.РуководительКонтрагента;
//	ОбластьДоговор.Параметры.ПочтаКлиента = СведенияОКонтрагенте.Email;
//	ОбластьДоговор.Параметры.РСКлиента = СведенияОКонтрагенте.НомерСчета;
//	ОбластьДоговор.Параметры.БанкКлиента = СведенияОКонтрагенте.Банк;
//	ОбластьДоговор.Параметры.КорСчетКлиента = СведенияОКонтрагенте.КоррСчет;
//	ОбластьДоговор.Параметры.БИККлиента = СведенияОКонтрагенте.БИК;
//	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаКлиента = Договор.ДолжностьРуководителяКонтрагента;
//	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиентаИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Договор.РуководительКонтрагента);
//	
//	Если ПечатьФаксимиле Тогда
//		ФайлыПечатиИПодписи = Справочники.Организации.ПодписиИПечатиОрганизации(Договор.Организация, Договор.Дата);
//		
//		ОбластьДоговор.Рисунки.ФаксимилеПечать.Картинка = ФайлыПечатиИПодписи["ФаксимилеПечать"];
//		ОбластьДоговор.Рисунки.ФаксимилеРуководитель.Картинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"];	
//	КонецЕсли;
//	
//	ТабДок.Вывести(ОбластьДоговор); 
//	
//	Возврат ТабДок;
//	
//КонецФункции   

//&НаКлиенте
//Процедура ЛГС_ПечатьДоговорТППосле(Команда)
//	
//	ОбъектыПечати = Новый СписокЗначений; 
//	ОбъектыПечати.Добавить(Объект.Ссылка, Строка(Объект.Ссылка), Истина,);
//	
//	МассивОбъектов = Новый Массив;
//	МассивОбъектов.Добавить(Объект.Ссылка);
//	
//	ИмяМакета = "ДоговорТП"; 
//	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ДоговорТП");
//	КоллекцияПечатныхФорм[0].Экземпляров = 1;
//	КоллекцияПечатныхФорм[0].СинонимМакета = "Договор ТП"; 
//	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуДоговорТП(Объект.Ссылка, ОбъектыПечати, ИмяМакета); 
//	
//	СтруктураПараметров = Новый Структура;
//	СтруктураПараметров.Вставить("ЗаголовокФормы", "Договор ТП №" + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ='dd.MM.yyyy""г.""'"));
//	СтруктураПараметров.Вставить("ПараметрКоманды", МассивОбъектов);
//	СтруктураПараметров.Вставить("ОбъектыПечати", ОбъектыПечати);
//	
//	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
//		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, СтруктураПараметров);
//	КонецЕсли; 

//КонецПроцедуры 

//&НаСервере
//Функция СформироватьПечатнуюФормуДоговорТП(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
//	
//	Если ИмяМакета = "ДоговорТПФаксимиле" Тогда 
//		ПечатьФаксимиле = Истина
//	Иначе
//		ПечатьФаксимиле = Ложь;
//	КонецЕсли;	 
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	ИмяМакета = Неопределено;
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	
//	ТабличныйДокумент.АвтоМасштаб          = Истина;
//	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
//	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДоговорТП"; 
//	ТабличныйДокумент.Защита = Ложь;
//	
//	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
//	
//	ТабличныйДокумент = ЗаполнитьТабличныйДокументДоговорТП(ТабличныйДокумент, МассивОбъектов, ПечатьФаксимиле); 
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции

//&НаСервере
//Функция ЗаполнитьТабличныйДокументДоговорТП(ТабДок, Договор, ПечатьФаксимиле)
//	
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДоговорыКонтрагентов.ДоговорТП");	
//	
//	ОбластьДоговор = Макет.ПолучитьОбласть("Договор");
//	
//	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Организация);
//	СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Владелец);

//	ОбластьДоговор.Параметры.Номер = Договор.Номер;
//	ОбластьДоговор.Параметры.Дата = Формат(Договор.Дата, "ДЛФ=DD");
//	ОбластьДоговор.Параметры.КонецГодаДата = Формат(КонецГода(Договор.Дата), "ДЛФ=DD");
//	
//	СтруктураАдресаОрг = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(СведенияОбОрганизации.ЗначениеJSONЮридическийАдрес); 
//	
//	Если СтруктураАдресаОрг.Свойство("city") Тогда
//			
//			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.cityType + " " + СтруктураАдресаОрг.city;
//			
//	ИначеЕсли СтруктураАдресаОрг.Свойство("locality") Тогда	
//			
//			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.localityType + ". " + СтруктураАдресаОрг.locality;
//			
//	ИначеЕсли СтруктураАдресаОрг.Свойство("area") Тогда	
//			
//			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.areaType + ". " + СтруктураАдресаОрг.area;
//			
//	КонецЕсли;
//	
//	Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
//		
//		Если ЗначениеЗаполнено(Договор.ЗаРуководителяКонтрагентаПоПриказу) Тогда
//			ОбластьДоговор.Параметры.УставОГРНИПСклонение = Договор.ЗаРуководителяКонтрагентаПоПриказу;
//		Иначе
//			ОбластьДоговор.Параметры.УставОГРНИПСклонение = "Устава, ОГРН";
//		КонецЕсли;
//		
//	Иначе
//		
//		ОбластьДоговор.Параметры.УставОГРНИПСклонение = "ОГРНИП";
//		
//	КонецЕсли;
//	
//	ОбластьДоговор.Параметры.НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
//	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.ДолжностьРуководителя, 2);
//	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.Руководитель, 2);
//	
//	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаКлиентаСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.ДолжностьРуководителяКонтрагента, 2);
//	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиентаСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.РуководительКонтрагента, 2);
//	ОбластьДоговор.Параметры.ИННОрганизации = СведенияОбОрганизации.ИНН;
//	ОбластьДоговор.Параметры.КППОрганизации = СведенияОбОрганизации.КПП;
//	ОбластьДоговор.Параметры.ОГРНКлиента = СведенияОбОрганизации.ОГРН;
//	ОбластьДоговор.Параметры.ОКПООрганизации = СведенияОбОрганизации.КодПоОКПО;
//	ОбластьДоговор.Параметры.ЮрАдресОрганизации = СведенияОбОрганизации.ЮридическийАдрес;
//	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизации = Договор.Руководитель;
//	ОбластьДоговор.Параметры.ПочтаОрганизации = СведенияОбОрганизации.Email;
//	ОбластьДоговор.Параметры.РСОрганизации = СведенияОбОрганизации.НомерСчета;
//	ОбластьДоговор.Параметры.БанкОрганизации = СведенияОбОрганизации.Банк;
//	ОбластьДоговор.Параметры.КорСчетОрганизации = СведенияОбОрганизации.КоррСчет;
//	ОбластьДоговор.Параметры.БИКОрганизации = СведенияОбОрганизации.БИК;
//	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаОрганизации = Договор.ДолжностьРуководителя;
//	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизацииИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Договор.Руководитель);
//	
//	ОбластьДоговор.Параметры.НаименованиеКлиента = СведенияОКонтрагенте.ПолноеНаименование;
//	ОбластьДоговор.Параметры.ИННКлиента = СведенияОКонтрагенте.ИНН;
//	ОбластьДоговор.Параметры.КППКлиента = СведенияОКонтрагенте.КПП;
//	ОбластьДоговор.Параметры.ОГРНКлиента = СведенияОКонтрагенте.ОГРН;
//	ОбластьДоговор.Параметры.ОКПОКлиента = СведенияОКонтрагенте.КодПоОКПО;
//	ОбластьДоговор.Параметры.ЮрАдресКлиента = СведенияОКонтрагенте.ЮридическийАдрес;
//	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиента = Договор.РуководительКонтрагента;
//	ОбластьДоговор.Параметры.ПочтаКлиента = СведенияОКонтрагенте.Email;
//	ОбластьДоговор.Параметры.РСКлиента = СведенияОКонтрагенте.НомерСчета;
//	ОбластьДоговор.Параметры.БанкКлиента = СведенияОКонтрагенте.Банк;
//	ОбластьДоговор.Параметры.КорСчетКлиента = СведенияОКонтрагенте.КоррСчет;
//	ОбластьДоговор.Параметры.БИККлиента = СведенияОКонтрагенте.БИК;
//	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаКлиента = Договор.ДолжностьРуководителяКонтрагента;
//	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиентаИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Договор.РуководительКонтрагента);
//	
//	Если ПечатьФаксимиле Тогда
//		ФайлыПечатиИПодписи = Справочники.Организации.ПодписиИПечатиОрганизации(Договор.Организация, Договор.Дата);
//		
//		ОбластьДоговор.Рисунки.ФаксимилеПечать.Картинка = ФайлыПечатиИПодписи["ФаксимилеПечать"];
//		ОбластьДоговор.Рисунки.ФаксимилеРуководитель.Картинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"];	
//	КонецЕсли;
//	
//	ТабДок.Вывести(ОбластьДоговор); 
//	
//		ТабДок.РазмерКолонтитулаСверху = 0;
//		ТабДок.РазмерКолонтитулаСнизу = 0;
//		ТабДок.ПолеСверху = 5;
//		ТабДок.ПолеСнизу = 5;
//		ТабДок.ПолеСправа = 5;
//		ТабДок.ПолеСлева = 5;

//	
//	Возврат ТабДок;
//	
//КонецФункции   


