
&НаСервере
&ИзменениеИКонтроль("ЗагрузитьПодготовленныеДанныеЗаполнениеОстатков")
Функция ЛГС_ЗагрузитьПодготовленныеДанныеЗаполнениеОстатков()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);

	Если ТипЗнч(РезультатВыполнения) = Тип("ТаблицаЗначений") И РезультатВыполнения.Количество() <> 0 Тогда

		Объект.БухОстатки.Загрузить(РезультатВыполнения);

		ОбновитьИтоги();

		Элементы.БухОстатки.ТекущаяСтрока = ПолучитьИдентификаторПервойНепросроченнойОплаты();

		Если Элементы.БухОстатки.ТекущийЭлемент = Неопределено Тогда
			Элементы.БухОстатки.ТекущийЭлемент = Элементы.БухОстаткиКонтрагент;
		КонецЕсли;

	Иначе

		Объект.БухОстатки.Очистить();
		СуммаКОплате = 0;

	КонецЕсли;

	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("ЗаданиеВыполнено", Истина);

	ИдентификаторЗадания = Неопределено;
	УдалитьИзВременногоХранилища(АдресХранилища);
	АдресХранилища = "";

	СкрытьЭлементыОжиданияЗаполнениеОстатков(ЭтотОбъект);

	ОпределитьМоментАктуальностиОтложенныхРасчетов(Ложь);

	Возврат РезультатВыполнения;

КонецФункции
