
//&ИзменениеИКонтроль("ОтправитьПоЭлектроннойПочте")
//Процедура ЛГС_ОтправитьПоЭлектроннойПочте(КомандыОтправки, АдресКомандОтправки, ОбъектыОтправки, ЕстьОшибки, ДополнительныеПараметры)

//	ОписаниеКоманд = Новый Массив;
//	ПечатныеФормы = Новый Массив;

//	Для Каждого Команда Из КомандыОтправки Цикл

//		ОписаниеКоманды = ОтправкаПочтовыхСообщенийВызовСервера.ОписаниеКомандыОтправки(Команда, АдресКомандОтправки);

//		ОписаниеКоманды.Вставить("ОбъектыОтправки", ОбъектыОтправки);

//		Если ОписаниеКоманды.МенеджерПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда

//			Для Каждого КлючИЗначение Из ОписаниеКоманды.ДополнительныеПараметры Цикл
//				ОписаниеКоманды.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
//			КонецЦикла;

//			ОписаниеКоманды.Вставить("ЭтоОтчет", Ложь);
//			ОписаниеКоманды.Вставить("Вид", ПредопределенноеЗначение("Перечисление.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма"));

//			ПараметрыИсточника = Новый Структура;
//			ПараметрыИсточника.Вставить("ИдентификаторКоманды", ОписаниеКоманды.Идентификатор);
//			ПараметрыИсточника.Вставить("ОбъектыНазначения"   , ОбъектыОтправки);
//			ОписаниеКоманды.Вставить("ПараметрыИсточника", ПараметрыИсточника);

//		КонецЕсли;

//		ОписаниеКоманды.ДополнительныеПараметры.Вставить("ФормироватьСтандартноеОписаниеПисьма", Ложь);
//		ОписаниеКоманд.Добавить(ОписаниеКоманды);

//	КонецЦикла;

//	Если ОписаниеКоманд.Количество() > 0 Тогда
//		ПараметрыПисьма = ОтправкаПочтовыхСообщенийВызовСервера.ПараметрыЭлектронногоПисьма(ОписаниеКоманд,
//		ЕстьОшибки, ДополнительныеПараметры); 
//		
//		#Вставка
//		
//		СтрТемаПисьма = "";
//		
//		Для Каждого Стр Из ОбъектыОтправки Цикл
//			
//			Если СтрТемаПисьма = "" Тогда
//				
//				СтрТемаПисьма = ОтправкаПочтовыхСообщенийВызовСервера.ПолучитьТему(Стр);
//				
//			Иначе
//				
//				СтрТемаПисьма = СтрТемаПисьма + "; " + ОтправкаПочтовыхСообщенийВызовСервера.ПолучитьТему(Стр);
//				
//			КонецЕсли;
//			
//		КонецЦикла; 
//		
//		ПараметрыПисьма.Тема = СтрТемаПисьма;	
//		
//		ПервыйПроход = Истина;
//		
//		ВторойПроход = Истина;
//		
//		ТретийПроход = Истина;
//		
//		ПредставлениеПолучателя = "";
//		
//		Для Каждого СтрПолучатель Из ПараметрыПисьма.Получатель Цикл
//				
//			Если ПервыйПроход Тогда
//				
//				ПредставлениеПолучателя = Строка(СтрПолучатель.ИсточникКонтактнойИнформации);
//				
//				СтрПолучатель.Адрес = "fin1@cargostar.pro"; 
//				СтрПолучатель.Представление = ПредставлениеПолучателя;
//				СтрПолучатель.Выбран = Истина;
//				
//				ПервыйПроход = Ложь;
//				
//				Продолжить;
//				
//			КонецЕсли;
//			
//			Если ВторойПроход И НЕ ПервыйПроход Тогда
//				
//				СтрПолучатель.Адрес = "buh1@cargostar.pro"; 
//				СтрПолучатель.Представление = ПредставлениеПолучателя;
//				СтрПолучатель.Выбран = Истина;
//				
//				ВторойПроход = Ложь;
//				
//				Продолжить;
//				
//			КонецЕсли;
//			
//			Если ТретийПроход И НЕ ВторойПроход И НЕ ПервыйПроход Тогда
//				
//				СтрПолучатель.Адрес = "buh2@cargostar.pro"; 
//				СтрПолучатель.Представление = ПредставлениеПолучателя;
//				СтрПолучатель.Выбран = Истина;
//				
//				ТретийПроход = Ложь;
//				
//				Продолжить;
//				
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		Если ПараметрыПисьма.Получатель.Количество() > 2 Тогда
//			
//			ПараметрыПисьма.Получатель.Очистить();
//			
//		КонецЕсли;
//		
//		Если ПараметрыПисьма.Получатель.Количество() = 0 Тогда
//			
//			Структ = Новый Структура;
//			Структ.Вставить("Адрес", "fin1@cargostar.pro");
//			Структ.Вставить("Выбран", Истина);
//			Структ.Вставить("ИсточникКонтактнойИнформации", ?(ОбъектыОтправки.Количество() > 0, ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЗначениеРеквизитаОбъекта(ОбъектыОтправки[0],"Контрагент"), Неопределено));
//			Структ.Вставить("Представление", Строка(Структ.ИсточникКонтактнойИнформации)); 
//			
//			ПараметрыПисьма.Получатель.Добавить(Структ);
//			
//			Структ = Новый Структура;
//			Структ.Вставить("Адрес", "buh1@cargostar.pro");
//			Структ.Вставить("Выбран", Истина);
//			Структ.Вставить("ИсточникКонтактнойИнформации", ?(ОбъектыОтправки.Количество() > 0, ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЗначениеРеквизитаОбъекта(ОбъектыОтправки[0],"Контрагент"), Неопределено));
//			Структ.Вставить("Представление", Строка(Структ.ИсточникКонтактнойИнформации)); 
//			
//			ПараметрыПисьма.Получатель.Добавить(Структ);
//			
//			Структ = Новый Структура;
//			Структ.Вставить("Адрес", "buh2@cargostar.pro");
//			Структ.Вставить("Выбран", Истина);
//			Структ.Вставить("ИсточникКонтактнойИнформации", ?(ОбъектыОтправки.Количество() > 0, ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЗначениеРеквизитаОбъекта(ОбъектыОтправки[0],"Контрагент"), Неопределено));
//			Структ.Вставить("Представление", Строка(Структ.ИсточникКонтактнойИнформации)); 
//			
//			ПараметрыПисьма.Получатель.Добавить(Структ);
//			
//		ИначеЕсли ПараметрыПисьма.Получатель.Количество() = 1 Тогда
//			
//			Структ = Новый Структура;
//			Структ.Вставить("Адрес", "buh1@cargostar.pro");
//			Структ.Вставить("Выбран", Истина);
//			Структ.Вставить("ИсточникКонтактнойИнформации", ?(ОбъектыОтправки.Количество() > 0, ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЗначениеРеквизитаОбъекта(ОбъектыОтправки[0],"Контрагент"), Неопределено));
//			Структ.Вставить("Представление", Строка(Структ.ИсточникКонтактнойИнформации)); 
//			
//			ПараметрыПисьма.Получатель.Добавить(Структ);
//			
//			Структ = Новый Структура;
//			Структ.Вставить("Адрес", "buh2@cargostar.pro");
//			Структ.Вставить("Выбран", Истина);
//			Структ.Вставить("ИсточникКонтактнойИнформации", ?(ОбъектыОтправки.Количество() > 0, ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЗначениеРеквизитаОбъекта(ОбъектыОтправки[0],"Контрагент"), Неопределено));
//			Структ.Вставить("Представление", Строка(Структ.ИсточникКонтактнойИнформации)); 
//			
//			ПараметрыПисьма.Получатель.Добавить(Структ);
//			
//		ИначеЕсли ПараметрыПисьма.Получатель.Количество() = 2 Тогда
//			
//			Структ = Новый Структура;
//			Структ.Вставить("Адрес", "buh2@cargostar.pro");
//			Структ.Вставить("Выбран", Истина);
//			Структ.Вставить("ИсточникКонтактнойИнформации", ?(ОбъектыОтправки.Количество() > 0, ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЗначениеРеквизитаОбъекта(ОбъектыОтправки[0],"Контрагент"), Неопределено));
//			Структ.Вставить("Представление", Строка(Структ.ИсточникКонтактнойИнформации)); 
//			
//			ПараметрыПисьма.Получатель.Добавить(Структ);		
//			
//		КонецЕсли;
//		
//		#КонецВставки
//		
//		Если ЗначениеЗаполнено(ПараметрыПисьма.Вложения) И НЕ ЕстьОшибки Тогда
//			КлючеваяОперация = "БыстраяОтправкаДокументаПоЭлектроннойПочте";
//			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
//			РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыПисьма);
//		КонецЕсли;
//	КонецЕсли;

//КонецПроцедуры  

