
&НаСервере
Функция СформироватьОтчетНаСервере()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = Обработки.РеестрПросроченныхСчетов.ПолучитьМакет("Макет");
	
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&ДН, НЕДЕЛЯ) КАК Период
	|ИТОГИ ПО
	|	Период ПЕРИОДАМИ(НЕДЕЛЯ, &ДН, &ДК)";
	З.УстановитьПараметр("ДН", ЭтотОбъект.ПериодОтчета.ДатаНачала);
	З.УстановитьПараметр("ДК", ЭтотОбъект.ПериодОтчета.ДатаОкончания);
	
	Выб = З.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ"); 
	
	ТЗНедели = Новый ТаблицаЗначений;
	
	ТЗНедели.Колонки.Добавить("ПериодНеделя");
	
	Пока Выб.Следующий() Цикл
		
		СтрТЗ = ТЗНедели.Добавить();
		СтрТЗ.ПериодНеделя = Выб.Период;
	
	КонецЦикла;
	
	ТЗИтоговая = Новый ТаблицаЗначений;
	
	ТЗИТоговая.Колонки.Добавить("Контрагент");
	ТЗИТоговая.Колонки.Добавить("Итоги");
	
	КолонкиДляСуммирования = "";
	
	Для Каждого СтрТЗ Из ТЗНедели Цикл
					
			ТЗИтоговая.Колонки.Добавить("Неделя"+Формат(НеделяГода(СтрТЗ.ПериодНеделя),"ЧГ="));
			
			Если КолонкиДляСуммирования = "" Тогда
				
				КолонкиДляСуммирования = "Неделя"+Формат(НеделяГода(СтрТЗ.ПериодНеделя),"ЧГ=");
				
			Иначе
				
				КолонкиДляСуммирования = КолонкиДляСуммирования + ",Неделя"+Формат(НеделяГода(СтрТЗ.ПериодНеделя),"ЧГ=");
				
			КонецЕсли;
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеестрОплатыСчетовОстатки.СчетНаОплату.Контрагент КАК Контрагент,
		               |	РеестрОплатыСчетовОстатки.СчетНаОплату КАК СчетНаОплату,
		               |	РеестрОплатыСчетовОстатки.СуммаОстаток КАК СуммаОстаток
		               |ИЗ
		               |	РегистрНакопления.РеестрОплатыСчетов.Остатки(&Период, ) КАК РеестрОплатыСчетовОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеестрОплатыСчетовОстатки.СчетНаОплату.Контрагент,
		               |	РеестрОплатыСчетовОстатки.СчетНаОплату,
		               |	РеестрОплатыСчетовОстатки.СуммаОстаток";
		
		Запрос.УстановитьПараметр("Период", КонецНедели(СтрТЗ.ПериодНеделя));
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из Выборка Цикл 	
			
			Если ЗначениеЗаполнено(Стр.СчетНаОплату) Тогда
				
				Если СтрТЗ.ПериодНеделя >= НачалоНедели(Стр.СчетНаОплату.Дата + 86400*20) Тогда
					
					СтрТЗИтоговая = ТЗИтоговая.Добавить();
					
					СтрТЗИтоговая.Контрагент = Стр.Контрагент;
					
					СтрТЗИтоговая["Неделя"+Формат(НеделяГода(СтрТЗ.ПериодНеделя),"ЧГ=")] = Стр.СуммаОстаток;
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТЗИтоговая.Свернуть("Контрагент, Итоги", КолонкиДляСуммирования);
	
	ТЗИТоговая.Сортировать("Контрагент ВОЗР");
	
	МассивКолонок = Новый Массив;
	
	Для Каждого СтрКолонок Из ТЗИтоговая.Колонки Цикл 
		
		Если СтрНайти(СтрКолонок.Имя, "Неделя") > 0 Тогда
			
			МассивКолонок.Добавить(СтрКолонок.Имя);

		КонецЕсли;
			
	КонецЦикла;
	
	ПервыйПроход = Истина;
	
	НомерПП = 1;
	
	Для Каждого СтрТЗ Из ТЗИтоговая Цикл
		
		Если ПервыйПроход Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Контрагент"); 
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Для Каждого Стр Из МассивКолонок Цикл 
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Неделя");
				ОбластьМакета.Параметры.Неделя = СтрЗаменить(Стр, "Неделя", "");
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
			КонецЦикла;
			
		КонецЕсли;
			
		ПервыйПроход = Ложь;
				
		ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|Контрагент");
		ОбластьМакета.Параметры.Контрагент = СтрТЗ.Контрагент;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Для Каждого Стр Из МассивКолонок Цикл 
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|Неделя");
			ОбластьМакета.Параметры.ДолгНеделя = СтрТЗ[Стр];
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		КонецЦикла;
		
	КонецЦикла;	
	
	ТЗИтоговая.Свернуть("Итоги", КолонкиДляСуммирования);
	
	Для Каждого СтрТЗ ИЗ ТЗИтоговая Цикл 
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|Контрагент");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Для Каждого Стр Из МассивКолонок Цикл 
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|Неделя");
			ОбластьМакета.Параметры.ИтогДолгНеделя = СтрТЗ[Стр];
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		КонецЦикла;	
		
	КонецЦикла;
	
	ТабличныйДокумент.ФиксацияСверху = 1;

	Возврат ТабличныйДокумент;
	
КонецФункции 

&НаКлиенте
Процедура СформироватьОтчет(Команда) 
	
	Если ЗначениеЗаполнено(ПериодОтчета.ДатаНачала) И ЗначениеЗаполнено(ПериодОтчета.ДатаОкончания) Тогда
		
		Если ПериодОтчета.ДатаНачала <= ПериодОтчета.ДатаОкончания Тогда
			
			КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("РеестрПросроченныхСчетов");    
			// Добавляем в коллекцию (тип массив) сформированный Табличный документ
			КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьОтчетНаСервере(); 
			// если требуется устанавливаем параметры печати
			КоллекцияПечатныхФорм[0].СинонимМакета = "Реестр просроченных счетов";
			
			КоллекцияПечатныхФорм[0].Экземпляров = 1;
			
			УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);  
			
		Иначе 
			
			Сообщить("Невозможно вывести отчет: конец периода должен быть больше начала периода");  
			
		КонецЕсли; 
		
	Иначе
		
		Сообщить("Невозможно вывести отчет: период должен быть заполнен");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ПериодОтчета.ДатаНачала = НачалоГода(ТекущаяДата());
	ЭтотОбъект.ПериодОтчета.ДатаОкончания = КонецГода(ТекущаяДата());
	
КонецПроцедуры
