
&НаСервере
&ИзменениеИКонтроль("ДокументыОснованияДокументОснованиеПриИзмененииНаСервере")
Процедура ЛГС_ДокументыОснованияДокументОснованиеПриИзмененииНаСервере()

	ПараметрыСчетаФактуры = ПолучитьПараметрыСчетаФактуры();

	ЗаполнитьЗначенияСвойствОбъекта(Объект, ПараметрыСчетаФактуры);
	
	#Вставка
	
	Объект.СуммаДокумента = ПараметрыСчетаФактуры.СуммаДокумента;
	Объект.СуммаДокументаКомиссия = ПараметрыСчетаФактуры.СуммаДокументаКомиссия;
	Объект.СуммаНДСДокумента = ПараметрыСчетаФактуры.СуммаНДСДокумента;
	Объект.СуммаНДСДокументаКомиссия = ПараметрыСчетаФактуры.СуммаНДСДокументаКомиссия;
	
	#КонецВставки
	
	Если Объект.ДокументыОснования.Количество() = 1
		И НЕ Объект.ДокументыОснования[0].ДокументОснование = Объект.ДокументОснование Тогда
		Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
	КонецЕсли;

	СвойстваДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорКонтрагента, "ВидДоговора, НДСПоСтавкам4и2, ВидАгентскогоДоговора");

	ВидДоговораКонтрагента = СвойстваДоговора.ВидДоговора;
	НДСПоСтавкам4и2 = СвойстваДоговора.НДСПоСтавкам4и2;
	НДСИсчисляетсяНалоговымАгентом = Перечисления.ВидыАгентскихДоговоров.НДСИсчисляетсяНалоговымАгентом(СвойстваДоговора.ВидАгентскогоДоговора);

	Если ВидДоговораКонтрагента <> Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку Тогда
		Если Объект.ВозвратЧерезКомиссионера Тогда
			Если Объект.ДокументыОснования.Количество() = 0 Тогда 
				Объект.Продавец = Неопределено;
				Объект.Продавцы.Очистить();
				Объект.ВозвратЧерезКомиссионера = Ложь;
			КонецЕсли;
		Иначе
			Объект.Продавец = Неопределено;
			Объект.Продавцы.Очистить();
		КонецЕсли;
	КонецЕсли;

	УстановитьЗаявлениеОВвозеТоваровОтКомиссионера();

	УстановитьВидимость();

	УстановитьПорядокОтраженияВычетаНаСервере();

	УстановитьКодВидаОперацииНаСервере();

	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры
