
Процедура КлиентПриИзменении(Форма) Экспорт
	
	КлиентОбработатьИзменение(Форма, Новый Массив);
	
КонецПроцедуры

Процедура КлиентОбработатьИзменение(Форма, ПричиныИзмененияСчетовУчета)
	
	Объект 		= Форма.Объект;
	Элементы 	= Форма.Элементы;
	
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьУстановитьДоговорКонтрагента(Форма, ПричиныИзмененияСчетовУчета);
	
КонецПроцедуры

// Подготавливает параметры формы (отборы, списки выбора) в зависимости от контрагента
Процедура ПроверитьУстановитьДоговорКонтрагента(Форма, ПричиныИзмененияСчетовУчета) Экспорт
			
			ДоговорКонтрагентаОбработатьИзменение(Форма, ПричиныИзмененияСчетовУчета);

КонецПроцедуры

Процедура ДоговорКонтрагентаОбработатьИзменение(Форма, ПричиныИзмененияСчетовУчета)
	
	Объект = Форма.Объект;
	
	ПричиныИзмененияСчетовУчета.Добавить("ДоговорКонтрагента");
		
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		
		ПараметрыДоговора = РаботаСДоговорамиКонтрагентовБП.ПараметрыДоговора(Объект.Договор);
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Объект.Договор, "Владелец");
		
		Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
			Объект.Клиент = РеквизитыДоговора.Владелец;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры