
#Область ОпределениеКоманд

&После("ДобавитьКомандыПечати")
Процедура ЛГС_ДобавитьКомандыПечати(КомандыПечати)
	
	// Договор ТЭО
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДоговорТЭО";
	КомандаПечати.Представление = НСтр("ru = 'Договор ТЭО'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаСпискаОбщая,ФормаЭлемента";
	КомандаПечати.Порядок = 170;
	
	// Договор ТП
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДоговорТП";
	КомандаПечати.Представление = НСтр("ru = 'Договор ТП'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаСпискаОбщая,ФормаЭлемента";
	КомандаПечати.Порядок = 171;  
	
	// Договор ТЭОТП
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДоговорТЭОТП";
	КомандаПечати.Представление = НСтр("ru = 'Договор ТЭО И ТП'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаСпискаОбщая,ФормаЭлемента";
	КомандаПечати.Порядок = 172;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорТЭО") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорТЭО", "Договор ТЭО №" + МассивОбъектов[0].Номер + " от " + Формат(МассивОбъектов[0].Дата,"ДФ='dd.MM.yyyy""г.""'"), 
		СформироватьПечатнуюФормуДоговорТЭО(МассивОбъектов, ОбъектыПечати, "ДоговорТЭО"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорТП") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорТП", "Договор ТП №" + МассивОбъектов[0].Номер + " от " + Формат(МассивОбъектов[0].Дата,"ДФ='dd.MM.yyyy""г.""'"), 
		СформироватьПечатнуюФормуДоговорТП(МассивОбъектов, ОбъектыПечати, "ДоговорТП"));
	КонецЕсли;    
	
		//Колупаев М.Б. 23.07.2026 ID 6908	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорТЭОТП") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорТЭОТП", "ДоговорТЭО И ТП" + МассивОбъектов[0].Номер + " от " + Формат(МассивОбъектов[0].Дата,"ДФ='dd.MM.yyyy""г.""'"), 
		СформироватьПечатнуюФормуДоговорТЭОТП(МассивОбъектов, ОбъектыПечати, "ДоговорТЭОТП"));
	КонецЕсли;

		
КонецПроцедуры
#КонецОбласти   


#Область ЗаполнениеМакетов 

&НаСервере
Функция СформироватьПечатнуюФормуДоговорТЭОТП(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
	//Колупаев М.Б. 23.07.2026 ID 6908	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТЭОТП"; 
	ТабличныйДокумент.Защита = Ложь;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументДоговорТЭОТП(ТабличныйДокумент, МассивОбъектов[0]); 
	
	// В табличном документе зададим имя области, в которую был 
	// выведен объект. Нужно для возможности печати покомплектно.
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	1, ОбъектыПечати, МассивОбъектов[0]);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументДоговорТЭОТП(ТабДок, Договор)
		//Колупаев М.Б. 23.07.2026 ID 6908	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДоговорыКонтрагентов.ДоговорТЭОТП");	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Организация);
	СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Владелец);

	ОбластьШапка.Параметры.Номер = Договор.Номер;
	ОбластьШапка.Параметры.Дата = Формат(Договор.Дата, "ДЛФ=DD");

	СтруктураАдресаОрг = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(СведенияОбОрганизации.ЗначениеJSONЮридическийАдрес); 
	
	Если СтруктураАдресаОрг.Свойство("city") Тогда
			
			ОбластьШапка.Параметры.Город = СтруктураАдресаОрг.cityType + " " + СтруктураАдресаОрг.city;
			
	ИначеЕсли СтруктураАдресаОрг.Свойство("locality") Тогда	
		
		ОбластьШапка.Параметры.Город = СтруктураАдресаОрг.localityType + ". " + СтруктураАдресаОрг.locality;
		
	ИначеЕсли СтруктураАдресаОрг.Свойство("area") Тогда	
		
		ОбластьШапка.Параметры.Город = СтруктураАдресаОрг.areaType + ". " + СтруктураАдресаОрг.area;
		
	КонецЕсли;
	
	
	ОбластьШапка.Параметры.ДолжностьОтветственногоЛицаОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.ДолжностьРуководителя, 2);
	ОбластьШапка.Параметры.ОтветственноеЛицоОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.Руководитель, 2);
	ОбластьШапка.Параметры.НаименованиеКлиента = СведенияОКонтрагенте.ПолноеНаименование;
	ОбластьШапка.Параметры.ОтветственноеЛицоКлиентаСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.РуководительКонтрагента, 2); 
	
	ФайлыПечатиИПодписи = Справочники.Организации.ПодписиИПечатиОрганизации(Договор.Организация,ТекущаяДата());
	
	//РуководительКартинка = Новый Картинка; 
	//ОрганизацияКартинка = Новый Картинка;
	//РуководительКартинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"];
	//ОрганизацияКартинка  = ФайлыПечатиИПодписи["ФаксимилеПечать"];
	
	
	Если Строка(Договор.Организация) = "ДЕКЛАРАНТ-РУС ЦЕНТР ООО" Тогда
		ОбластьШапка.Параметры.НазваниеОрганизации = "ДЕКЛАРАНТ-РУС ЦЕНТР"; 	
		//ОбластьОрганизация = Макет.ПолучитьОбласть("Логистикс"); 
		ОбластьОрганизация = Макет.ПолучитьОбласть("Центр"); 
		
		ОбластьОрганизация.Параметры.Экспедитор = "Общество с ограниченной ответственностью ""ДЕКЛАРАНТ-РУС ЦЕНТР"""; 
		ОбластьОрганизация.Параметры.ИНН = "5074080761" ;
		ОбластьОрганизация.Параметры.КПП = "507401001" ;
		ОбластьОрганизация.Параметры.ОГРН = "ОГРН 1235000034378" ;
		ОбластьОрганизация.Параметры.ОКПО =  "ОКПО 49693339" ;
		ОбластьОрганизация.Параметры.ЮРАдрес = "Юридический адрес: 142100, Московская область, г.о. Подольск, г Подольск, ул Комсомольская, дом 28, строение 2, офис 301" ;
		ОбластьОрганизация.Параметры.ФИОКонтактного = "ФИО контактного (ответственного) лица: Колодкин Максим Евгеньевич" ;
		ОбластьОрганизация.Параметры.ПочтаКонтактного = "E-mail контактного (ответственного) лица: info@declarant-rus.ru" ;
		ОбластьОрганизация.Параметры.РС = "40702810520000151946" ;
		ОбластьОрганизация.Параметры.Банк = "ООО ""Банк Точка""" ;
		ОбластьОрганизация.Параметры.КС = "30101810745374525104" ;
		ОбластьОрганизация.Параметры.БИК = "044525104" ;
		ОбластьОрганизация.Параметры.ГенеральныйДиректор = "Колодкин М. Е./" ;
		
	ИначеЕсли Строка(Договор.Организация) = "ДЕКЛАРАНТ-РУС ЛОГИСТИКС ООО" Тогда   
		
		ОбластьШапка.Параметры.НазваниеОрганизации = "Декларант-Рус Логистикс";
		ОбластьОрганизация = Макет.ПолучитьОбласть("Центр");  
		
		ОбластьОрганизация.Параметры.Экспедитор = "Декларант-Рус Логистикс";    
		ОбластьОрганизация.Параметры.ИНН = "2315213101" ;
		ОбластьОрганизация.Параметры.КПП = "231501001" ;
		ОбластьОрганизация.Параметры.ОГРН = "ОГРН 1192375055036" ;
		ОбластьОрганизация.Параметры.ОКПО =  "ОКПО 40935427" ;
		ОбластьОрганизация.Параметры.ЮРАдрес = "Юридический адрес: 353907, Краснодарский край, Новороссийск г, Кутузовская ул, дом 10, офис 35" ;
		ОбластьОрганизация.Параметры.ФИОКонтактного = "ФИО контактного (ответственного) лица: Куршина Н.В." ;
		ОбластьОрганизация.Параметры.ПочтаКонтактного = "E-mail контактного (ответственного) лица: info@declarant-rus.ru" ;
		ОбластьОрганизация.Параметры.РС = "40702810630000081237" ;
		ОбластьОрганизация.Параметры.Банк = "КРАСНОДАРСКОЕ ОТДЕЛЕНИЕ N8619 ПАО СБЕРБАНК " ;
		ОбластьОрганизация.Параметры.КС = "30101810100000000602" ;
		ОбластьОрганизация.Параметры.БИК = "040349602" ;
		ОбластьОрганизация.Параметры.ГенеральныйДиректор = "Куршина Н.В./" ;
		  
				
	ИначеЕсли Строка(Договор.Организация) = "ВНЕШТОРГ-РУС ООО" Тогда
		ОбластьШапка.Параметры.НазваниеОрганизации = "Внешторг-Рус";
		//ОбластьОрганизация = Макет.ПолучитьОбласть("Внешторг");
		ОбластьОрганизация = Макет.ПолучитьОбласть("Центр");  
		
		ОбластьОрганизация.Параметры.Экспедитор = "ООО ""Внешторг-Рус""";  
		ОбластьОрганизация.Параметры.ИНН = "9723082837" ;
		ОбластьОрганизация.Параметры.КПП = "772301001" ;
		ОбластьОрганизация.Параметры.ОГРН = "Юридический адрес: 109469, г. Москва, ул. Белореченская, дом 34, корпус 2, квартира 9" ;
		ОбластьОрганизация.Параметры.ОКПО =  "ФИО контактного (ответственного) лица: Колодкин Максим Евгеньевич " ;
		ОбластьОрганизация.Параметры.ЮРАдрес = "E-mail контактного (ответственного) лица: nfo@vnesh-torg.ru" ;
		ОбластьОрганизация.Параметры.РС = "40702810638000442325" ;
		ОбластьОрганизация.Параметры.Банк = "ПАО Сбербанк" ;
		ОбластьОрганизация.Параметры.КС = "30101810400000000225" ;
		ОбластьОрганизация.Параметры.БИК = " 044525225" ;
		ОбластьОрганизация.Параметры.ГенеральныйДиректор = "Колодкин М.Е./" ;

	
	КонецЕсли; 
	
			
		ОбластьОрганизация.Рисунки.ФаксимилеПечать.Картинка = ФайлыПечатиИПодписи["ФаксимилеПечать"];  
		//ОбластьОрганизация.Рисунки.ФаксимилеПечать.Картинка = ОрганизацияКартинка;
		ОбластьОрганизация.Рисунки.ФаксимилеРуководитель.Картинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"]; 
		//ОбластьОрганизация.Рисунки.ФаксимилеРуководитель.Картинка = РуководительКартинка; 

	
	
	ОбластьОрганизация.Параметры.НаименованиеКлиента = СведенияОКонтрагенте.ПолноеНаименование;
	ОбластьОрганизация.Параметры.ИННКлиента = СведенияОКонтрагенте.ИНН;
	ОбластьОрганизация.Параметры.КППКлиента = СведенияОКонтрагенте.КПП;
	ОбластьОрганизация.Параметры.ОГРНКлиента = СведенияОКонтрагенте.ОГРН;
	ОбластьОрганизация.Параметры.ЮрАдресКлиента = СведенияОКонтрагенте.ЮридическийАдрес; 
	ОбластьОрганизация.Параметры.ФактАдресКлиента = СведенияОКонтрагенте.ФактическийАдрес;
	ОбластьОрганизация.Параметры.ПочтАдресКлиента = СведенияОКонтрагенте.ПочтовыйАдрес;
	ОбластьОрганизация.Параметры.ПочтаКлиента = СведенияОКонтрагенте.Email;
	ОбластьОрганизация.Параметры.РСКлиента = СведенияОКонтрагенте.НомерСчета;
	ОбластьОрганизация.Параметры.БанкКлиента = СведенияОКонтрагенте.Банк;
	ОбластьОрганизация.Параметры.КорСчетКлиента = СведенияОКонтрагенте.КоррСчет;
	ОбластьОрганизация.Параметры.БИККлиента = СведенияОКонтрагенте.БИК;
	ОбластьОрганизация.Параметры.Телефон = СведенияОКонтрагенте.ТелефонЮридическогоАдреса;
	ОбластьОрганизация.Параметры.ДолжностьОтветственногоЛицаКлиента = Договор.ДолжностьРуководителяКонтрагента;
	ОбластьОрганизация.Параметры.ОтветственноеЛицоКлиента = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Договор.РуководительКонтрагента);
		
	ТабДок.Вывести(ОбластьШапка); 
	
	// ++ ХАУНД Устинин С.А. 24.09.2026 ID 9554 
	Если Строка(Договор.Организация) = "ДЕКЛАРАНТ-РУС ЛОГИСТИКС ООО" ИЛИ Строка(Договор.Организация) = "ДЕКЛАРАНТ-РУС ЦЕНТР ООО" Тогда
		ОбластьПредметДоговора = Макет.ПолучитьОбласть("ПредметДоговораЦентрЛогистикс");
	Иначе
		ОбластьПредметДоговора = Макет.ПолучитьОбласть("ПредметДоговора");
	КонецЕсли;
	ТабДок.Вывести(ОбластьПредметДоговора); 
	
	ОбластьДоговор = Макет.ПолучитьОбласть("Договор");
	ТабДок.Вывести(ОбластьДоговор);
	// -- ХАУНД Устинин С.А. 24.09.2026 ID 9554
	
	ТабДок.Вывести(ОбластьОрганизация);   
	
	Возврат ТабДок;
	
КонецФункции   




&НаСервере
Функция СформироватьПечатнуюФормуДоговорТЭО(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
		
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДоговорТЭО"; 
	ТабличныйДокумент.Защита = Ложь;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументДоговорТЭО(ТабличныйДокумент, МассивОбъектов[0]); 
	
	// В табличном документе зададим имя области, в которую был 
	// выведен объект. Нужно для возможности печати покомплектно.
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	1, ОбъектыПечати, МассивОбъектов[0]);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументДоговорТЭО(ТабДок, Договор)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДоговорыКонтрагентов.ДоговорТЭО");	
	
	ОбластьДоговор = Макет.ПолучитьОбласть("Договор");
	
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Организация);
	СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Владелец);

	ОбластьДоговор.Параметры.Номер = Договор.Номер;
	ОбластьДоговор.Параметры.Дата = Формат(Договор.Дата, "ДЛФ=DD");

	СтруктураАдресаОрг = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(СведенияОбОрганизации.ЗначениеJSONЮридическийАдрес); 
	
	Если СтруктураАдресаОрг.Свойство("city") Тогда
			
			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.cityType + " " + СтруктураАдресаОрг.city;
			
	ИначеЕсли СтруктураАдресаОрг.Свойство("locality") Тогда	
			
			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.localityType + ". " + СтруктураАдресаОрг.locality;
			
	ИначеЕсли СтруктураАдресаОрг.Свойство("area") Тогда	
			
			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.areaType + ". " + СтруктураАдресаОрг.area;
			
	КонецЕсли;
	
	Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		Если ЗначениеЗаполнено(Договор.ЗаРуководителяКонтрагентаПоПриказу) Тогда
			ОбластьДоговор.Параметры.УставОГРНИПСклонение = Договор.ЗаРуководителяКонтрагентаПоПриказу;
		Иначе
			ОбластьДоговор.Параметры.УставОГРНИПСклонение = "Устава, ОГРН";
		КонецЕсли;
		
	Иначе
		
		ОбластьДоговор.Параметры.УставОГРНИПСклонение = "ОГРНИП";
		
	КонецЕсли;
	
	ОбластьДоговор.Параметры.НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.ДолжностьРуководителя, 2);
	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.Руководитель, 2);
	
	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаКлиентаСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.ДолжностьРуководителяКонтрагента, 2);
	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиентаСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.РуководительКонтрагента, 2);
	ОбластьДоговор.Параметры.ИННОрганизации = СведенияОбОрганизации.ИНН;
	ОбластьДоговор.Параметры.КППОрганизации = СведенияОбОрганизации.КПП;
	ОбластьДоговор.Параметры.ОГРНОрганизации = СведенияОбОрганизации.ОГРН;
	ОбластьДоговор.Параметры.ОКПООрганизации = СведенияОбОрганизации.КодПоОКПО;
	ОбластьДоговор.Параметры.ЮрАдресОрганизации = СведенияОбОрганизации.ЮридическийАдрес;
	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизации = Договор.Руководитель;
	ОбластьДоговор.Параметры.ПочтаОрганизации = СведенияОбОрганизации.Email;
	ОбластьДоговор.Параметры.РСОрганизации = СведенияОбОрганизации.НомерСчета;
	ОбластьДоговор.Параметры.БанкОрганизации = СведенияОбОрганизации.Банк;
	ОбластьДоговор.Параметры.КорСчетОрганизации = СведенияОбОрганизации.КоррСчет;
	ОбластьДоговор.Параметры.БИКОрганизации = СведенияОбОрганизации.БИК;
	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаОрганизации = Договор.ДолжностьРуководителя;
	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизацииИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Договор.Руководитель);
	
	ОбластьДоговор.Параметры.НаименованиеКлиента = СведенияОКонтрагенте.ПолноеНаименование;
	ОбластьДоговор.Параметры.ИННКлиента = СведенияОКонтрагенте.ИНН;
	ОбластьДоговор.Параметры.КППКлиента = СведенияОКонтрагенте.КПП;
	ОбластьДоговор.Параметры.ОГРНКлиента = СведенияОКонтрагенте.ОГРН;
	ОбластьДоговор.Параметры.ОКПОКлиента = СведенияОКонтрагенте.КодПоОКПО;
	ОбластьДоговор.Параметры.ЮрАдресКлиента = СведенияОКонтрагенте.ЮридическийАдрес;
	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиента = Договор.РуководительКонтрагента;
	ОбластьДоговор.Параметры.ПочтаКлиента = СведенияОКонтрагенте.Email;
	ОбластьДоговор.Параметры.РСКлиента = СведенияОКонтрагенте.НомерСчета;
	ОбластьДоговор.Параметры.БанкКлиента = СведенияОКонтрагенте.Банк;
	ОбластьДоговор.Параметры.КорСчетКлиента = СведенияОКонтрагенте.КоррСчет;
	ОбластьДоговор.Параметры.БИККлиента = СведенияОКонтрагенте.БИК;
	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаКлиента = Договор.ДолжностьРуководителяКонтрагента;
	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиентаИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Договор.РуководительКонтрагента);
		
	ТабДок.Вывести(ОбластьДоговор); 
	
	Возврат ТабДок;
	
КонецФункции   


&НаСервере
Функция СформироватьПечатнуюФормуДоговорТП(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
		
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДоговорТП"; 
	ТабличныйДокумент.Защита = Ложь;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументДоговорТП(ТабличныйДокумент, МассивОбъектов[0]); 
	
	// В табличном документе зададим имя области, в которую был 
	// выведен объект. Нужно для возможности печати покомплектно.
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	1, ОбъектыПечати, МассивОбъектов[0]);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументДоговорТП(ТабДок, Договор)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДоговорыКонтрагентов.ДоговорТП");	
	
	ОбластьДоговор = Макет.ПолучитьОбласть("Договор");
	
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Организация);
	СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Договор.Владелец);

	ОбластьДоговор.Параметры.Номер = Договор.Номер;
	ОбластьДоговор.Параметры.Дата = Формат(Договор.Дата, "ДЛФ=DD");
	ОбластьДоговор.Параметры.КонецГодаДата = Формат(КонецГода(Договор.Дата), "ДЛФ=DD");
	
	СтруктураАдресаОрг = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(СведенияОбОрганизации.ЗначениеJSONЮридическийАдрес); 
	
	Если СтруктураАдресаОрг.Свойство("city") Тогда
			
			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.cityType + " " + СтруктураАдресаОрг.city;
			
	ИначеЕсли СтруктураАдресаОрг.Свойство("locality") Тогда	
			
			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.localityType + ". " + СтруктураАдресаОрг.locality;
			
	ИначеЕсли СтруктураАдресаОрг.Свойство("area") Тогда	
			
			ОбластьДоговор.Параметры.Город = СтруктураАдресаОрг.areaType + ". " + СтруктураАдресаОрг.area;
			
	КонецЕсли;
	
	Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		Если ЗначениеЗаполнено(Договор.ЗаРуководителяКонтрагентаПоПриказу) Тогда
			ОбластьДоговор.Параметры.УставОГРНИПСклонение = Договор.ЗаРуководителяКонтрагентаПоПриказу;
		Иначе
			ОбластьДоговор.Параметры.УставОГРНИПСклонение = "Устава, ОГРН";
		КонецЕсли;
		
	Иначе
		
		ОбластьДоговор.Параметры.УставОГРНИПСклонение = "ОГРНИП";
		
	КонецЕсли;
	
	ОбластьДоговор.Параметры.НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.ДолжностьРуководителя, 2);
	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизацииСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.Руководитель, 2);
	
	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаКлиентаСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.ДолжностьРуководителяКонтрагента, 2);
	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиентаСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Договор.РуководительКонтрагента, 2);
	ОбластьДоговор.Параметры.ИННОрганизации = СведенияОбОрганизации.ИНН;
	ОбластьДоговор.Параметры.КППОрганизации = СведенияОбОрганизации.КПП;
	ОбластьДоговор.Параметры.ОГРНОрганизации = СведенияОбОрганизации.ОГРН;
	ОбластьДоговор.Параметры.ОКПООрганизации = СведенияОбОрганизации.КодПоОКПО;
	ОбластьДоговор.Параметры.ЮрАдресОрганизации = СведенияОбОрганизации.ЮридическийАдрес;
	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизации = Договор.Руководитель;
	ОбластьДоговор.Параметры.ПочтаОрганизации = СведенияОбОрганизации.Email;
	ОбластьДоговор.Параметры.РСОрганизации = СведенияОбОрганизации.НомерСчета;
	ОбластьДоговор.Параметры.БанкОрганизации = СведенияОбОрганизации.Банк;
	ОбластьДоговор.Параметры.КорСчетОрганизации = СведенияОбОрганизации.КоррСчет;
	ОбластьДоговор.Параметры.БИКОрганизации = СведенияОбОрганизации.БИК;
	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаОрганизации = Договор.ДолжностьРуководителя;
	ОбластьДоговор.Параметры.ОтветственноеЛицоОрганизацииИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Договор.Руководитель);
	
	ОбластьДоговор.Параметры.НаименованиеКлиента = СведенияОКонтрагенте.ПолноеНаименование;
	ОбластьДоговор.Параметры.ИННКлиента = СведенияОКонтрагенте.ИНН;
	ОбластьДоговор.Параметры.КППКлиента = СведенияОКонтрагенте.КПП;
	ОбластьДоговор.Параметры.ОГРНКлиента = СведенияОКонтрагенте.ОГРН;
	ОбластьДоговор.Параметры.ОКПОКлиента = СведенияОКонтрагенте.КодПоОКПО;
	ОбластьДоговор.Параметры.ЮрАдресКлиента = СведенияОКонтрагенте.ЮридическийАдрес;
	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиента = Договор.РуководительКонтрагента;
	ОбластьДоговор.Параметры.ПочтаКлиента = СведенияОКонтрагенте.Email;
	ОбластьДоговор.Параметры.РСКлиента = СведенияОКонтрагенте.НомерСчета;
	ОбластьДоговор.Параметры.БанкКлиента = СведенияОКонтрагенте.Банк;
	ОбластьДоговор.Параметры.КорСчетКлиента = СведенияОКонтрагенте.КоррСчет;
	ОбластьДоговор.Параметры.БИККлиента = СведенияОКонтрагенте.БИК;
	ОбластьДоговор.Параметры.ДолжностьОтветственногоЛицаКлиента = Договор.ДолжностьРуководителяКонтрагента;
	ОбластьДоговор.Параметры.ОтветственноеЛицоКлиентаИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Договор.РуководительКонтрагента);
	
	ТабДок.Вывести(ОбластьДоговор); 
	
		ТабДок.РазмерКолонтитулаСверху = 0;
		ТабДок.РазмерКолонтитулаСнизу = 0;
		ТабДок.ПолеСверху = 5;
		ТабДок.ПолеСнизу = 5;
		ТабДок.ПолеСправа = 5;
		ТабДок.ПолеСлева = 5;
		
	

	Возврат ТабДок;
	
КонецФункции   

#КонецОбласти
