
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Дата = ТекущаяДата();
	Объект.Заявка = Истина;
	Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();  
	Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	//ЭтотОбъект.Статус = Перечисления.СтатусыСделок.Новая;
	
	Объект.Квартал = НачалоКвартала(ТекущаяДата()); 
	Объект.ПодстатусСрочностьСборДокументов = Перечисления.СтатусыСрочностиСборДокументов.Нет;
	
	СтрСтатус = Объект.Статусы.Добавить(); 
	СтрСтатус.Статус = Перечисления.СтатусыСделок.Новая;
	СтрСтатус.Дата = ТекущаяДата();
	СтрСтатус.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПочтаОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", Константы.ПочтаДляУведомленияОЗаявке.Получить());
	ПараметрыПисьма.Вставить("УчетнаяЗапись", ПочтаОтправителя);                                                               
	ПараметрыПисьма.Вставить("АдресОтвета", Константы.ПочтаДляУведомленияОЗаявке.Получить());
	ПараметрыПисьма.Вставить("Тема", "Новая заявка на сделку от клиента: "+ПользователиКлиентСервер.ТекущийПользователь().Наименование);	
	ПараметрыПисьма.Вставить("Тело", "Создана новая сделка от клиента. Номер: "+Объект.Номер);
	ПараметрыПисьма.Вставить("ТипТекста", "ПростойТекст");
	
	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтаОтправителя,ПараметрыПисьма);
	
КонецПроцедуры
