
Процедура РазослатьПисьма() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛГС_КонтрольОтправкиПисемКонтрагентам.Документ КАК Документ,
	               |	ЛГС_КонтрольОтправкиПисемКонтрагентам.Отправлен КАК Отправлен
	               |ИЗ
	               |	РегистрСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам КАК ЛГС_КонтрольОтправкиПисемКонтрагентам
	               |ГДЕ
	               |	ЛГС_КонтрольОтправкиПисемКонтрагентам.Документ.Проведен = ИСТИНА
	               |	И ЛГС_КонтрольОтправкиПисемКонтрагентам.Документ.Дата >= &НачальнаяДатаОтправки
	               |	И ЛГС_КонтрольОтправкиПисемКонтрагентам.Отправлен = ЛОЖЬ
	               |	И ЛГС_КонтрольОтправкиПисемКонтрагентам.Документ.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НачальнаяДатаОтправки", Дата('20251215'));
	
	ТзТест = Запрос.Выполнить().Выгрузить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	                                                         
	Пока Выборка.Следующий() Цикл
				
		ДокументОбъект = Выборка.Документ.ПолучитьОбъект();                       
		
		Попытка 
			
			Если ДокументОбъект.ОтправитьНаПочтуПриПервомПроведении() Тогда
				
				МЗ = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьМенеджерЗаписи();
				
				МЗ.Отправлен = Истина;
				
				МЗ.Документ = Выборка.Документ;
				
				МЗ.Записать();
				
			КонецЕсли;
			
		Исключение
			
			ЗаписьЖурналаРегистрации("ЛГС_РассылкаПисем", УровеньЖурналаРегистрации.Ошибка, ДокументОбъект.Метаданные(), ДокументОбъект, 
									СтрШаблон("Не удалось отослать контрагенту %1 письмо с %2", Строка(ДокументОбъект.Контрагент), 
									Строка(ДокументОбъект)));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры