Перем мСтарыйДокумент;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Элементы.ДокументОснование.Видимость = Истина;	
		
		Элементы.ФормаЗаполнитьПоСделке.Видимость = Истина;
		
	КонецЕсли;
	
	НЗ = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Для Каждого Запись Из НЗ Цикл
		
		ЭтотОбъект.ОригиналПорученияЭкспедиторуПолучен = Запись.ОригиналПорученияЭкспедиторуПолучен;
		ЭтотОбъект.ОригиналПриложенияКДоговоруПолучен = Запись.ОригиналПриложенияКДоговоруПолучен;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	РаботаСКонтрагентамиБПКлиент.КонтрагентАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина;
	ОбщегоНазначенияБПКлиент.ОткрытьДоговорКонтрагента(ЭтотОбъект, Элемент, Объект.Договор);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	РаботаСДоговорамиКонтрагентовБПКлиент.ЗаполнитьСписокВыбора(Элемент, Текст, Ложь, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	
	ЛГС_ПоручениеЭкспедитору.КлиентПриИзменении(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацииТоваровИУслугРеализацияПриИзменении(Элемент)
	СтрокаТЧ = Элементы.РеализацииТоваровИУслуг.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Реализация", СтрокаТЧ.Реализация);
	
	НайденнаяСтрока = Объект.РеализацииТоваровИУслуг.НайтиСтроки(Отбор);
	
	Если НайденнаяСтрока.Количество() < 2 Тогда
		ДобавитьДанныеРеализацииНаСервере(СтрокаТЧ.Реализация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеРеализацииНаСервере(Реализация)
	
	ДобавляемыйДокумент = Реализация.ПолучитьОбъект();
	Если ДобавляемыйДокумент.Проведен Тогда
		Для Каждого Стр ИЗ ДобавляемыйДокумент.Услуги Цикл
			НоваяСтрока = Объект.СоставНоменклатуры.Добавить();
			НоваяСтрока.Содержание = Стр.Содержание;
			НоваяСтрока.Количество = Стр.Количество;
			НоваяСтрока.Цена = Стр.Цена;
			НоваяСтрока.Сумма = Стр.Сумма;
			НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
			НоваяСтрока.Документ = ДобавляемыйДокумент.Ссылка;
			НоваяСтрока.Валюта = ДобавляемыйДокумент.ВалютаДокумента;
			НоваяСтрока.СтавкаНДС = Стр.СтавкаНДС;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыКомитентамОтчетКомитентуПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ОтчетыКомитентам.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОтчетКомитенту", СтрокаТЧ.ОтчетКомитенту);
	
	НайденнаяСтрока = Объект.ОтчетыКомитентам.НайтиСтроки(Отбор);
	
	Если НайденнаяСтрока.Количество() < 2 Тогда
		ДобавитьДанныеОтчетаКомитентуНаСервере(СтрокаТЧ.ОтчетКомитенту);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеОтчетаКомитентуНаСервере(ОтчетКомитенту)
	ДобавляемыйДокумент = ОтчетКомитенту.ПолучитьОбъект();
	Если ДобавляемыйДокумент.Проведен Тогда
		Для Каждого Стр ИЗ ДобавляемыйДокумент.Товары Цикл
			Если Стр.Номенклатура.ВидНоменклатуры.Услуга Тогда
				НоваяСтрока = Объект.СоставНоменклатуры.Добавить();
				НоваяСтрока.Содержание = Стр.Содержание;
				НоваяСтрока.Количество = Стр.Количество;
				НоваяСтрока.Цена = Стр.Цена;
				НоваяСтрока.Сумма = Стр.Сумма;
				НоваяСтрока.Документ = ДобавляемыйДокумент.Ссылка;
				НоваяСтрока.Валюта = ДобавляемыйДокумент.ВалютаДокумента;
				НоваяСтрока.СтавкаНДС = Стр.СтавкаНДС;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацииТоваровИУслугПередУдалением(Элемент, Отказ)
	СтрокаТЧ = Элементы.РеализацииТоваровИУслуг.ТекущиеДанные;
	// Сохраним ссылку на старый документ
	мСтарыйДокумент = СтрокаТЧ.Реализация;
	// Удалим данные старого документа в ТЧ СоставНоменклатуры
	УдалитьДанныеДокумента(мСтарыйДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыКомитентамПередУдалением(Элемент, Отказ)
	СтрокаТЧ = Элементы.ОтчетыКомитентам.ТекущиеДанные;
	
	мСтарыйДокумент = СтрокаТЧ.ОтчетКомитенту;
	УдалитьДанныеДокумента(мСтарыйДокумент);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДанныеДокумента(Документ)
	СтруктураДляПоиска = Новый Структура("Документ", Документ);
	МассивУдаляемыхСтрок = Объект.СоставНоменклатуры.НайтиСтроки(СтруктураДляПоиска);
	Для Каждого Строка Из МассивУдаляемыхСтрок Цикл 
		Объект.СоставНоменклатуры.Удалить(Строка); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	СохранитьЭкспедитораПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьЭкспедитораПоУмолчаниюНаСервере()
	ХранилищеОбщихНастроек.Сохранить("ПоручениеЭкспедитору", 
	"Экспедитор",Объект.Экспедитор);
КонецПроцедуры

&НаКлиенте
Процедура ИзменяемоеСодержимоеПриложенияНаименованиеПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ИзменяемоеСодержимоеПриложения.ТекущиеДанные;
	СтрокаТЧ.Содержимое = ПолучитьСодержимое(СтрокаТч.Наименование);
КонецПроцедуры

&НаСервере
Функция ПолучитьСодержимое(Ссылка)
	Возврат Ссылка.ПолучитьОбъект().Содержимое;
КонецФункции

&НаСервере
Процедура ЗаполнитьПоСделкеНаСервере() 
	
	СписокРеализацийИОтчетовКомитенту = ПолучитьСписокРеализацийИОтчетовКомитентуПоСделке();
	
	Для Каждого Стр Из СписокРеализацийИОтчетовКомитенту Цикл
		
		Если ТипЗнч(Стр) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			СтрТЧ = Объект.РеализацииТоваровИУслуг.Добавить();
			СтрТЧ.Реализация = Стр; 
			
			СоставНоменклатуры = ПолучитьСоставНоменклатурыРеализации(Стр);
			
			Для Каждого СтрНом Из СоставНоменклатуры Цикл
				
				СтрТЧНом = Объект.СоставНоменклатуры.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрТЧНом, СтрНом);
				
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(Стр) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			
			СтрТЧ = Объект.ОтчетыКомитентам.Добавить();
			СтрТЧ.ОтчетКомитенту = Стр; 
			
			СоставНоменклатуры = ПолучитьСоставНоменклатурыОтчетаКомитенту(Стр);
			
			Для Каждого СтрНом Из СоставНоменклатуры Цикл
				
				СтрТЧНом = Объект.СоставНоменклатуры.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрТЧНом, СтрНом);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРеализацийИОтчетовКомитентуПоСделке()
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Сделка.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслуг.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажах.Ссылка
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	               |ГДЕ
	               |	ОтчетКомитентуОПродажах.ДокументОснование.Ссылка = &Ссылка
	               |	И ОтчетКомитентуОПродажах.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомитентуОПродажах.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Массив.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции 

&НаСервере   
Функция ПолучитьСоставНоменклатурыРеализации(Док) 
	
	МассивНоменклатуры = Новый Массив;
	
	ДобавляемыйДокумент = Док.ПолучитьОбъект();
	
	Для Каждого Стр ИЗ ДобавляемыйДокумент.Услуги Цикл 
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Содержание", Стр.Содержание);
		НоваяСтрока.Вставить("Количество", Стр.Количество);
		НоваяСтрока.Вставить("Цена", Стр.Цена);
		НоваяСтрока.Вставить("Сумма", Стр.Сумма);
		НоваяСтрока.Вставить("СуммаНДС", Стр.СуммаНДС);
		НоваяСтрока.Вставить("Документ", ДобавляемыйДокумент.Ссылка);
		НоваяСтрока.Вставить("Валюта", ДобавляемыйДокумент.ВалютаДокумента);
		НоваяСтрока.Вставить("СтавкаНДС", Стр.СтавкаНДС); 
		
		МассивНоменклатуры.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

&НаСервере   
Функция ПолучитьСоставНоменклатурыОтчетаКомитенту(Док) 
	
	МассивНоменклатуры = Новый Массив;
	
	ДобавляемыйДокумент = Док.ПолучитьОбъект();
	
	Для Каждого Стр ИЗ ДобавляемыйДокумент.Товары Цикл 
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Содержание", Стр.Содержание);
		НоваяСтрока.Вставить("Количество", Стр.Количество);
		НоваяСтрока.Вставить("Цена", Стр.Цена);
		НоваяСтрока.Вставить("Сумма", Стр.Сумма);
		НоваяСтрока.Вставить("СуммаНДС", Стр.СуммаНДС);
		НоваяСтрока.Вставить("Документ", ДобавляемыйДокумент.Ссылка);
		НоваяСтрока.Вставить("Валюта", ДобавляемыйДокумент.ВалютаДокумента);
		НоваяСтрока.Вставить("СтавкаНДС", Стр.СтавкаНДС); 
		
		МассивНоменклатуры.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоСделке(Команда) 
	
	Объект.СоставНоменклатуры.Очистить();
	Объект.РеализацииТоваровИУслуг.Очистить();
	Объект.ОтчетыКомитентам.Очистить();
	
	ЗаполнитьПоСделкеНаСервере();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	НЗ = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ОригиналПорученияЭкспедиторуПолучен = ЭтотОбъект.ОригиналПорученияЭкспедиторуПолучен;
			Запись.ОригиналПриложенияКДоговоруПолучен = ЭтотОбъект.ОригиналПриложенияКДоговоруПолучен;
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Если ЭтотОбъект.ОригиналПорученияЭкспедиторуПолучен ИЛИ ЭтотОбъект.ОригиналПриложенияКДоговоруПолучен Тогда
			
			Запись = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьМенеджерЗаписи();
			Запись.Документ = Объект.Ссылка;
			Запись.ОригиналПорученияЭкспедиторуПолучен = ЭтотОбъект.ОригиналПорученияЭкспедиторуПолучен;
			Запись.ОригиналПриложенияКДоговоруПолучен = ЭтотОбъект.ОригиналПриложенияКДоговоруПолучен;
			Запись.Записать();  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
