Функция ПользовательМожетМенятьСтатусДокумента() Экспорт
	
	// ++ ХАУНД Устинин 04.06.2026 ID: 4410
	ПользовательМожетМенятьСтатусДокумента = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОграничениеСчетов.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.ОграничениеСчетов КАК ОграничениеСчетов
	|ГДЕ
	|	ОграничениеСчетов.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПользовательМожетМенятьСтатусДокумента = Ложь;	
	КонецЕсли;

	Возврат ПользовательМожетМенятьСтатусДокумента;
	// -- ХАУНД Устинин 04.06.2026 ID: 4410
	
КонецФункции
