
&ИзменениеИКонтроль("ПолучитьКомиссионераДляПеревыставленногоСчетаФактуры")
Процедура ЛГС_ПолучитьКомиссионераДляПеревыставленногоСчетаФактуры(ДеревоДанных, ДанныеДляФормированияЭД, ПутьВДереве)

	ДанныеДокументаУчета = ДанныеДляФормированияЭД.ДанныеДокументаУчета;
	ДанныеШапки = ДанныеДокументаУчета.ДанныеШапки;

	Если Не (ДанныеШапки.Свойство("Комиссионер") И ЗначениеЗаполнено(ДанныеШапки.Комиссионер)) Тогда
		ДокументОснование = Неопределено;
		Если ТипЗнч(ДанныеДокументаУчета.ДокументыОснования) = Тип("Массив")
			И ДанныеДокументаУчета.ДокументыОснования.Количество() > 0 Тогда
			ДокументОснование = ДанныеДокументаУчета.ДокументыОснования[0];
		КонецЕсли;

		Если Не (ЗначениеЗаполнено(ДокументОснование)
			И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")) Тогда
			Возврат;
		КонецЕсли;

		СчетФактура = ДанныеДокументаУчета.СчетФактура;
		Если Не ЗначениеЗаполнено(СчетФактура) Тогда
			Возврат;
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
		|ГДЕ
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка = &ОтчетКомиссионераОПродажах
		|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.Контрагент";
		Запрос.УстановитьПараметр("ОтчетКомиссионераОПродажах", ДокументОснование);
		Запрос.УстановитьПараметр("СчетФактура", СчетФактура);

		Выборка = Запрос.Выполнить().Выбрать(); 
		Если Выборка.Следующий() Тогда
			ДанныеШапки.Вставить("Комиссионер", Выборка.Контрагент);
		КонецЕсли;
	КонецЕсли;

	Если ДанныеШапки.Свойство("Комиссионер")
		И ЗначениеЗаполнено(ДанныеШапки.Комиссионер) Тогда
		СведенияОКомиссионере = ПолучитьДанныеЮрФизЛица(ДанныеШапки.Комиссионер, ДанныеШапки.Дата);
		ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, СведенияОКомиссионере, "СведенияОКомиссионере", ВидыАдресов().Юридический, ДанныеШапки.Дата);
		Если ДанныеШапки.Свойство("ПредставлениеКомиссионера") И ЗначениеЗаполнено(ДанныеШапки.ПредставлениеКомиссионера) Тогда
			#Удаление
			ДобавитьДопополнительныеДанныеВДерево(ДеревоДанных, "ДополнительныеСведенияОКомиссионере",
			#КонецУдаления
			#Вставка
			// По-хорошему нужно в преобразовании в правилах XSL в регистре сведений указать, что нужно разбить строку 
			// идентификатора на слова, но я не знаю, как это сделать.
			ДобавитьДопополнительныеДанныеВДерево(ДеревоДанных, "Дополнительные сведения о комиссионере",

			#КонецВставки
			ДанныеШапки.ПредставлениеКомиссионера, ПутьВДереве);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
