
&НаСервере
Функция СформироватьОтчетНаСервере()
	
	ТЗИтоговая1Ур  = Новый ТаблицаЗначений;
	ТЗИтоговая1Ур.Колонки.Добавить("Контрагент");
	ТЗИтоговая1Ур.Колонки.Добавить("ОбщаяВыручка");
	ТЗИтоговая1Ур.Колонки.Добавить("ОбщийПрофит");
	ТЗИтоговая1Ур.Колонки.Добавить("ДоляВыручкиОбщая");
	ТЗИтоговая1Ур.Колонки.Добавить("ДоляПрофитаОбщая");
	ТЗИтоговая1Ур.Колонки.Добавить("ВыручкаОбщаяЗаВесьПериод");
	ТЗИтоговая1Ур.Колонки.Добавить("ПрофитОбщийЗаВесьПериод");
	
	ТЗИтоговаяОбщая = Новый ТаблицаЗначений; 
	
	ТекстСверткиСуммированияТЗИтоговая = "ОбщаяВыручка, ОбщийПрофит, ДоляВыручкиОбщая, ДоляПрофитаОбщая";
	
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&ДН, ГОД) КАК Период
	|ИТОГИ ПО
	|	Период ПЕРИОДАМИ(ГОД, &ДН, &ДК)";
	З.УстановитьПараметр("ДН", ЭтотОбъект.ПериодОтчета.ДатаНачала);
	З.УстановитьПараметр("ДК", ЭтотОбъект.ПериодОтчета.ДатаОкончания);
	
	Выб = З.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ"); 
	
	ТЗГода = Новый ТаблицаЗначений;
	
	ТЗГода.Колонки.Добавить("Год");
	ТЗГода.Колонки.Добавить("ОбщаяВыручка");
	ТЗГода.Колонки.Добавить("ОбщийПрофит");
	
	Пока Выб.Следующий() Цикл
		
		СтрТЗ = ТЗГода.Добавить();
		СтрТЗ.Год = Выб.Период;
		
		Если НачалоГода(Выб.Период) < ЭтотОбъект.ПериодОтчета.ДатаНачала Тогда
			
			НачПериода = ЭтотОбъект.ПериодОтчета.ДатаНачала;
			
		Иначе
			
			НачПериода = НачалоГода(Выб.Период);
			
		КонецЕсли;
		
		Если КонецГода(Выб.Период) > ЭтотОбъект.ПериодОтчета.ДатаОкончания Тогда
			
			КонПериода = ЭтотОбъект.ПериодОтчета.ДатаОкончания;
			
		Иначе
			
			КонПериода = КонецГода(Выб.Период);
			
		КонецЕсли;
		
		Счета76 = Новый СписокЗначений;
		
		ЗапросПоСчету = Новый Запрос;
		ЗапросПоСчету.Текст = "
		|ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Код ПОДОБНО ""76%""
		|";
		
		Результат = ЗапросПоСчету.Выполнить();
		ВыборкаСчета = Результат.Выбрать();
		
		Пока ВыборкаСчета.Следующий() Цикл
			
			Счета76.Добавить(ВыборкаСчета.Ссылка); 
			
		КонецЦикла;
		
		ЗапросОбщий = Новый Запрос;
		
		ЗапросОбщий.Текст = "ВЫБРАТЬ
		|	ДокСделка.Ссылка КАК Ссылка,
		|	СчетНаОплатуПокупателю.СуммаДокумента * СчетНаОплатуПокупателю.КурсВзаиморасчетов / СчетНаОплатуПокупателю.КратностьВзаиморасчетов КАК ИсходящаяСумма,
		|	0 КАК ВходящаяСумма
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	Документ.Сделка КАК ДокСделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|		ПО (СчетНаОплатуПокупателю.Сделка = ДокСделка.Ссылка)
		|ГДЕ
		|	ДокСделка.Проведен = ИСТИНА
		|	И ДокСделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокСделка.Ссылка,
		|	СчетНаОплатуПокупателю.СуммаДокумента * СчетНаОплатуПокупателю.КурсВзаиморасчетов / СчетНаОплатуПокупателю.КратностьВзаиморасчетов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокСделка.Ссылка,
		|	0,
		|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.СуммаРаспределения
		|ИЗ
		|	Документ.Сделка КАК ДокСделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги
		|		ПО ДокСделка.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Сделка
		|			И (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка.Проведен = ИСТИНА)
		|ГДЕ
		|	ДокСделка.Проведен = ИСТИНА
		|	И ДокСделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода 
		|	И НЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка.СчетУчетаРасчетовСКонтрагентом В (&Счета76)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.СуммаРаспределения,
		|	ДокСделка.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|
		|ВЫБРАТЬ
		|	ДокСделка.Ссылка,
		|	0,
		|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения
		|ИЗ
		|	Документ.Сделка КАК ДокСделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
		|		ПО ДокСделка.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка
		|			И (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА)
		|ГДЕ
		|	ДокСделка.Проведен = ИСТИНА
		|	И ДокСделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода  
		|	И НЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетУчетаРасчетовСКонтрагентом В (&Счета76)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения,
		|	ДокСделка.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Услуги.ИсходящаяСумма) КАК Выручка,
		|	СУММА(ВТ_Услуги.ИсходящаяСумма - ВТ_Услуги.ВходящаяСумма) КАК Профит
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|ГДЕ
		|	(ВТ_Услуги.ИсходящаяСумма <> 0
		|			ИЛИ ВТ_Услуги.ВходящаяСумма <> 0)";
		
		ЗапросОбщий.УстановитьПараметр("НачалоПериода", НачПериода);
		ЗапросОбщий.УстановитьПараметр("КонецПериода", КонПериода); 
		ЗапросОбщий.УстановитьПараметр("Счета76", Счета76);
		
		ВыборкаОбщая = ЗапросОбщий.Выполнить().Выбрать();
		
		Если ВыборкаОбщая.Следующий() Тогда
			
			ВыручкаОбщая = ВыборкаОбщая.Выручка;
			ПрофитОбщий = ВыборкаОбщая.Профит;
			
		Иначе
			
			ВыручкаОбщая = 0;
			ПрофитОбщий = 0;
			
		КонецЕсли;  
		
		СтрТЗ.ОбщаяВыручка = ВыручкаОбщая;
		СтрТЗ.ОбщийПрофит = ПрофитОбщий;
		
	КонецЦикла;
	
	ТЗИтогиСначала = ТЗГода.Скопировать(,"ОбщаяВыручка,ОбщийПрофит");
	
	ТЗИтогиСначала.Свернуть(,"ОбщаяВыручка,ОбщийПрофит");
	
	Для Каждого СтрТЗГода Из ТЗГода Цикл
		
		ТЗИтоговая1Ур.Колонки.Добавить("Выручка" + Формат(Год(СтрТЗГода.Год),"ЧГ="));
		ТЗИтоговая1Ур.Колонки.Добавить("Профит" + Формат(Год(СтрТЗГода.Год),"ЧГ="));
		ТЗИтоговая1Ур.Колонки.Добавить("ДоляВыручки" + Формат(Год(СтрТЗГода.Год),"ЧГ="));
		ТЗИтоговая1Ур.Колонки.Добавить("ДоляПрофита" + Формат(Год(СтрТЗГода.Год),"ЧГ="));
		
		ТекстСверткиСуммированияТЗИтоговая = ТекстСверткиСуммированияТЗИтоговая + ",Выручка" + Формат(Год(СтрТЗГода.Год),"ЧГ=") 
		+ ",Профит" + Формат(Год(СтрТЗГода.Год),"ЧГ=") + ",ДоляВыручки" + Формат(Год(СтрТЗГода.Год),"ЧГ=") + ",ДоляПрофита" + Формат(Год(СтрТЗГода.Год),"ЧГ="); 
		
		Если НачалоГода(СтрТЗГода.Год) < ЭтотОбъект.ПериодОтчета.ДатаНачала Тогда
			
			НачПериода = ЭтотОбъект.ПериодОтчета.ДатаНачала;
			
		Иначе
			
			НачПериода = НачалоГода(СтрТЗГода.Год);
			
		КонецЕсли;
		
		Если КонецГода(СтрТЗГода.Год) > ЭтотОбъект.ПериодОтчета.ДатаОкончания Тогда
			
			КонПериода = ЭтотОбъект.ПериодОтчета.ДатаОкончания;
			
		Иначе
			
			КонПериода = КонецГода(СтрТЗГода.Год);
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДокСделка.Ссылка КАК Сделка,
		               |	ЕСТЬNULL(КорректировкаРеализации.СуммаДокумента, ЕСТЬNULL(РеализацияТоваровУслуг.СуммаДокумента * РеализацияТоваровУслуг.КурсВзаиморасчетов / РеализацияТоваровУслуг.КратностьВзаиморасчетов, 0)) КАК ИсходящаяСумма,
		               |	0 КАК ВходящаяСумма,
		               |	РеализацияТоваровУслуг.Ссылка КАК Реализация
		               |ПОМЕСТИТЬ ВТ_Услуги
		               |ИЗ
		               |	Документ.Сделка КАК ДокСделка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
		               |			ПО РеализацияТоваровУслуг.Ссылка = КорректировкаРеализации.ДокументРеализации
		               |		ПО ДокСделка.Ссылка = РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Сделка
		               |ГДЕ
		               |	ДокСделка.Проведен = ИСТИНА
		               |	И ДокСделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И НЕ РеализацияТоваровУслуг.СчетУчетаРасчетовСКонтрагентом В (&Счета76)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДокСделка.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	ЕСТЬNULL(КорректировкаРеализации.СуммаДокумента, ЕСТЬNULL(РеализацияТоваровУслуг.СуммаДокумента * РеализацияТоваровУслуг.КурсВзаиморасчетов / РеализацияТоваровУслуг.КратностьВзаиморасчетов, 0))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ДокСделка.Ссылка,
		               |	0,
		               |	ЕСТЬNULL(КорректировкаПоступленияУслуги.Сумма, ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка.КратностьВзаиморасчетов, 0)),
		               |	NULL
		               |ИЗ
		               |	Документ.Сделка КАК ДокСделка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
		               |			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка = КорректировкаПоступленияУслуги.Ссылка.ДокументПоступления
		               |		ПО ДокСделка.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Сделка
		               |			И (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка.Проведен = ИСТИНА)
		               |ГДЕ
		               |	ДокСделка.Проведен = ИСТИНА
		               |	И ДокСделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И НЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка.СчетУчетаРасчетовСКонтрагентом В (&Счета76)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДокСделка.Ссылка,
		               |	ЕСТЬNULL(КорректировкаПоступленияУслуги.Сумма, ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамУслуги.Ссылка.КратностьВзаиморасчетов, 0))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ДокСделка.Ссылка,
		               |	0,
		               |	ЕСТЬNULL(КорректировкаПоступленияТовары.Сумма, ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)),
		               |	NULL
		               |ИЗ
		               |	Документ.Сделка КАК ДокСделка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
		               |			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = КорректировкаПоступленияТовары.Ссылка.ДокументПоступления
		               |		ПО ДокСделка.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка
		               |			И (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА)
		               |ГДЕ
		               |	ДокСделка.Проведен = ИСТИНА
		               |	И ДокСделка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И НЕ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетУчетаРасчетовСКонтрагентом В (&Счета76)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДокСделка.Ссылка,
		               |	ЕСТЬNULL(КорректировкаПоступленияТовары.Сумма, ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТ_Услуги.ИсходящаяСумма) КАК Выручка,
		               |	СУММА(ВТ_Услуги.ИсходящаяСумма - ВТ_Услуги.ВходящаяСумма) КАК Профит,
		               |	ВТ_Услуги.Сделка.Контрагент КАК Контрагент,
		               |	ВТ_Услуги.Сделка КАК Сделка,
		               |	ВТ_Услуги.Реализация КАК Реализация
		               |ИЗ
		               |	ВТ_Услуги КАК ВТ_Услуги
		               |ГДЕ
		               |	(ВТ_Услуги.ИсходящаяСумма <> 0
		               |			ИЛИ ВТ_Услуги.ВходящаяСумма <> 0)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Услуги.Сделка.Контрагент,
		               |	ВТ_Услуги.Сделка,
		               |	ВТ_Услуги.Реализация"; 
		
		Запрос.УстановитьПараметр("НачалоПериода", НачПериода);
		Запрос.УстановитьПараметр("КонецПериода", КонПериода);   
		Запрос.УстановитьПараметр("Счета76", Счета76);
			
		Выборка = Запрос.Выполнить().Выгрузить();
		
		
		
		
		
		
		Для Каждого КолонкаТЗИтоговая1Ур Из ТЗИтоговая1Ур.Колонки Цикл
			
			Попытка	
				
				КолонкаТЗИтоговаяОбщая = ТЗИтоговаяОбщая.Колонки.Добавить();
				
				ЗаполнитьЗначенияСвойств(КолонкаТЗИтоговаяОбщая, КолонкаТЗИтоговая1Ур); 
				
			Исключение
			КонецПопытки;
			
		КонецЦикла;
		
		Попытка	
			
			ТЗИтоговаяОбщая.Колонки.Добавить("Сделка");
			ТЗИтоговаяОбщая.Колонки.Добавить("Реализация");
			
		Исключение
		КонецПопытки;
		
		Для Каждого СтрВыборка Из Выборка Цикл
			
			СтрТЗИтоговая = ТЗИтоговая1Ур.Добавить();
			
			СтрТЗИтоговая.Контрагент = СтрВыборка.Контрагент;
			СтрТЗИтоговая["Выручка" + Формат(Год(СтрТЗГода.Год),"ЧГ=")] = СтрВыборка.Выручка;
			СтрТЗИтоговая["Профит" + Формат(Год(СтрТЗГода.Год),"ЧГ=")] = СтрВыборка.Профит;
			СтрТЗИтоговая["ДоляВыручки" + Формат(Год(СтрТЗГода.Год),"ЧГ=")] = СтрВыборка.Выручка / СтрТЗГода.ОбщаяВыручка * 100;
			СтрТЗИтоговая["ДоляПрофита" + Формат(Год(СтрТЗГода.Год),"ЧГ=")] = СтрВыборка.Профит / СтрТЗГода.ОбщийПрофит * 100;
			СтрТЗИтоговая.ОбщаяВыручка = СтрВыборка.Выручка;
			СтрТЗИтоговая.ОбщийПрофит = СтрВыборка.Профит;
			СтрТЗИтоговая.ВыручкаОбщаяЗаВесьПериод = ТЗИтогиСначала[0].ОбщаяВыручка;
			СтрТЗИтоговая.ПрофитОбщийЗаВесьПериод = ТЗИтогиСначала[0].ОбщийПрофит;
			
			СтрТЗИтоговая = ТЗИтоговаяОбщая.Добавить();
			
			СтрТЗИтоговая.Контрагент = СтрВыборка.Контрагент;
			СтрТЗИтоговая.Сделка = СтрВыборка.Сделка;
			СтрТЗИтоговая.Реализация = СтрВыборка.Реализация;
			СтрТЗИтоговая["Выручка" + Формат(Год(СтрТЗГода.Год),"ЧГ=")] = СтрВыборка.Выручка;
			СтрТЗИтоговая["Профит" + Формат(Год(СтрТЗГода.Год),"ЧГ=")] = СтрВыборка.Профит;
			СтрТЗИтоговая["ДоляВыручки" + Формат(Год(СтрТЗГода.Год),"ЧГ=")] = СтрВыборка.Выручка / СтрТЗГода.ОбщаяВыручка * 100;
			СтрТЗИтоговая["ДоляПрофита" + Формат(Год(СтрТЗГода.Год),"ЧГ=")] = СтрВыборка.Профит / СтрТЗГода.ОбщийПрофит * 100;
			СтрТЗИтоговая.ОбщаяВыручка = СтрВыборка.Выручка;
			СтрТЗИтоговая.ОбщийПрофит = СтрВыборка.Профит;
			СтрТЗИтоговая.ВыручкаОбщаяЗаВесьПериод = ТЗИтогиСначала[0].ОбщаяВыручка;
			СтрТЗИтоговая.ПрофитОбщийЗаВесьПериод = ТЗИтогиСначала[0].ОбщийПрофит; 
			
			
			////Если нужно убрать пустые колонки в реализации   
			
			//Если СтрТЗИтоговая.Реализация=Null Тогда  
			//	ТЗИтоговаяОбщая.Удалить(СтрТЗИтоговая);    
			//КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;    
	
	ТЗИтоговая1Ур.Свернуть("Контрагент, ВыручкаОбщаяЗаВесьПериод, ПрофитОбщийЗаВесьПериод", ТекстСверткиСуммированияТЗИтоговая);
	
	ТЗИтоги = ТЗИтоговая1Ур.Скопировать(, ТекстСверткиСуммированияТЗИтоговая);
	
	ТЗИтоги.Свернуть(, ТекстСверткиСуммированияТЗИтоговая);
	
	МассивКолонокВыручки = Новый Массив;
	МассивКолонокПрофита = Новый Массив;
	МассивКолонокДоляВыручки = Новый Массив;
	МассивКолонокДоляПрофита = Новый Массив;
	
	Для Каждого СтрКолонок Из ТЗИтоговая1Ур.Колонки Цикл 
		
		Если Лев(СтрКолонок.Имя, СтрДлина(СтрКолонок.Имя) - 4)  = "Выручка" Тогда
			
			МассивКолонокВыручки.Добавить(СтрКолонок.Имя);
			
		ИначеЕсли Лев(СтрКолонок.Имя, СтрДлина(СтрКолонок.Имя) - 4)  = "Профит" Тогда
			
			МассивКолонокПрофита.Добавить(СтрКолонок.Имя);
			
		ИначеЕсли Лев(СтрКолонок.Имя, СтрДлина(СтрКолонок.Имя) - 4)  = "ДоляВыручки" Тогда
			
			МассивКолонокДоляВыручки.Добавить(СтрКолонок.Имя);
			
		ИначеЕсли Лев(СтрКолонок.Имя, СтрДлина(СтрКолонок.Имя) - 4)  = "ДоляПрофита" Тогда
			
			МассивКолонокДоляПрофита.Добавить(СтрКолонок.Имя);
			
		КонецЕсли;
		
	КонецЦикла;   
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	Макет = Обработки.СводкаПоВыручкеИПрофитамПоКлиентам.ПолучитьМакет("Макет");
	
	НомерПП = 2;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерПП");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Контрагент");
	ТабличныйДокумент.Присоединить(ОбластьМакета);
	
	Для Каждого Стр Из МассивКолонокВыручки Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|ВыручкаГод");
		ОбластьМакета.Параметры.Год = Прав(Стр, 4);
		ТабличныйДокумент.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|ОбщаяВыручка");
	ТабличныйДокумент.Присоединить(ОбластьМакета);
	
	Для Каждого Стр Из МассивКолонокПрофита Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|ПрофитГод");
		ОбластьМакета.Параметры.Год = Прав(Стр, 4);
		ТабличныйДокумент.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|ОбщийПрофит");
	ТабличныйДокумент.Присоединить(ОбластьМакета);
	
	Для Каждого Стр Из МассивКолонокДоляВыручки Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|ДоляВыручкиГод");
		ОбластьМакета.Параметры.Год = Прав(Стр, 4);
		ТабличныйДокумент.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|ОбщаяДоляВыручки");
	ТабличныйДокумент.Присоединить(ОбластьМакета);
	
	Для Каждого Стр Из МассивКолонокПрофита Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|ДоляПрофитаГод");
		ОбластьМакета.Параметры.Год = Прав(Стр, 4);
		ТабличныйДокумент.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|ОбщаяДоляПрофита");
	ТабличныйДокумент.Присоединить(ОбластьМакета);
	
	Для Каждого СтрТЗИтоги Из ТЗИтоги Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|НомерПП");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|Контрагент");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		Для Каждого Стр Из МассивКолонокВыручки Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|ВыручкаГод");
			ОбластьМакета.Параметры.ОбщаяВыручкаГод = СтрТЗИтоги["Выручка" + Прав(Стр, 4)];
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|ОбщаяВыручка");
		ОбластьМакета.Параметры.ОбщаяВыручка = СтрТЗИтоги.ОбщаяВыручка;
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		Для Каждого Стр Из МассивКолонокПрофита Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|ПрофитГод");
			ОбластьМакета.Параметры.ОбщийПрофитГод = СтрТЗИтоги["Профит" + Прав(Стр, 4)];
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|ОбщийПрофит");
		ОбластьМакета.Параметры.ОбщийПрофит = СтрТЗИтоги.ОбщийПрофит;
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		Для Каждого Стр Из МассивКолонокДоляВыручки Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|ДоляВыручкиГод");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|ОбщаяДоляВыручки");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		Для Каждого Стр Из МассивКолонокПрофита Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|ДоляПрофитаГод");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрИтоги|ОбщаяДоляПрофита");
		ТабличныйДокумент.Присоединить(ОбластьМакета);  	
		
		Для Каждого СтрТЗ Из ТЗИтоговая1Ур Цикл 
			
			// Начинаем группу для контрагента
			ТабличныйДокумент.НачатьГруппуСтрок("Контрагент",Истина);
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|НомерПП");
			ОбластьМакета.Параметры.НомерПП = НомерПП;
			ТабличныйДокумент.Вывести(ОбластьМакета,1); 
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|Контрагент");
			ОбластьМакета.Параметры.Контрагент = СтрТЗ.Контрагент;
			
			ДанныеПервыхПовторныхСделок = ПолучитьДанныеПервыхПовторныхСделокПоКонтрагенту(СтрТЗ.Контрагент);
			ОбластьМакета.Параметры.Заполнить(ДанныеПервыхПовторныхСделок);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			Для Каждого Стр Из МассивКолонокВыручки Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|ВыручкаГод");
				ОбластьМакета.Параметры.ВыручкаГод = СтрТЗ["Выручка" + Прав(Стр, 4)];
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|ОбщаяВыручка");
			ОбластьМакета.Параметры.ОбщаяВыручка = СтрТЗ.ОбщаяВыручка;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			Для Каждого Стр Из МассивКолонокПрофита Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|ПрофитГод");
				ОбластьМакета.Параметры.ПрофитГод = СтрТЗ["Профит" + Прав(Стр, 4)];
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|ОбщийПрофит");
			ОбластьМакета.Параметры.ОбщийПрофит = СтрТЗ.ОбщийПрофит;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			Для Каждого Стр Из МассивКолонокДоляВыручки Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|ДоляВыручкиГод");
				ОбластьМакета.Параметры.ДоляВыручкиГод = СтрТЗ["ДоляВыручки" + Прав(Стр, 4)];
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|ОбщаяДоляВыручки");
			ОбластьМакета.Параметры.ДоляВыручкиОбщая = СтрТЗ.ОбщаяВыручка / СтрТЗ.ВыручкаОбщаяЗаВесьПериод * 100;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			Для Каждого Стр Из МассивКолонокПрофита Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|ДоляПрофитаГод");
				ОбластьМакета.Параметры.ДоляПрофитаГод = СтрТЗ["ДоляПрофита" + Прав(Стр, 4)];
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрТЧ|ОбщаяДоляПрофита");
			ОбластьМакета.Параметры.ДоляПрофитаОбщая = СтрТЗ.ОбщийПрофит / СтрТЗ.ПрофитОбщийЗаВесьПериод * 100;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			// Начинаем группу для сделок контрагента
			ТабличныйДокумент.НачатьГруппуСтрок("Сделки"+ " "+ СтрТЗ.Контрагент, Истина);
			
			ПараметрыОтбора2Ур = Новый Структура;
			ПараметрыОтбора2Ур.Вставить("Контрагент", СтрТЗ.Контрагент);
			НайденныеСтроки2Ур = ТЗИтоговаяОбщая.НайтиСтроки(ПараметрыОтбора2Ур);
			
			ТЗИтоговая2Ур = Новый ТаблицаЗначений;
			Для Каждого КолонкаТЗИтоговаяОбщая Из ТЗИтоговаяОбщая.Колонки Цикл
				КолонкаТЗИтоговая2Ур = ТЗИтоговая2Ур.Колонки.Добавить();
				ЗаполнитьЗначенияСвойств(КолонкаТЗИтоговая2Ур, КолонкаТЗИтоговаяОбщая);
			КонецЦикла;
			
			Для Каждого НайденнаяСтрока2Ур Из НайденныеСтроки2Ур Цикл
				СтрТЗИтоговая2Ур = ТЗИтоговая2Ур.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТЗИтоговая2Ур, НайденнаяСтрока2Ур);
			КонецЦикла;
			
			ТЗИтоговая2Ур.Свернуть("Сделка, ВыручкаОбщаяЗаВесьПериод, ПрофитОбщийЗаВесьПериод", ТекстСверткиСуммированияТЗИтоговая);
			
			Для Каждого СтрТЗИтоговая2Ур ИЗ ТЗИтоговая2Ур Цикл  
				
				
				ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|НомерПП");
				ОбластьМакета2Ур.Параметры.НомерПП = "";
				ТабличныйДокумент.Вывести(ОбластьМакета2Ур, 2);
				
				ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|Контрагент");
				ОбластьМакета2Ур.Параметры.Контрагент = СтрТЗИтоговая2Ур.Сделка;
				ТабличныйДокумент.Присоединить(ОбластьМакета2Ур);
				
				Для Каждого Стр Из МассивКолонокВыручки Цикл
					ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|ВыручкаГод");
					ОбластьМакета2Ур.Параметры.ВыручкаГод = СтрТЗИтоговая2Ур["Выручка" + Прав(Стр, 4)];
					ТабличныйДокумент.Присоединить(ОбластьМакета2Ур);
				КонецЦикла;
				
				ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|ОбщаяВыручка");
				ОбластьМакета2Ур.Параметры.ОбщаяВыручка = СтрТЗИтоговая2Ур.ОбщаяВыручка;
				ТабличныйДокумент.Присоединить(ОбластьМакета2Ур);
				
				Для Каждого Стр Из МассивКолонокПрофита Цикл
					ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|ПрофитГод");
					ОбластьМакета2Ур.Параметры.ПрофитГод = СтрТЗИтоговая2Ур["Профит" + Прав(Стр, 4)];
					ТабличныйДокумент.Присоединить(ОбластьМакета2Ур);
				КонецЦикла;
				
				ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|ОбщийПрофит");
				ОбластьМакета2Ур.Параметры.ОбщийПрофит = СтрТЗИтоговая2Ур.ОбщийПрофит;
				ТабличныйДокумент.Присоединить(ОбластьМакета2Ур);
				
				Для Каждого Стр Из МассивКолонокДоляВыручки Цикл
					ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|ДоляВыручкиГод");
					ОбластьМакета2Ур.Параметры.ДоляВыручкиГод = СтрТЗИтоговая2Ур["ДоляВыручки" + Прав(Стр, 4)];
					ТабличныйДокумент.Присоединить(ОбластьМакета2Ур);
				КонецЦикла;
				
				ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|ОбщаяДоляВыручки");
				ОбластьМакета2Ур.Параметры.ДоляВыручкиОбщая = СтрТЗИтоговая2Ур.ОбщаяВыручка / СтрТЗИтоговая2Ур.ВыручкаОбщаяЗаВесьПериод * 100;
				ТабличныйДокумент.Присоединить(ОбластьМакета2Ур);
				
				Для Каждого Стр Из МассивКолонокПрофита Цикл
					ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|ДоляПрофитаГод");
					ОбластьМакета2Ур.Параметры.ДоляПрофитаГод = СтрТЗИтоговая2Ур["ДоляПрофита" + Прав(Стр, 4)];
					ТабличныйДокумент.Присоединить(ОбластьМакета2Ур);
				КонецЦикла;
				
				ОбластьМакета2Ур = Макет.ПолучитьОбласть("СтрТЧ|ОбщаяДоляПрофита");
				ОбластьМакета2Ур.Параметры.ДоляПрофитаОбщая = СтрТЗИтоговая2Ур.ОбщийПрофит / СтрТЗИтоговая2Ур.ПрофитОбщийЗаВесьПериод * 100;
				ТабличныйДокумент.Присоединить(ОбластьМакета2Ур);    
				
				// Начинаем группу для реализаций сделки
				ТабличныйДокумент.НачатьГруппуСтрок("Реализации" +" "+ СтрТЗИтоговая2Ур.Сделка, Истина);
				
				ПараметрыОтбора3Ур = Новый Структура;
				ПараметрыОтбора3Ур.Вставить("Сделка", СтрТЗИтоговая2Ур.Сделка);
				НайденныеСтроки3Ур = ТЗИтоговаяОбщая.НайтиСтроки(ПараметрыОтбора3Ур);
				
				ТЗИтоговая3Ур = Новый ТаблицаЗначений;
				Для Каждого КолонкаТЗИтоговаяОбщая Из ТЗИтоговаяОбщая.Колонки Цикл
					КолонкаТЗИтоговая3Ур = ТЗИтоговая3Ур.Колонки.Добавить();
					ЗаполнитьЗначенияСвойств(КолонкаТЗИтоговая3Ур, КолонкаТЗИтоговаяОбщая);   
					
				КонецЦикла;
				
				МассивИндексов = Новый Массив;
				
				Для Каждого НайденнаяСтрока3Ур Из НайденныеСтроки3Ур Цикл  
					
					СтрТЗИтоговая3Ур = ТЗИтоговая3Ур.Добавить();
					ЗаполнитьЗначенияСвойств(СтрТЗИтоговая3Ур, НайденнаяСтрока3Ур); 
				КонецЦикла;  
				
				ТЗИтоговая3Ур.Свернуть("Реализация, ВыручкаОбщаяЗаВесьПериод, ПрофитОбщийЗаВесьПериод", ТекстСверткиСуммированияТЗИтоговая);
				
				Для Каждого СтрТЗИтоговая3Ур ИЗ ТЗИтоговая3Ур Цикл 
					
					ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|НомерПП");
					ОбластьМакета3Ур.Параметры.НомерПП = "";
					ТабличныйДокумент.Вывести(ОбластьМакета3Ур, 3);
					
					ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|Контрагент");
					ОбластьМакета3Ур.Параметры.Контрагент = СтрТЗИтоговая3Ур.Реализация;
					ТабличныйДокумент.Присоединить(ОбластьМакета3Ур);
					
					Для Каждого Стр Из МассивКолонокВыручки Цикл
						ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|ВыручкаГод");
						ОбластьМакета3Ур.Параметры.ВыручкаГод = СтрТЗИтоговая3Ур["Выручка" + Прав(Стр, 4)];
						ТабличныйДокумент.Присоединить(ОбластьМакета3Ур);
					КонецЦикла;
					
					ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|ОбщаяВыручка");
					ОбластьМакета3Ур.Параметры.ОбщаяВыручка = СтрТЗИтоговая3Ур.ОбщаяВыручка;
					ТабличныйДокумент.Присоединить(ОбластьМакета3Ур);
					
					Для Каждого Стр Из МассивКолонокПрофита Цикл
						ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|ПрофитГод");
						ОбластьМакета3Ур.Параметры.ПрофитГод = СтрТЗИтоговая3Ур["Профит" + Прав(Стр, 4)];
						ТабличныйДокумент.Присоединить(ОбластьМакета3Ур);
					КонецЦикла;
					
					ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|ОбщийПрофит");
					ОбластьМакета3Ур.Параметры.ОбщийПрофит = СтрТЗИтоговая3Ур.ОбщийПрофит;
					ТабличныйДокумент.Присоединить(ОбластьМакета3Ур);
					
					Для Каждого Стр Из МассивКолонокДоляВыручки Цикл
						ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|ДоляВыручкиГод");
						ОбластьМакета3Ур.Параметры.ДоляВыручкиГод = СтрТЗИтоговая3Ур["ДоляВыручки" + Прав(Стр, 4)];
						ТабличныйДокумент.Присоединить(ОбластьМакета3Ур);
					КонецЦикла;
					
					ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|ОбщаяДоляВыручки");
					ОбластьМакета3Ур.Параметры.ДоляВыручкиОбщая = СтрТЗИтоговая3Ур.ОбщаяВыручка / СтрТЗИтоговая3Ур.ВыручкаОбщаяЗаВесьПериод * 100;
					ТабличныйДокумент.Присоединить(ОбластьМакета3Ур);
					
					Для Каждого Стр Из МассивКолонокПрофита Цикл
						ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|ДоляПрофитаГод");
						ОбластьМакета3Ур.Параметры.ДоляПрофитаГод = СтрТЗИтоговая3Ур["ДоляПрофита" + Прав(Стр, 4)];
						ТабличныйДокумент.Присоединить(ОбластьМакета3Ур);
					КонецЦикла;
					
					ОбластьМакета3Ур = Макет.ПолучитьОбласть("СтрТЧ|ОбщаяДоляПрофита");
					ОбластьМакета3Ур.Параметры.ДоляПрофитаОбщая = СтрТЗИтоговая3Ур.ОбщийПрофит / СтрТЗИтоговая3Ур.ПрофитОбщийЗаВесьПериод * 100;
					ТабличныйДокумент.Присоединить(ОбластьМакета3Ур);
										
				КонецЦикла; 
				
					// Закрытие реализаций
				ТабличныйДокумент.ЗакончитьГруппуСтрок();
				
			КонецЦикла;
						
			// Закрытие сделок
			ТабличныйДокумент.ЗакончитьГруппуСтрок(); 
			НомерПП = НомерПП + 1;
			
		КонецЦикла;  
		
	КонецЦикла;     
	
	ТабличныйДокумент.ФиксацияСверху = 1;
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеПервыхПовторныхСделокПоКонтрагенту(Контрагент) 
	
	Структура = Новый Структура;
	
	Структура.Вставить("ПерваяСделка","");
	Структура.Вставить("ПовторнаяСделка","");
	Структура.Вставить("БезПовторныхСделок90Дней","");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сделка.Дата КАК Дата
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.Контрагент = &Контрагент
	|	И Сделка.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка.Дата
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	ПервыйПроход = Истина;
	
	ВторойПроход = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		
		Если ПервыйПроход Тогда
			
			Структура.Вставить("ПерваяСделка",Формат(Выборка.Дата,"ДФ=dd.MM.yy"));
			
			ПервыйПроход = Ложь;
			
		ИначеЕсли ВторойПроход Тогда
			
			Структура.Вставить("ПовторнаяСделка",Формат(Выборка.Дата,"ДФ=dd.MM.yy"));	
			
			ВторойПроход = Ложь;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сделка.Дата КАК Дата
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.Контрагент = &Контрагент
	|	И Сделка.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка.Дата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Если (Выборка.Дата + 86400 * 90) < ТекущаяДата() Тогда
			
			Структура.Вставить("БезПовторныхСделок90Дней",Формат(Выборка.Дата,"ДФ=dd.MM.yy"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда) 
	
	Если ЗначениеЗаполнено(ПериодОтчета.ДатаНачала) И ЗначениеЗаполнено(ПериодОтчета.ДатаОкончания) Тогда
		
		Если ПериодОтчета.ДатаНачала <= ПериодОтчета.ДатаОкончания Тогда
			
			КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("СводкаПоВыручкеИПрофитамПоКлиентам");    
			// Добавляем в коллекцию (тип массив) сформированный Табличный документ
			КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьОтчетНаСервере(); 
			// если требуется устанавливаем параметры печати
			КоллекцияПечатныхФорм[0].СинонимМакета = "Сводка по выручке и профитам по клиентам";
			
			КоллекцияПечатныхФорм[0].Экземпляров = 1;
			
			УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);  
			
		Иначе 
			
			Сообщить("Невозможно вывести отчет: конец периода должен быть больше начала периода");  
			
		КонецЕсли; 
		
	Иначе
		
		Сообщить("Невозможно вывести отчет: период должен быть заполнен");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ПериодОтчета.ДатаНачала = НачалоГода(ТекущаяДата());
	ЭтотОбъект.ПериодОтчета.ДатаОкончания = КонецГода(ТекущаяДата());
	
КонецПроцедуры
