
&После("УстановкаПараметровСеанса")
Процедура ЛГС_УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Для Каждого РольПользователя Из ТекПользователь.Роли Цикл
		Если РольПользователя.Имя = "ЛогистикаВнешнийПользовательКлиент"  Тогда
			
			НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
			СоставФорм = Новый СоставФормНачальнойСтраницы;
			СоставФорм.ЛеваяКолонка.Добавить("Документ.Сделка.Форма.ФормаСпискаСделокЛК"); //описываем куда и какие формы использовать.
			НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
			// Кладем объект настроек текущему пользователю.
			ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкиНачальнойСтраницы);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
