&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрКоманды);
	
	ОбъектыПечати = Новый СписокЗначений; 
	ИмяМакета = "ЭкспедиторскаяРасписка"; 
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЭкспедиторскаяРасписка");
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Экспедиторская расписка"; 
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуЭкспедиторскаяРасписка(МассивОбъектов, ОбъектыПечати, ИмяМакета); 
	
	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуЭкспедиторскаяРасписка(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭкспедиторскаяРасписка"; 
	ТабличныйДокумент.Защита = Истина;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументЭкспедиторскаяРасписка(ТабличныйДокумент, МассивОбъектов[0]); 	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументЭкспедиторскаяРасписка(ТабДок, Док)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЭкспедиторскаяРасписка";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	|	ПоручениеЭкспедитору.Номер КАК Номер,
	|	ПоручениеЭкспедитору.Дата КАК Дата,
	|	ПоручениеЭкспедитору.Проведен КАК Проведен,
	|	ПоручениеЭкспедитору.Грузоотправитель КАК Грузоотправитель,
	|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	|	ПоручениеЭкспедитору.Грузополучатель КАК Грузополучатель,
	|	ПоручениеЭкспедитору.Договор КАК Договор,
	|	ПоручениеЭкспедитору.УведомитьСторонуОПрибытииГруза КАК УведомитьСторонуОПрибытииГруза,
	|	ПоручениеЭкспедитору.СтранаПроисхожденияГруза КАК СтранаПроисхожденияГруза,
	|	ПоручениеЭкспедитору.ТоварыГотовыеКОтправкеМестоИДата КАК ТоварыГотовыеКОтправкеМестоИДата,
	|	ПоручениеЭкспедитору.ВидТранспорта КАК ВидТранспорта,
	|	ПоручениеЭкспедитору.ПунктНазначения КАК ПунктНазначения,
	|	ПоручениеЭкспедитору.Страхование КАК Страхование,
	|	ПоручениеЭкспедитору.ТоварныйКод КАК ТоварныйКод,
	|	ПоручениеЭкспедитору.Маркировка КАК Маркировка,
	|	ПоручениеЭкспедитору.КоличествоМестВидУпаковки КАК КоличествоМестВидУпаковки,
	|	ПоручениеЭкспедитору.ВесБруттоНетто КАК ВесБруттоНетто,
	|	ПоручениеЭкспедитору.Объем КАК Объем,
	|	ПоручениеЭкспедитору.СтоимостьГруза КАК СтоимостьГруза,
	|	ПоручениеЭкспедитору.РазмерУпаковки КАК РазмерУпаковки,
	|	ПоручениеЭкспедитору.ТребуемыеДокументы КАК ТребуемыеДокументы,
	|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	|	ПоручениеЭкспедитору.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ПоручениеЭкспедитору.НеПечататьСтоимостьУслугВПоручении КАК НеПечататьСтоимостьУслугВПоручении,
	|	ПоручениеЭкспедитору.ДатаДо КАК ДатаДо
	|ИЗ
	|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	|ГДЕ
	|	ПоручениеЭкспедитору.Ссылка = &Док";
	
	Запрос.УстановитьПараметр("Док", Док);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
	
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.ЭкспедиторскаяРасписка");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		КонтИнформацияЭкспедитора = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Экспедитор,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,ТекущаяДата(),Истина);
		КонтИнформацияКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,ТекущаяДата(),Истина);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Область");
		
		ОбластьМакета.Параметры.НомерДоговора = Выборка.НомерДоговора;
		
		ОбластьМакета.Параметры.ДатаДО = Формат(Выборка.ДатаДО, "ДЛФ=ДД");
		ОбластьМакета.Параметры.Номер = Выборка.Номер;
		ОбластьМакета.Параметры.Грузоотправитель = Выборка.Грузоотправитель;
		ОбластьМакета.Параметры.Клиент = Строка(Выборка.Клиент) + " " + Строка(КонтИнформацияКлиента);
		ОбластьМакета.Параметры.Экспедитор = Строка(Выборка.Экспедитор) + " " + Строка(КонтИнформацияЭкспедитора);
		ОбластьМакета.Параметры.Страна = Выборка.СтранаПроисхожденияГруза;
		ОбластьМакета.Параметры.ТоварныйКод = Выборка.ТоварныйКод;
		ОбластьМакета.Параметры.Маркировка = Выборка.Маркировка;
		ОбластьМакета.Параметры.КоличествоМест = Выборка.КоличествоМестВидУпаковки;
		ОбластьМакета.Параметры.ВесБруттоНетто = Выборка.ВесБруттоНетто;
		ОбластьМакета.Параметры.Объем = Выборка.Объем;
		ОбластьМакета.Параметры.Стоимость = Выборка.СтоимостьГруза;
		ОбластьМакета.Параметры.РазмерУпаковки = Выборка.РазмерУпаковки;
		ОбластьМакета.Параметры.ОсобыеОтметки = Выборка.ОсобыеОтметки;
		ТабличныйДокумент.Вывести(ОбластьМакета);

	КонецЦикла;
	
	Возврат ТабличныйДокумент;		
КонецФункции  
