//&ИзменениеИКонтроль("ПриГлобальномПоиске")
//Процедура ЛГС_ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
//    #Вставка     
//	Если ЛогистикаСервер.ЕстьРоль("ЛогистикаВнешнийПользовательКлиент") Тогда
//		ПланПоиска.Очистить();
//	КонецЕсли;
//	#КонецВставки
//	// СтандартныеПодсистемы
//	#Если МобильныйКлиент Тогда
//		Выполнить("СтандартныеПодсистемыКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)");
//	#Иначе
//		СтандартныеПодсистемыКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
//	#КонецЕсли
//	// Конец СтандартныеПодсистемы
//                                              
//КонецПроцедуры


&После("ПриНачалеРаботыСистемы")
Процедура ЛГС_ПриНачалеРаботыСистемы1()
	
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы(); 
	
	ВключитьРегистрациюАктивностиПользователя();
	
КонецПроцедуры


&ИзменениеИКонтроль("ПриГлобальномПоиске")
Процедура ЛГС_ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
    #Вставка     
	Если ЛогистикаСервер.ЕстьРоль("ЛогистикаВнешнийПользовательКлиент") Тогда
		ПланПоиска.Очистить();
	КонецЕсли;
	#КонецВставки
	// СтандартныеПодсистемы
	#Если МобильныйКлиент Тогда
		Выполнить("СтандартныеПодсистемыКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)"); // Не нарушает безопасность информации, так как выполняется фиксированная строка, содержащая только вызов процедуры модуля конфигурации.
	#Иначе
		СтандартныеПодсистемыКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
	#КонецЕсли
	// Конец СтандартныеПодсистемы

КонецПроцедуры

