

&ИзменениеИКонтроль("ТоварыУслугиКПоступлениюПоСчету")
Функция ЛГС_ТоварыУслугиКПоступлениюПоСчету(СчетНаОплату, ПоступленияПоСчету, ЗаполнятьПризнакПрослеживаемости, Дата)

	ТоварыУслуги = Новый ТаблицаЗначений;
	ТоварыУслуги.Колонки.Добавить("ЭтоУслуга",     Новый ОписаниеТипов("Булево"));
	ТоварыУслуги.Колонки.Добавить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыУслуги.Колонки.Добавить("Содержание",    ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТоварыУслуги.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТоварыУслуги.Колонки.Добавить("Коэффициент",   ОбщегоНазначения.ОписаниеТипаЧисло(10, 3));
	ТоварыУслуги.Колонки.Добавить("Количество",    ОбщегоНазначения.ОписаниеТипаЧисло(10, 3));
	ТоварыУслуги.Колонки.Добавить("Цена",          ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТоварыУслуги.Колонки.Добавить("Сумма",         ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТоварыУслуги.Колонки.Добавить("СтавкаНДС",     Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТоварыУслуги.Колонки.Добавить("СуммаНДС",      ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТоварыУслуги.Колонки.Добавить("НомерГТД",      Новый ОписаниеТипов("СправочникСсылка.НомераГТД"));
	ТоварыУслуги.Колонки.Добавить("СтранаПроисхождения", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
	ТоварыУслуги.Колонки.Добавить("ОтражениеВУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ОтражениеВУСН"));
	ТоварыУслуги.Колонки.Добавить("ПрослеживаемыйТовар", Новый ОписаниеТипов("Булево"));
	ТоварыУслуги.Колонки.Добавить("ПрослеживаемыйКомплект", Новый ОписаниеТипов("Булево"));
	#Вставка	
	ТоварыУслуги.Колонки.Добавить("КлючСвязиРаспределения",    ОбщегоНазначения.ОписаниеТипаСтрока(20));
	#КонецВставки
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетНаОплату",       СчетНаОплату);
	Запрос.УстановитьПараметр("ПоступленияПоСчету", ПоступленияПоСчету);
	Запрос.УстановитьПараметр("ЗаполнятьПризнакПрослеживаемости", ЗаполнятьПризнакПрослеживаемости);

	НомераТаблиц = Новый Массив;

	Запрос.Текст = ТекстЗапросаРеквизитыСчета(НомераТаблиц) 
	+ ТекстЗапросаПоступившаяНоменклатура(НомераТаблиц)
	+ ТекстЗапросаТоварыУслугиКПоступлениюПоСчету(НомераТаблиц);

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Результат = Новый Структура;
	Для НомерТаблицы = 0 По НомераТаблиц.Количество() - 1 Цикл
		Результат.Вставить(НомераТаблиц[НомерТаблицы], РезультатЗапроса[НомерТаблицы].Выгрузить());
	КонецЦикла;

	ПоступившаяНоменклатура = Результат.ПоступившаяНоменклатура;

	РеквизитыСчета = Новый Структура("СуммаВключаетНДС,ЭтоКомиссия", Истина, Ложь);
	Если Результат.РеквизитыСчета.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыСчета, Результат.РеквизитыСчета[0]);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат.ТоварыУслуги, ТоварыУслуги);

	СписокПолейОтбора = Новый Массив;
	СписокПолейОтбора.Добавить("ЭтоУслуга, Номенклатура, Содержание, Цена");
	СписокПолейОтбора.Добавить("ЭтоУслуга, Номенклатура, Содержание");

	Если ЗаполнятьПризнакПрослеживаемости Тогда
		МассивНоменклатуры = ОбщегоНазначения.ВыгрузитьКолонку(ТоварыУслуги, "Номенклатура", Истина);
		РеквизитыНоменклатурыИзИстории = Справочники.Номенклатура.ПризнакПрослеживаемостиНаДатуИзИстории(
		МассивНоменклатуры, Дата);
	КонецЕсли;

	Для каждого ПоляОтбора Из СписокПолейОтбора Цикл

		ПолученныеПолностью = Новый Массив;

		ПоступившаяНоменклатура.Свернуть(ПоляОтбора, "Количество");
		ПоступившаяНоменклатура.Индексы.Добавить(ПоляОтбора);

		Отбор = Новый Структура(ПоляОтбора);

		Для каждого СтрокаСчета Из ТоварыУслуги Цикл

			// Если количество не указано, считаем, что услуга получается один раз.
			КоличествоВСчете = ?(СтрокаСчета.ЭтоУслуга И СтрокаСчета.Количество = 0, 1, СтрокаСчета.Количество);

			ЗаполнитьЗначенияСвойств(Отбор, СтрокаСчета);
			Если ЗаполнятьПризнакПрослеживаемости Тогда
				РеквизитыТекущейНоменклатуры = РеквизитыНоменклатурыИзИстории[СтрокаСчета.Номенклатура];
				Если РеквизитыТекущейНоменклатуры <> Неопределено Тогда
					СтрокаСчета.ПрослеживаемыйТовар = РеквизитыТекущейНоменклатуры.ПрослеживаемыйТовар
					Или РеквизитыТекущейНоменклатуры.ПрослеживаемыйКомплект;
					СтрокаСчета.ПрослеживаемыйКомплект = РеквизитыТекущейНоменклатуры.ПрослеживаемыйКомплект;
				КонецЕсли;
			КонецЕсли;

			НайденныеСтроки = ПоступившаяНоменклатура.НайтиСтроки(Отбор);

			Если НайденныеСтроки.Количество() <> 0 Тогда

				ПолученоРанее = НайденныеСтроки[0].Количество;

				Если ПолученоРанее < КоличествоВСчете Тогда
					// Товар получен частично.
					Количество = Макс(КоличествоВСчете - ПолученоРанее, 0);
					СтрокаСчета.Количество = Количество;
					ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуТабЧасти(СтрокаСчета, РеквизитыСчета.СуммаВключаетНДС);
					ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаСчета, РеквизитыСчета.СуммаВключаетНДС);
				Иначе
					ПолученныеПолностью.Добавить(СтрокаСчета);
				КонецЕсли;

				НайденныеСтроки[0].Количество = Макс(ПолученоРанее - КоличествоВСчете, 0);

			КонецЕсли;

		КонецЦикла;

		ВГраница = ПолученныеПолностью.Количество() - 1;
		Для Индекс = 0 По ВГраница Цикл
			ТоварыУслуги.Удалить(ПолученныеПолностью[ВГраница - Индекс]);
		КонецЦикла;

	КонецЦикла; 

	Если РеквизитыСчета.ЭтоКомиссия Тогда
		ТоварыУслуги.ЗаполнитьЗначения(Перечисления.ОтражениеВУСН.НеПринимаются, "ОтражениеВУСН");
	Иначе
		ТоварыУслуги.ЗаполнитьЗначения(Перечисления.ОтражениеВУСН.Принимаются, "ОтражениеВУСН");
	КонецЕсли;

	Возврат ТоварыУслуги;

КонецФункции


&ИзменениеИКонтроль("ТекстЗапросаРеквизитыСчета")
Функция ЛГС_ТекстЗапросаРеквизитыСчета(ИменаТаблиц)
	ИменаТаблиц.Добавить("ВТ_ПоступленияПоСчету");
	ИменаТаблиц.Добавить("РеквизитыСчета");
	ИменаТаблиц.Добавить("ТоварыУслуги");
	ТекстЗапроса = 
	#Удаление
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслуг.Ссылка КАК ПоступлениеТоваров,
	|	ПоступлениеТоваровУслуг.СчетНаОплатуПоставщика КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ_ПоступленияПоСчету
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В(&ПоступленияПоСчету)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыСчета.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЕСТЬNULL(РеквизитыСчета.ДоговорКонтрагента.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом) КАК ЭтоКомиссия
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК РеквизитыСчета
	|ГДЕ
	|	РеквизитыСчета.Ссылка = &СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыУслуги.Номенклатура.Услуга, ИСТИНА) КАК ЭтоУслуга,
	|	ТоварыУслуги.Номенклатура КАК Номенклатура,
	|	ТоварыУслуги.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТоварыУслуги.Номенклатура.НомерГТД КАК НомерГТД,
	|	ТоварыУслуги.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТоварыУслуги.Содержание КАК Содержание,
	|	1 КАК Коэффициент,
	|	ТоварыУслуги.Количество КАК Количество,
	|	ТоварыУслуги.Цена КАК Цена,
	|	ТоварыУслуги.Сумма КАК Сумма,
	|	ТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыУслуги.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьПризнакПрослеживаемости
	|			ТОГДА ТоварыУслуги.Номенклатура.ПрослеживаемыйТовар Или ТоварыУслуги.Номенклатура.ПрослеживаемыйКомплект 
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПрослеживаемыйТовар,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьПризнакПрослеживаемости
	|			ТОГДА ТоварыУслуги.Номенклатура.ПрослеживаемыйКомплект 
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПрослеживаемыйКомплект
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Товары КАК ТоварыУслуги
	|ГДЕ
	|	ТоварыУслуги.Ссылка = &СчетНаОплату
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыУслуги.НомерСтроки";
	#КонецУдаления
	
	#Вставка
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслуг.Ссылка КАК ПоступлениеТоваров,
	|	ПоступлениеТоваровУслуг.СчетНаОплатуПоставщика КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ_ПоступленияПоСчету
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В(&ПоступленияПоСчету)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыСчета.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЕСТЬNULL(РеквизитыСчета.ДоговорКонтрагента.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом) КАК ЭтоКомиссия
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК РеквизитыСчета
	|ГДЕ
	|	РеквизитыСчета.Ссылка = &СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыУслуги.Номенклатура.Услуга, ИСТИНА) КАК ЭтоУслуга,
	|	ТоварыУслуги.Номенклатура КАК Номенклатура,
	|	ТоварыУслуги.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТоварыУслуги.Номенклатура.НомерГТД КАК НомерГТД,
	|	ТоварыУслуги.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТоварыУслуги.Содержание КАК Содержание,
	|	1 КАК Коэффициент,
	|	ТоварыУслуги.Количество КАК Количество,
	|	ТоварыУслуги.Цена КАК Цена,
	|	ТоварыУслуги.Сумма КАК Сумма,
	|	ТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыУслуги.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьПризнакПрослеживаемости
	|			ТОГДА ТоварыУслуги.Номенклатура.ПрослеживаемыйТовар
	|					ИЛИ ТоварыУслуги.Номенклатура.ПрослеживаемыйКомплект
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПрослеживаемыйТовар,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьПризнакПрослеживаемости
	|			ТОГДА ТоварыУслуги.Номенклатура.ПрослеживаемыйКомплект
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПрослеживаемыйКомплект,
	|	ТоварыУслуги.КлючСвязиРаспределения КАК КлючСвязиРаспределения
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Товары КАК ТоварыУслуги
	|ГДЕ
	|	ТоварыУслуги.Ссылка = &СчетНаОплату
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыУслуги.НомерСтроки";
	#КонецВставки
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции

