
&ИзменениеИКонтроль("ТекстЗапросаПлатежи")
Функция ЛГС_ТекстЗапросаПлатежи(ДляКалендаря)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	|	ХозрасчетныйОстатки.Субконто3 КАК ДокументРасчетов,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма,
	|	ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт КАК ВалютнаяСумма,
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				И ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).СчетНаОплатуПоставщика <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|				И ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).СчетНаОплатуПоставщика.Проведен
	|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).СчетНаОплатуПоставщика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|	КОНЕЦ КАК СчетНаОплату
	|ПОМЕСТИТЬ ОстаткиПоДокументамРасчетовПоВсемСчетам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ГраницаОстатков,
	|			Счет В (&СчетаДолговПоДокументам),
	|			&ВидыСубконтоРасчетов,
	|			ВЫРАЗИТЬ(Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидДоговора В (&ВидыДоговоров)
	|				И ТИПЗНАЧЕНИЯ(Субконто3) В (&ТипыДокументовРасчетов)
	#Удаление
	|				И (НЕ ВЫРАЗИТЬ(Субконто2 КАК Справочник.ДоговорыКонтрагентов).Валютный
	|					ИЛИ ВЫРАЗИТЬ(Субконто2 КАК Справочник.ДоговорыКонтрагентов).РасчетыВУсловныхЕдиницах)
	#КонецУдаления
	|				И Организация В (&СписокОрганизаций)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоДокументамРасчетовПоВсемСчетам.Контрагент КАК Контрагент,
	|	ОстаткиПоДокументамРасчетовПоВсемСчетам.Договор КАК Договор,
	|	ОстаткиПоДокументамРасчетовПоВсемСчетам.ДокументРасчетов КАК ДокументРасчетов,
	|	ОстаткиПоДокументамРасчетовПоВсемСчетам.Сумма КАК Сумма,
	|	ОстаткиПоДокументамРасчетовПоВсемСчетам.ВалютнаяСумма КАК ВалютнаяСумма,
	|	ОстаткиПоДокументамРасчетовПоВсемСчетам.Организация КАК Организация,
	|	ОстаткиПоДокументамРасчетовПоВсемСчетам.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА СтатусыДокументов.Статус ЕСТЬ NULL
	#Удаление
	|				ИЛИ СтатусыДокументов.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.НеОплачен), ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.ОплаченЧастично))
	#КонецУдаления
	#Вставка
	|				ИЛИ СтатусыДокументов.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.НеОплачен), ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.ОплаченЧастично), ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.СогласованДляОплаты))
	#КонецВставки
	|			ТОГДА ОстаткиПоДокументамРасчетовПоВсемСчетам.СчетНаОплату
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|	КОНЕЦ КАК СчетНаОплату
	|ПОМЕСТИТЬ ОстаткиПоДокументамРасчетов
	|ИЗ
	|	ОстаткиПоДокументамРасчетовПоВсемСчетам КАК ОстаткиПоДокументамРасчетовПоВсемСчетам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|		ПО ОстаткиПоДокументамРасчетовПоВсемСчетам.Организация = СтатусыДокументов.Организация
	|			И ОстаткиПоДокументамРасчетовПоВсемСчетам.СчетНаОплату = СтатусыДокументов.Документ
	#Вставка
	|ГДЕ
	|    (СтатусыДокументов.Статус ЕСТЬ NULL) 
	|    ИЛИ (СтатусыДокументов.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.Оплачен))
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ДокументРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыДокументов.Статус КАК Статус,
	|	ЕСТЬNULL(СрокиОплатыДокументов.СрокОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокОплаты,
	|	СчетНаОплатуПоставщика.Организация КАК Организация,
	|	СчетНаОплатуПоставщика.Контрагент КАК Контрагент,
	|	СчетНаОплатуПоставщика.Ссылка КАК СчетНаОплату,
	|	СчетНаОплатуПоставщика.СуммаДокумента КАК СуммаВВалюте,
	|	СчетНаОплатуПоставщика.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА СчетНаОплатуПоставщика.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &ВалютаРеглУчета
	|		ИНАЧЕ СчетНаОплатуПоставщика.ВалютаДокумента
	|	КОНЕЦ КАК Валюта,
	|	СчетНаОплатуПоставщика.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		ИЛИ СчетНаОплатуПоставщика.ВалютаДокумента = &ВалютаРеглУчета КАК ВалютаСоответствуетРеглУчету
	|ПОМЕСТИТЬ НеоплаченныеСчетаВВалюте
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|		ПО (СтатусыДокументов.Документ = СчетНаОплатуПоставщика.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиОплатыДокументов КАК СрокиОплатыДокументов
	|		ПО СчетНаОплатуПоставщика.Организация = СрокиОплатыДокументов.Организация
	|			И СчетНаОплатуПоставщика.Ссылка = СрокиОплатыДокументов.Документ
	|ГДЕ
	|	СчетНаОплатуПоставщика.Проведен
	|	И СчетНаОплатуПоставщика.Организация В(&СписокОрганизаций)
	#Удаление
	|	И (СчетНаОплатуПоставщика.ДоговорКонтрагента.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ СчетНаОплатуПоставщика.ДоговорКонтрагента.Валютный
	|			ИЛИ СчетНаОплатуПоставщика.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах)
	#КонецУдаления
	#Удаление
	|	И ЕСТЬNULL(СтатусыДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.НеОплачен)) В (ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.НеОплачен), ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.ОплаченЧастично))
	#КонецУдаления
	#Вставка
	|		И ЕСТЬNULL(СтатусыДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.НеОплачен)) В (ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.НеОплачен), ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.ОплаченЧастично),ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.СогласованДляОплаты))
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетНаОплатуПоставщика.Организация,
	|	СчетНаОплату,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ КурсыВалютДляСчетов
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ГраницаОстатков, ) КАК КурсыВалютСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатаСчетовОбороты.Организация КАК Организация,
	|	ОплатаСчетовОбороты.СчетНаОплату КАК СчетНаОплату,
	|	ОплатаСчетовОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ОплатаСчетов
	|ИЗ
	|	РегистрНакопления.ОплатаСчетов.Обороты(
	|			,
	|			&ГраницаОстатков,
	|			,
	|			Организация В (&СписокОрганизаций)
	|				И СчетНаОплату В
	|					(ВЫБРАТЬ
	|						НеоплаченныеСчетаВВалюте.СчетНаОплату
	|					ИЗ
	|						НеоплаченныеСчетаВВалюте КАК НеоплаченныеСчетаВВалюте
	|					ГДЕ
	|						НеоплаченныеСчетаВВалюте.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОплатыСчета.ОплаченЧастично))) КАК ОплатаСчетовОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеоплаченныеСчетаВВалюте.СчетНаОплату КАК СчетНаОплату,
	|	НеоплаченныеСчетаВВалюте.СрокОплаты КАК СрокОплаты,
	|	НеоплаченныеСчетаВВалюте.Организация КАК Организация,
	|	НеоплаченныеСчетаВВалюте.Контрагент КАК Контрагент,
	|	НеоплаченныеСчетаВВалюте.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА НеоплаченныеСчетаВВалюте.СуммаВВалюте - ЕСТЬNULL(ОплатаСчетов.СуммаОборот, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ НеоплаченныеСчетаВВалюте.СуммаВВалюте - ЕСТЬNULL(ОплатаСчетов.СуммаОборот, 0)
	|	КОНЕЦ КАК ВалютнаяСумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КурсыВалютДляСчетов.Курс, 0) = 0
	|				ИЛИ ЕСТЬNULL(КурсыВалютДляСчетов.Кратность, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (НеоплаченныеСчетаВВалюте.СуммаВВалюте - ЕСТЬNULL(ОплатаСчетов.СуммаОборот, 0)) * КурсыВалютДляСчетов.Курс / КурсыВалютДляСчетов.Кратность
	|	КОНЕЦ КАК Сумма,
	|	НеоплаченныеСчетаВВалюте.Валюта КАК Валюта
	|ПОМЕСТИТЬ НеоплаченныеСчета
	|ИЗ
	|	НеоплаченныеСчетаВВалюте КАК НеоплаченныеСчетаВВалюте
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютДляСчетов КАК КурсыВалютДляСчетов
	|		ПО НеоплаченныеСчетаВВалюте.Валюта = КурсыВалютДляСчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатаСчетов КАК ОплатаСчетов
	|		ПО НеоплаченныеСчетаВВалюте.Организация = ОплатаСчетов.Организация
	|			И НеоплаченныеСчетаВВалюте.СчетНаОплату = ОплатаСчетов.СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеоплаченныеСчета.СрокОплаты КАК СрокОплатыСчета,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК СрокОплатыПоступления,
	|	НеоплаченныеСчета.СчетНаОплату КАК СчетНаОплату,
	|	НЕОПРЕДЕЛЕНО КАК ДокументРасчетов,
	|	НеоплаченныеСчета.Организация КАК Организация,
	|	НеоплаченныеСчета.Контрагент КАК Контрагент,
	|	НеоплаченныеСчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НеоплаченныеСчета.ВалютнаяСумма КАК ВалютнаяСуммаПредоплата,
	|	НеоплаченныеСчета.Сумма КАК СуммаПредоплата,
	|	0 КАК ВалютнаяСуммаДолг,
	|	0 КАК СуммаДолг,
	|	НеоплаченныеСчета.Валюта КАК Валюта
	|ПОМЕСТИТЬ СписокСделокОбъединение
	|ИЗ
	|	НеоплаченныеСчета КАК НеоплаченныеСчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ВЫБОР
	|		КОГДА НЕ СрокиОплатыДокументов.СрокОплаты ЕСТЬ NULL
	|			ТОГДА СрокиОплатыДокументов.СрокОплаты
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОстаткиПоДокументамРасчетов.Договор.УстановленСрокОплаты
	|						И ОстаткиПоДокументамРасчетов.Договор.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ОстаткиПоДокументамРасчетов.Договор.ДатаОплаты
	|				КОГДА ОстаткиПоДокументамРасчетов.Договор.УстановленСрокОплаты
	|					ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДанныеПервичныхДокументов.ДатаРегистратора, ДЕНЬ), ДЕНЬ, ОстаткиПоДокументамРасчетов.Договор.СрокОплаты)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДанныеПервичныхДокументов.ДатаРегистратора, ДЕНЬ), ДЕНЬ, &СрокОплатыПоУмолчанию)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ОстаткиПоДокументамРасчетов.СчетНаОплату,
	|	ОстаткиПоДокументамРасчетов.ДокументРасчетов,
	|	ОстаткиПоДокументамРасчетов.Организация,
	|	ОстаткиПоДокументамРасчетов.Контрагент,
	|	ОстаткиПоДокументамРасчетов.Договор,
	|	0,
	|	0,
	|	ОстаткиПоДокументамРасчетов.ВалютнаяСумма,
	|	ОстаткиПоДокументамРасчетов.Сумма,
	|	ЕСТЬNULL(ОстаткиПоДокументамРасчетов.Валюта, ОстаткиПоДокументамРасчетов.ДокументРасчетов.ВалютаДокумента)
	|ИЗ
	|	ОстаткиПоДокументамРасчетов КАК ОстаткиПоДокументамРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиОплатыДокументов КАК СрокиОплатыДокументов
	|		ПО ОстаткиПоДокументамРасчетов.Организация = СрокиОплатыДокументов.Организация
	|			И ОстаткиПоДокументамРасчетов.ДокументРасчетов = СрокиОплатыДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ОстаткиПоДокументамРасчетов.Организация = ДанныеПервичныхДокументов.Организация
	|			И ОстаткиПоДокументамРасчетов.ДокументРасчетов = ДанныеПервичныхДокументов.Документ
	|ГДЕ
	|	(СрокиОплатыДокументов.СрокОплаты ЕСТЬ NULL
	|			ИЛИ СрокиОплатыДокументов.СрокОплаты <> ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СписокСделокОбъединение.СчетНаОплату = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|				ТОГДА СписокСделокОбъединение.СрокОплатыПоступления
	|			ИНАЧЕ СписокСделокОбъединение.СрокОплатыСчета
	|		КОНЕЦ) КАК СрокОплаты,
	|	ВЫБОР
	|		КОГДА СписокСделокОбъединение.СчетНаОплату = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|			ТОГДА СписокСделокОбъединение.ДокументРасчетов
	|		ИНАЧЕ СписокСделокОбъединение.СчетНаОплату
	|	КОНЕЦ КАК ГруппировкаПоДокументу,
	|	МАКСИМУМ(СписокСделокОбъединение.СчетНаОплату) КАК СчетНаОплату,
	|	МАКСИМУМ(СписокСделокОбъединение.ДокументРасчетов) КАК ДокументРасчетов,
	|	СписокСделокОбъединение.Организация КАК Организация,
	|	СписокСделокОбъединение.Контрагент КАК Контрагент,
	|	СписокСделокОбъединение.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(СписокСделокОбъединение.ВалютнаяСуммаПредоплата) КАК ВалютнаяСуммаПредоплата,
	|	СУММА(СписокСделокОбъединение.СуммаПредоплата) КАК СуммаПредоплата,
	|	СУММА(СписокСделокОбъединение.ВалютнаяСуммаДолг) КАК ВалютнаяСуммаДолг,
	|	СУММА(СписокСделокОбъединение.СуммаДолг) КАК СуммаДолг,
	|	СписокСделокОбъединение.Валюта КАК Валюта
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	СписокСделокОбъединение КАК СписокСделокОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокСделокОбъединение.Контрагент,
	|	СписокСделокОбъединение.ДоговорКонтрагента,
	|	СписокСделокОбъединение.Организация,
	|	СписокСделокОбъединение.Валюта,
	|	ВЫБОР
	|		КОГДА СписокСделокОбъединение.СчетНаОплату = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|			ТОГДА СписокСделокОбъединение.ДокументРасчетов
	|		ИНАЧЕ СписокСделокОбъединение.СчетНаОплату
	|	КОНЕЦ";

	Если ДляКалендаря Тогда 

		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	Результат.Организация КАК Организация,
		|	Результат.СрокОплаты КАК ДатаПлатежа,
		|	ВЫБОР
		|		КОГДА Результат.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
		|			ТОГДА Результат.СчетНаОплату
		|		ИНАЧЕ Результат.ДокументРасчетов
		|	КОНЕЦ КАК Документ,
		|	ВЫБОР
		|		КОГДА Результат.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОплатаПоСчету,
		|	Результат.Контрагент КАК Контрагент,
		|	Результат.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	Результат.Контрагент КАК Расшифровка,
		|	ВЫБОР
		|		КОГДА Результат.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
		|			ТОГДА Результат.СуммаПредоплата
		|		ИНАЧЕ Результат.СуммаДолг
		|	КОНЕЦ КАК Сумма,
		|	0 КАК НомерРаздела,
		|	Результат.СрокОплаты < &РабочаяДата КАК Просрочен
		|ПОМЕСТИТЬ РезультатДляКалендаря
		|ИЗ
		|	Результат КАК Результат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатДляКалендаря.Организация КАК Организация,
		|	РезультатДляКалендаря.ДатаПлатежа КАК ДатаПлатежа,
		|	РезультатДляКалендаря.Документ КАК Документ,
		|	РезультатДляКалендаря.ОплатаПоСчету КАК ОплатаПоСчету,
		|	РезультатДляКалендаря.Контрагент КАК Контрагент,
		|	РезультатДляКалендаря.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РезультатДляКалендаря.Расшифровка КАК Расшифровка,
		|	РезультатДляКалендаря.Сумма КАК Сумма,
		|	РезультатДляКалендаря.НомерРаздела КАК НомерРаздела,
		|	РезультатДляКалендаря.Просрочен КАК Просрочен,
		|	МАКСИМУМ(ЕСТЬNULL(ПлатежноеПоручение.Ссылка, ЗНАЧЕНИЕ(Документ.ПлатежноеПоручение.ПустаяСсылка))) КАК ПлатежныйДокумент
		|ИЗ
		|	РезультатДляКалендаря КАК РезультатДляКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО (НЕ РезультатДляКалендаря.Просрочен)
		|			И (ПлатежноеПоручение.ДокументОснование = РезультатДляКалендаря.Документ)
		|			И (ПлатежноеПоручение.Организация = РезультатДляКалендаря.Организация)
		|
		|СГРУППИРОВАТЬ ПО
		|	РезультатДляКалендаря.Документ,
		|	РезультатДляКалендаря.Организация,
		|	РезультатДляКалендаря.Просрочен,
		|	РезультатДляКалендаря.ДатаПлатежа,
		|	РезультатДляКалендаря.Расшифровка,
		|	РезультатДляКалендаря.ДоговорКонтрагента,
		|	РезультатДляКалендаря.Сумма,
		|	РезультатДляКалендаря.ОплатаПоСчету,
		|	РезультатДляКалендаря.Контрагент,
		|	РезультатДляКалендаря.НомерРаздела";

	Иначе

		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ИСТИНА КАК Оплатить,
		|	Результат.СрокОплаты КАК СрокОплаты,
		|	РАЗНОСТЬДАТ(&РабочаяДата, Результат.СрокОплаты, ДЕНЬ) КАК ОсталосьДней,
		|	Результат.СчетНаОплату,
		|	Результат.ДокументРасчетов,
		|	Результат.Организация,
		|	Результат.Контрагент,
		|	Результат.ДоговорКонтрагента,
		|	Результат.ВалютнаяСуммаПредоплата,
		|	Результат.СуммаПредоплата,
		|	Результат.ВалютнаяСуммаДолг КАК ВалютнаяСуммаДолг,
		|	Результат.СуммаДолг КАК СуммаДолг,
		|	Результат.Валюта,
		|	ВЫБОР
		|		КОГДА Результат.СрокОплаты = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеЗаполненСрокОплаты
		|ИЗ
		|	Результат КАК Результат 
		#Вставка
		|ГДЕ
		|Результат.СрокОплаты >= ДАТАВРЕМЯ(2026, 01, 01)    
		#КонецВставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НеЗаполненСрокОплаты,
		|	СрокОплаты";

	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции
