&НаСервере
Процедура ЛГС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Элементы.ДокументОснование.Видимость = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Сделка) Тогда
		
		Элементы.Сделка.Видимость = Истина;
		
	КонецЕсли; 
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.ВариантПечатиQRКода = Перечисления.ВариантПечатиQRКода.ПлатежныеРеквизиты;
		
	КонецЕсли;
	
	Если ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") тогда
		
		Элементы.Администратор.Видимость = Истина;
		
	КонецЕсли;
	
	// ++ ХАУНД Устинин 04.06.2026 ID: 4410
	Элементы.СтатусДокумента.Доступность = ОбщегоНазначения.ПользовательМожетМенятьСтатусДокумента();
	// -- ХАУНД Устинин 04.06.2026 ID: 4410
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Перевыставляемый",Истина);
	НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 И (НЕ ЗначениеЗаполнено(Объект.Сделка)) Тогда 
		
		Сообщить("Есть перевыставляемые услуги но не указана сделка.",СтатусСообщения.Важное);
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ЛГС_ТоварыНоменклатураИнтерактивнаяОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Перевыставляемый = ПолучитьПризнакПеревыставляемый(ВыбранноеЗначение);
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Перевыставляемый = Перевыставляемый;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПризнакПеревыставляемый(ВыбранноеЗначение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
	|ИЗ
	|	РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	|ГДЕ
	|	ВидыРасходовСделки.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", ВыбранноеЗначение);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе	
		Выборка = Результат.Выбрать(); 
		Выборка.Следующий();
		Возврат Выборка.Перевыставляемый;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ЛГС_ПриОткрытииПосле(Отказ)
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЛГС_ДатаПриИзмененииПосле(Элемент)
	
	УстановитьНовыйНомерНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНовыйНомерНаСервере()
	
	ИмяФункциональнойОпции = "ПрефиксыОрганизаций";
	ИмяПараметраФункциональнойОпции = "Организация";
	
	Префикс = "00-";
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Организация.Префикс) Тогда
		
		Префикс = Объект.Организация.Префикс + "-";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Номер КАК Номер
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	СчетНаОплатуПокупателю.Дата >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И СчетНаОплатуПокупателю.Дата <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьВыборка = Ложь;
	
	ЧислоНомера = 1;
	
	Пока Выборка.Следующий() Цикл
		
		Если (Число(Прав(СокрЛП(Выборка.Номер), 2)) + 1) > ЧислоНомера Тогда
			
			ЧислоНомера = Число(Прав(СокрЛП(Выборка.Номер), 2)) + 1; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.Номер = СтрШаблон("%1%2%3", Префикс, Формат(Объект.Дата, "ДФ=ddMM"), Формат(ЧислоНомера, "ЧЦ=2; ЧН=0; ЧВН=; ЧГ=0"));
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриЗаписиНаСервере")
Процедура ЛГС_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	#Удаление
	УстановитьСтатусДокумента(ТекущийОбъект.Ссылка);
    #КонецУдаления
	#Вставка
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОграничениеСчетов.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.ОграничениеСчетов КАК ОграничениеСчетов
	|ГДЕ
	|	ОграничениеСчетов.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		УстановитьСтатусДокумента(ТекущийОбъект.Ссылка); 
		
	КонецЕсли;
	#КонецВставки
	СрокиОплатыДокументов.ЗаписатьСрокОплатыДокумента(ТекущийОбъект.Ссылка, СрокОплаты);

	Если ЗначениеЗаполнено(ПравилоПовторения) Тогда

		Если Объект.Ссылка.Пустая() Тогда // Новый документ по правилу.

			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоПовторения, "Организация") <> ТекущийОбъект.Организация Тогда
				ПравилоОбъект = ПравилоПовторения.ПолучитьОбъект();
				ПравилоОбъект.Организация = ТекущийОбъект.Организация;
				ПравилоОбъект.Записать();
			КонецЕсли;

			РегистрыСведений.РегулярныеСчетаПокупателям.УстановитьШаблон(ПравилоПовторения, ТекущийОбъект.Ссылка);

			НадписьПовторение = НадписьПовторение(ПравилоПовторения, Ложь);

			ПараметрыЗаписи.Вставить("ВведенДокументПоПравилу");

		Иначе

			РегистрыСведений.РегулярныеСчетаПокупателям.УстановитьШаблон(ПравилоПовторения, ТекущийОбъект.Ссылка,, Истина);

		КонецЕсли;

	КонецЕсли;

	УстановитьНастройкиОповещенияПоСчетуПокупателю(ТекущийОбъект.Ссылка);

	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

КонецПроцедуры

 
