
&НаСервере
Процедура ЛГС_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	НЗ = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьНаборЗаписей();
	НЗ.Отбор.Реализация.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ЭДО = ЭтотОбъект.ОтправленоПоЭДО;
			Запись.Почта = ЭтотОбъект.ОтправленоПоПочте;
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Если ЭтотОбъект.ОтправленоПоЭДО ИЛИ ЭтотОбъект.ОтправленоПоПочте Тогда
			
			Запись = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьМенеджерЗаписи();
			Запись.Реализация = Объект.Ссылка;
			Запись.ЭДО = ЭтотОбъект.ОтправленоПоЭДО;
			Запись.Почта = ЭтотОбъект.ОтправленоПоПочте;
			Запись.Записать();  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	
	НЗ = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьНаборЗаписей();
	НЗ.Отбор.Реализация.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Для Каждого Запись Из НЗ Цикл
		
		ЭтотОбъект.ОтправленоПоПочте = Запись.Почта;
		ЭтотОбъект.ОтправленоПоЭДО = Запись.ЭДО;
		
	КонецЦикла;
	
	Если ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") тогда
		
		Элементы.Администратор.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
