&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрКоманды);
	
	ОбъектыПечати = Новый СписокЗначений; 
	ИмяМакета = "ПоручениеЭкспедиторуАльтернативное"; 
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПоручениеЭкспедиторуАльтернативное");
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Поручение экспедитору (альтернативное)"; 
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуПорученияЭкспедитору(МассивОбъектов, ОбъектыПечати, ИмяМакета); 
	
	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуПорученияЭкспедитору(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоручениеЭкспедитору"; 
	ТабличныйДокумент.Защита = Истина;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументПоручениеЭкспедитору(ТабличныйДокумент, МассивОбъектов[0]); 	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументПоручениеЭкспедитору(ТабДок, Док)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Поручение_ЭкспедиторуАльтернативное";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	|	ПоручениеЭкспедитору.Номер КАК Номер,
	|	ПоручениеЭкспедитору.Дата КАК Дата,
	|	ПоручениеЭкспедитору.Проведен КАК Проведен,
	|	ПоручениеЭкспедитору.Грузоотправитель КАК Грузоотправитель,
	|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	|	ПоручениеЭкспедитору.Грузополучатель КАК Грузополучатель,
	|	ПоручениеЭкспедитору.Договор КАК Договор,
	|	ПоручениеЭкспедитору.УведомитьСторонуОПрибытииГруза КАК УведомитьСторонуОПрибытииГруза,
	|	ПоручениеЭкспедитору.СтранаПроисхожденияГруза КАК СтранаПроисхожденияГруза,
	|	ПоручениеЭкспедитору.ТоварыГотовыеКОтправкеМестоИДата КАК ТоварыГотовыеКОтправкеМестоИДата,
	|	ПоручениеЭкспедитору.ВидТранспорта КАК ВидТранспорта,
	|	ПоручениеЭкспедитору.ПунктНазначения КАК ПунктНазначения,
	|	ПоручениеЭкспедитору.Страхование КАК Страхование,
	|	ПоручениеЭкспедитору.ТоварныйКод КАК ТоварныйКод,
	|	ПоручениеЭкспедитору.Маркировка КАК Маркировка,
	|	ПоручениеЭкспедитору.КоличествоМестВидУпаковки КАК КоличествоМестВидУпаковки,
	|	ПоручениеЭкспедитору.ВесБруттоНетто КАК ВесБруттоНетто,
	|	ПоручениеЭкспедитору.Объем КАК Объем,
	|	ПоручениеЭкспедитору.СтоимостьГруза КАК СтоимостьГруза,
	|	ПоручениеЭкспедитору.РазмерУпаковки КАК РазмерУпаковки,
	|	ПоручениеЭкспедитору.ТребуемыеДокументы КАК ТребуемыеДокументы,
	|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	|	ПоручениеЭкспедитору.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ПоручениеЭкспедитору.НеПечататьСтоимостьУслугВПоручении КАК НеПечататьСтоимостьУслугВПоручении,
	|	ПоручениеЭкспедитору.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	|ГДЕ
	|	ПоручениеЭкспедитору.Ссылка = &Док";
	
	Запрос.УстановитьПараметр("Док", Док);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.ПоручениеЭкспедиторуАльтернативное");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Страница");
		
		ОбластьМакета.Параметры.Номер = Выборка.Номер;
		ОбластьМакета.Параметры.Дата = Формат(Выборка.Дата, "ДФ='dd.MM.yyyy""г.""'"); 		
		
		СуммаАвтодоставка = 0;
		
		СуммаТерминальнаяОбработка = 0;
		
		Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
			
			ОбластьМакета.Параметры.Коносамент = Выборка.ДокументОснование.Коносамент;	
			ОбластьМакета.Параметры.УсловиеПоставки = Выборка.ДокументОснование.УсловиеПоставки;
			ОбластьМакета.Параметры.ДатаПрибытия = Формат(Выборка.ДокументОснование.ДатаПрибытия, "ДФ='dd.MM.yyyy""г.""'");
			ОбластьМакета.Параметры.ПортОтгрузки = Выборка.ДокументОснование.ПортОтгрузки;
			ОбластьМакета.Параметры.Груз = Выборка.ДокументОснование.Груз;
			
			СтрКонтейнеры = "";
			
			Для Каждого Стр Из Выборка.ДокументОснование.Контейнеры Цикл
				
				Если СтрКонтейнеры = "" Тогда   
					
					ОбластьМакета.Параметры.Контейнеры = Строка(Стр.Контейнер);
					
				Иначе  
					
					ОбластьМакета.Параметры.Контейнеры = СтрКонтейнеры + ", " + Строка(Стр.Контейнер);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого Стр Из Выборка.ДокументОснование.РасходыКлиента Цикл
				
				Если СтрНайти(ВРЕГ(Строка(Стр.Номенклатура)), "АВТОДОСТАВКА") > 0 Тогда
					
					СуммаАвтодоставка = СуммаАвтодоставка + Стр.Сумма;
					
				ИначеЕсли СтрНайти(ВРЕГ(Строка(Стр.Номенклатура)), "ТЕРМИНАЛЬНАЯ ОБРАБОТКА") > 0 Тогда
					
					СуммаТерминальнаяОбработка = СуммаТерминальнаяОбработка + Стр.Сумма;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ТЗ = Новый ТаблицаЗначений;
			ТЗ.Колонки.Добавить("Направление");
			
			Для Каждого Стр Из Выборка.ДокументОснование.ИнформацияОПеревозчиках Цикл
				
				СтрТЗ = ТЗ.Добавить();
				СтрТЗ.Направление = Стр.Направление;
				
			КонецЦикла;
			
			ТЗ.Свернуть("Направление"); 
			
			Направления = "";
			
			Маршрут = "";
			
			Для Каждого СтрТЗ Из ТЗ Цикл
				
				Если Направления = "" Тогда
					
					Направления = Строка(СтрТЗ.Направление);
					
				Иначе
					
					Направления = Направления + ", " + Строка(СтрТЗ.Направление);
					
				КонецЕсли;
				
				Если Маршрут = "" Тогда
					
					Маршрут = Строка(Выборка.ДокументОснование.ПортОтгрузки) + " - " + Строка(СтрТЗ.Направление);
					
				Иначе
					
					Маршрут = Маршрут + ", " + Строка(Выборка.ДокументОснование.ПортОтгрузки) + " - " + Строка(СтрТЗ.Направление);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ОбластьМакета.Параметры.Направление = Направления;
			ОбластьМакета.Параметры.Маршрут = Маршрут;
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.СуммаАвтодоставка = Формат(СуммаАвтодоставка,"ЧДЦ=2; ЧГ=; ЧФ='Ч"" руб.""'");
		ОбластьМакета.Параметры.СуммаТерминальнаяОбработка = Формат(СуммаТерминальнаяОбработка,"ЧДЦ=2; ЧГ=; ЧФ='Ч"" руб.""'");
		
		ОбластьМакета.Параметры.ГрузовыеМеста = ?(ЗначениеЗаполнено(Выборка.КоличествоМестВидУпаковки), Выборка.КоличествоМестВидУпаковки + " мест ", "") + ?(ЗначениеЗаполнено(Выборка.ВесБруттоНетто), Выборка.ВесБруттоНетто + " кг ", "") + ?(ЗначениеЗаполнено(Выборка.Объем), Выборка.Объем + " м3", "");
		ОбластьМакета.Параметры.СтранаПроисхожденияГруза = Выборка.СтранаПроисхожденияГруза;
		ОбластьМакета.Параметры.Грузоотправитель = Выборка.Грузоотправитель;
		ОбластьМакета.Параметры.Грузополучатель = Выборка.Грузополучатель; 
		
		ОбластьМакета.Параметры.ЭкспедиторскоеСопровождение = "7 000";
		
		//ОбластьМакета.Параметры.Заказчик = "ООО «Тис Лоджистик»";
		//ОбластьМакета.Параметры.КоносаментВладелец = "ООО «ЮГМАКС»";
		//ОбластьМакета.Параметры.НомерДоговора = "№YMFW37 от «07» мая 2024г.";
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.Защита = Ложь;
	
	Возврат ТабличныйДокумент;
		
КонецФункции  
