Перем ПервоеПроведение;
&После("ПередЗаписью")
Процедура ЛГС_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  
	
	ГрупповоеПерепроведение = ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект);
	
	Если ГрупповоеПерепроведение Тогда
		Возврат;
	КонецЕсли;    
	
	//Если Не ЭтотОбъект.ЛГС_Администратор Тогда
	//	
	//	Ошибка = "Не удалось провести документ, т.к. в составе сделок есть архивные:"  +Символы.ПС; 
	//	Ошибка1 = "";
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СтатусыСделок.Сделка КАК Сделка,
	//	|	СтатусыСделок.Статус КАК Статус
	//	|ИЗ
	//	|	РегистрСведений.СтатусыСделок КАК СтатусыСделок
	//	|ГДЕ
	//	|	СтатусыСделок.Сделка = &Сделка";
	//	
	//	Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.СчетНаОплатуПокупателю.Сделка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	
	//	
	//	Пока Выборка.Следующий() Цикл  
	//		
	//		Если Выборка.Статус = Перечисления.СтатусыСделок.Завершена ИЛИ  Выборка.Статус = Перечисления.СтатусыСделок.Закрыта Тогда
	//			Ошибка1 = Ошибка1+  ЭтотОбъект.СчетНаОплатуПокупателю.Сделка +  Символы.ПС;
	//		КонецЕсли;   
	//		
	//	КонецЦикла; 
	//	
	//	
	//	
	//	Если Ошибка1  <>  "" Тогда
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = Ошибка+Ошибка1;
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетНаОплатуПокупателю) И НЕ ЗначениеЗаполнено(Номер) Тогда
		Номер = СчетНаОплатуПокупателю.Номер;		
	КонецЕсли;  
	
	
	ПервоеПроведение = НЕ Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение; 
	
КонецПроцедуры


Функция ОтправитьНаПочтуПриПервомПроведении() Экспорт
	
	Если КонтрольОтправкиНаПочту() Тогда
		
		СтруктураВозврата = ЗаполнитьТабличныйДокументРеализации();
		
		ТабДокУПД = Неопределено;
		ТабДокСчета = Неопределено;
		
		ТабДок = СтруктураВозврата.ТабДок; 
		
		Если СтруктураВозврата.Флаг Тогда
			
			Вложения = Новый Массив;
			ПочтаОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
			
			ПрикрепитьВложение(ТабДок, Вложения, СтруктураВозврата.ВидПечатнойФормы + " " 
			+ ЭтотОбъект.Контрагент + " №" + ЭтотОбъект.Номер 
			+ " от " + Формат(ЭтотОбъект.Дата, "ДФ='dd.MM.yyyy""г.""'") 
			+ ".pdf");
			
			ЗапросКАдресам = Новый Запрос;
			ЗапросКАдресам.Текст = "ВЫБРАТЬ
			|	КонтрагентыКонтактнаяИнформация.Представление КАК АдресПочты
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|ГДЕ
			|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
			|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид";
			
			//АдресаПолучателей = "";
			ЗапросКАдресам.УстановитьПараметр("Контрагент", Контрагент);
			ЗапросКАдресам.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Email для отправки счетов"));
			
			РезультатЗапросаКАдресам = ЗапросКАдресам.Выполнить();
			
			ВыборкаАдресов = РезультатЗапросаКАдресам.Выбрать();    
			
			//АдресаПолучателей = "marknab2kek12@ya.ru";
			
			ФлагОтправки = Ложь;
			Пока ВыборкаАдресов.Следующий() Цикл
				
				АдресПолучателя = ВыборкаАдресов.АдресПочты;
				//АдресПолучателя = "notfmail@gmail.com";
				Если ЗначениеЗаполнено(АдресПолучателя) Тогда
					
					Если НЕ СтрНайти(АдресПолучателя, "@") = 0 Тогда
						
						ПараметрыПисьма = СформироватьПараметрыПисьма(АдресПолучателя, ПочтаОтправителя, 
						СтруктураВозврата.ВидПечатнойФормы + " " + ЭтотОбъект.Контрагент + " №" + ЭтотОбъект.Номер + " от " + 
						Формат(ЭтотОбъект.Дата, "ДФ='dd.MM.yyyy""г.""'") + " от " + ЭтотОбъект.Организация.Наименование,
						"Добрый день! Данное письмо сформировано автоматически. Отвечать на него не требуется.
						|Документы во вложении.", Вложения);
						
						РезультатОтправки = ЗначениеЗаполнено(РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтаОтправителя, ПараметрыПисьма));   
						
						Если РезультатОтправки Тогда
							ФлагОтправки = Истина;
						КонецЕсли;
						
					Иначе
						
						ФлагОтправки = Истина;
						
					КонецЕсли;
					
				Иначе
					
					ФлагОтправки = Истина;
					
				КонецЕсли;   
				
			КонецЦикла; 
			
		Иначе
					
			ФлагОтправки = Истина;
					
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ФлагОтправки;
	
КонецФункции  

Процедура ПрикрепитьВложение(ТабличныйДокумент, Вложения, Представление)
	
	Попытка   
		
		ПотокФайла = Новый ПотокВПамяти();
		ТабличныйДокумент.Записать(ПотокФайла, ТипФайлаТабличногоДокумента.PDF, );
		
		ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
		ВременноеХранилищеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор); 
		
		ОписаниеВложения = Неопределено;
		
		ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", Представление, ВременноеХранилищеФайла);
		
		Вложения.Добавить(ОписаниеВложения);
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка прикрепления файла", 
		УровеньЖурналаРегистрации.Ошибка, 
		ЭтотОбъект, 
		Ссылка, 
		"Не удалось прикрепить к письму файл " + Представление);		
	КонецПопытки;
	
КонецПроцедуры

Функция ЗаполнитьТабличныйДокументРеализации() Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	
	МассивДляСсылки = Новый Массив;
	МассивДляСсылки.Добавить(Ссылка);
	//ВидПечатнойФормы = "Акт выполненных работ";
	
	Сведения = Документы.РеализацияТоваровУслуг.ПолучитьТаблицуСведенийАктаОбОказанииУслуг(МассивДляСсылки);
	ОбъектыПечати = Новый СписокЗначений;
	//ПараметрыПечати = Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	//ПараметрыПечати.Вставить("ВидДокументаПечати",  "РеализацияТоваровУслуг");
	//ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Акт");
	//ПараметрыПечати.Вставить("ИмяМакетаПечати",     "Документ.РеализацияТоваровУслуг.ПФ_MXL_Акт");
	//ПараметрыПечати.Вставить("ВыводитьКоносамент", Истина);
	//ПараметрыПечати.Вставить("ВыводитьФаксимиле", Истина);
	ПараметрыПечатиСНДС = Новый Структура("ИдентификаторВКомплекте, ОтслеживатьОригинал, ДополнитьКомплектВнешнимиПечатнымиФормами,ОриентацияСтраницы", 
	"УниверсальныйПередаточныйДокументКомплект", Истина, Ложь, ОриентацияСтраницы.Ландшафт);
	
	ОсновнаяПФ = Неопределено;
	
	//Если ДокументБезНДС Тогда
	//	
	//	ОсновнаяПФ = ПечатьТорговыхДокументов.ПечатьАктаОбОказанииУслуг(Сведения, ОбъектыПечати, ПараметрыПечати);
	//	ТабДок.Вывести(ОсновнаяПФ);
	//	
	//Иначе
		
		ВидПечатнойФормы = "УПД";
		
		
		СчетаФактуры = Новый Массив;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &Ссылка
		|	И СчетФактураВыданный.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СчетаФактуры.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
		Макет = ?(Дата >= Дата(2026,1,1),"УПДСтатус1_2026","УПДСтатус1_1096");
		Макет = ?(Дата >= Дата(2026,4,1),"УПДСтатус1_26",Макет);
		
		ТабДок 	= УправлениеПечатью.СформироватьПечатныеФормы("Обработка.ПечатьУПД", Макет, СчетаФактуры, ПараметрыПечатиСНДС)
		.КоллекцияПечатныхФорм[0].ТабличныйДокумент;		
		
	//КонецЕсли;
	
	Флаг = Услуги.Количество() > 0;
	//Если ДокументБезНДС Тогда
	//	
	//	Флаг = Флаг И Не РезультатЗапроса.Пустой();
	//	
	//КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТабДок", ТабДок);
	СтруктураВозврата.Вставить("Флаг", Флаг);
	СтруктураВозврата.Вставить("ВидПечатнойФормы", ВидПечатнойФормы);
	
	Возврат СтруктураВозврата;	
	
КонецФункции 

Функция КонтрольОтправкиНаПочту() 
	
	НЗРеализаций = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьНаборЗаписей();	
	НЗРеализаций.Отбор.Документ.Установить(ЭтотОбъект.Ссылка);
	
	НЗРеализаций.Прочитать();
	
	Если НЗРеализаций.Количество() > 0 Тогда
		
		Возврат НЕ НЗРеализаций[0].Отправлен;	
		
	Иначе		
		
		МЗРеализаций = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьМенеджерЗаписи();
		
		МЗРеализаций.Документ = ЭтотОбъект.Ссылка;
		
		МЗРеализаций.Записать();
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьПараметрыПисьма(Получатели, ПочтаОтправителя, ТемаПисьма, ТекстПисьма, Вложения)
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", Получатели);
	ПараметрыПисьма.Вставить("УчетнаяЗапись", ПочтаОтправителя);                                                               
	ПараметрыПисьма.Вставить("АдресОтвета", Получатели);
	ПараметрыПисьма.Вставить("Тема", ТемаПисьма);	
	ПараметрыПисьма.Вставить("Тело", ТекстПисьма);
	ПараметрыПисьма.Вставить("ТипТекста", "ПростойТекст");
	ПараметрыПисьма.Вставить("Вложения", Вложения);
	
	Возврат ПараметрыПисьма;
	
КонецФункции

&После("ОбработкаПроведения")
Процедура ЛГС_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗаписиОтправленияПисьма = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьНаборЗаписей();
	ЗаписиОтправленияПисьма.Отбор.Документ.Установить(Ссылка);	
	
	ЗаписиОтправленияПисьма.Прочитать();
	
	Если ЗаписиОтправленияПисьма.Количество() = 0 И Дата > Дата('20250225') Тогда
		
		НоваяЗаписьПисьма = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьМенеджерЗаписи();
		НоваяЗаписьПисьма.Документ = Ссылка;
		НоваяЗаписьПисьма.Записать();
		
	КонецЕсли;
	
	Движения.ПеревыставляемыеТоварыУслуги.Записывать = Истина;		
	
	Для Каждого Стр Из ЭтотОбъект.Услуги Цикл
		
		Движение = Движения.ПеревыставляемыеТоварыУслуги.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ЭтотОбъект.Дата;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Контрагент = ЭтотОбъект.Контрагент;
		Движение.Сделка = ЭтотОбъект.СчетНаОплатуПокупателю.Сделка; 		
		Движение.Сумма = (Стр.Сумма + ?(ЭтотОбъект.СуммаВключаетНДС, 0, Стр.СуммаНДС)) * ЭтотОбъект.КурсВзаиморасчетов / ЭтотОбъект.КратностьВзаиморасчетов; 
				
	КонецЦикла;
	
	Для Каждого Стр Из ЭтотОбъект.АгентскиеУслуги Цикл
		
		Движение = Движения.ПеревыставляемыеТоварыУслуги.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ЭтотОбъект.Дата;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Контрагент = Стр.Контрагент;
		Движение.Сделка = ЭтотОбъект.СчетНаОплатуПокупателю.Сделка; 
		Движение.Сумма = (Стр.Сумма + ?(ЭтотОбъект.СуммаВключаетНДС, 0, Стр.СуммаНДС)) * ЭтотОбъект.КурсВзаиморасчетов / ЭтотОбъект.КратностьВзаиморасчетов;
		
	КонецЦикла; 
	
	Для Каждого Стр Из ЭтотОбъект.Товары Цикл
		
		Движение = Движения.ПеревыставляемыеТоварыУслуги.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ЭтотОбъект.Дата;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Контрагент = ЭтотОбъект.Контрагент;
		Движение.Сделка = ЭтотОбъект.СчетНаОплатуПокупателю.Сделка; 
		Движение.Сумма = (Стр.Сумма + ?(ЭтотОбъект.СуммаВключаетНДС, 0, Стр.СуммаНДС)) * ЭтотОбъект.КурсВзаиморасчетов / ЭтотОбъект.КратностьВзаиморасчетов;
		
	КонецЦикла;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура ЛГС_ПриЗаписи(Отказ)
	
	
КонецПроцедуры
