
&НаСервере
Процедура СохранитьДанныеНаСервере() 
	
	НЗ = РегистрыСведений.БалансЛиний.СоздатьНаборЗаписей();
	
	НЗ.Записать();
	
	Для Каждого Стр Из БалансЛиний Цикл 
		
		МЗ = РегистрыСведений.БалансЛиний.СоздатьМенеджерЗаписи();
		МЗ.АгентЛинии = Стр.АгентЛинии;
		МЗ.Баланс = Стр.Баланс;
		МЗ.Дата = Стр.Дата; 
		
		МЗ.Записать();
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Команда)
	СохранитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НЗ = РегистрыСведений.БалансЛиний.СоздатьНаборЗаписей();
	
	НЗ.Прочитать();
	
	Для Каждого Запись Из НЗ Цикл 
		
		Стр = БалансЛиний.Добавить();
		Стр.АгентЛинии = Запись.АгентЛинии;
		Стр.Баланс = Запись.Баланс;
		Стр.Дата = Запись.Дата;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура БалансЛинийБалансПриИзменении(Элемент)
	
	Элементы.БалансЛиний.ТекущиеДанные.Дата = ТекущаяДата();
	
КонецПроцедуры
