
&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	
	МассивКонтейнеров = Новый Массив;
	
	Для Каждого Стр Из Контейнеры Цикл
		
		Если Стр.Выбран Тогда
			
			Структ = Новый Структура;
			
			Структ.Вставить("Контейнер", Стр.Контейнер);
			Структ.Вставить("Перевозчик", Стр.Перевозчик);
			Структ.Вставить("Ставка", Стр.Ставка);
			Структ.Вставить("Направление", Стр.Направление);
			Структ.Вставить("ДатаДО", Стр.ДатаДО);
			Структ.Вставить("ДатаВывозаИзПорта", Стр.ДатаВывозаИзПорта);
			Структ.Вставить("Вес", Стр.Вес);
			
			МассивКонтейнеров.Добавить(Структ);
			
		КонецЕсли;	
			
	КонецЦикла; 

	ПараметрыЗакрытия = Новый Структура;
	
	ПараметрыЗакрытия.Вставить("МассивКонтейнеров", МассивКонтейнеров);
	ПараметрыЗакрытия.Вставить("Сделка", Сделка);
	
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сделка = Параметры.Сделка;
	
	Для Каждого Стр Из Сделка.ИнформацияОПеревозчиках Цикл
		
		ПараметрыОтбора = Новый Структура("КлючСвязиИнформацияОПеревозчике", Стр.КлючСвязи);
		
		НайденныеСтроки = Сделка.Контейнеры.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			СтрТЧ = Контейнеры.Добавить();
			СтрТЧ.Контейнер = НайденныеСтроки[0].Контейнер;
			СтрТЧ.Перевозчик = Стр.Перевозчик;
			СтрТЧ.Ставка = Стр.СтавкаАвтоперевозки;
			СтрТЧ.Направление = Стр.Направление;
			СтрТЧ.Выбран = Истина;
			СтрТЧ.ДатаДО = НайденныеСтроки[0].ДатаВыгрузкиСуднаДО;
			СтрТЧ.ДатаВывозаИзПорта = НайденныеСтроки[0].ДатаВывозаИзПорта;
			СтрТЧ.Вес = НайденныеСтроки[0].Вес;
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
