
&НаСервере
Процедура ЛГС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ПрисоединенныйФайл) Тогда
		
		Если ТипЗнч(Параметры.ПрисоединенныйФайл) = Тип("СправочникСсылка.СделкаПрисоединенныеФайлы") Тогда
			
			 Элементы.ВидФайлаСделки.Видимость = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&Вместо("ЗаписатьФайл")
Функция ЛГС_ЗаписатьФайл(Знач ПараметрОбъект)

	Если ПараметрОбъект = Неопределено Тогда  
		Попытка
			ЗаписываемыйОбъект = РеквизитФормыВЗначение("Объект",);  
		Исключение
			ч=1;
		КонецПопытки;
	Иначе
		ЗаписываемыйОбъект = ПараметрОбъект;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		НачатьТранзакцию();
		Попытка
			ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ЗначениеКопирования);
			ТипХраненияФайла = РаботаСФайламиСлужебный.ТипХраненияФайла(ЗначениеКопирования.Размер, ЗначениеКопирования.Расширение);
			Если ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
				СсылкаНового = Справочники[ИмяСправочника].ПолучитьСсылку();
				ЗаписываемыйОбъект.УстановитьСсылкуНового(СсылкаНового);
				РаботаСФайламиСлужебный.ЗаписатьФайлВИнформационнуюБазу(СсылкаНового, ДвоичныеДанные);
				ЗаписываемыйОбъект.ТипХраненияФайла = ТипХраненияФайла;
			Иначе
				ЗаписываемыйОбъект.Том = Неопределено;
				ЗаписываемыйОбъект.ПутьКФайлу = Неопределено;
				ЗаписываемыйОбъект.ТипХраненияФайла = Неопределено;
				РаботаСФайламиВТомахСлужебный.ДобавитьФайл(ЗаписываемыйОбъект, ДвоичныеДанные);
			КонецЕсли;

			Если ДоступнаЭлектроннаяПодпись Тогда
				РаботаСФайламиСлужебный.ПеренестиРезультатыПроверкиПодписей(ЭлектронныеПодписи, ЗначениеКопирования);
			КонецЕсли;
			Попытка
				ЗаписываемыйОбъект.Записать(); 
			Исключение
				
			КонецПопытки;
			Если ДоступнаЭлектроннаяПодпись И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
				МодульЭлектроннаяПодпись = ОбщегоНазначения.ОбщийМодуль("ЭлектроннаяПодпись");

				СертификатыИсточника = МодульЭлектроннаяПодпись.СертификатыШифрования(ЗначениеКопирования);
				МодульЭлектроннаяПодпись.ЗаписатьСертификатыШифрования(ЗаписываемыйОбъект, СертификатыИсточника);

				УстановленныеПодписи = МодульЭлектроннаяПодпись.УстановленныеПодписи(ЗначениеКопирования);
				МодульЭлектроннаяПодпись.ДобавитьПодпись(ЗаписываемыйОбъект, УстановленныеПодписи);
			КонецЕсли;

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	Иначе
		НачатьТранзакцию();
		Попытка
			Если ДоступнаЭлектроннаяПодпись Тогда
				РаботаСФайламиСлужебный.ПеренестиРезультатыПроверкиПодписей(ЭлектронныеПодписи, ЗаписываемыйОбъект.Ссылка);
			КонецЕсли;
			
			Если ТипЗнч(ЗаписываемыйОбъект) = Тип("СправочникОбъект.СделкаПрисоединенныеФайлы") Тогда
			ЗаписываемыйОбъект.ВидФайла = ЭтотОбъект.ВидФайлаСделки;	
			КонецЕсли;
			Попытка
				ЗаписываемыйОбъект.Записать(); 
			Исключение
				
			КонецПопытки;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;

	Если ПараметрОбъект = Неопределено Тогда 
		Попытка
			ЗначениеВРеквизитФормы(ЗаписываемыйОбъект, "Объект");  
		Исключение
			
		КонецПопытки;
	КонецЕсли;

	ЗначениеКопирования = Справочники[ИмяСправочника].ПустаяСсылка();
	УстановитьДоступностьКнопок(ЭтотОбъект, Элементы);
	ОбновитьЗаголовок();

	Возврат Истина;

КонецФункции
