
&НаСервере
Процедура ОригиналПорученияЭкспедиторуПолученНаСервере(Ссыл)   
	
	НЗ = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ОригиналПорученияЭкспедиторуПолучен = Истина;		
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Запись = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьМенеджерЗаписи();
		Запись.Документ = Ссыл;
		Запись.ОригиналПорученияЭкспедиторуПолучен = Истина;
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОригиналПорученияЭкспедиторуПолучен(Команда)
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		ОригиналПорученияЭкспедиторуПолученНаСервере(Ссыл);
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОригиналПорученияЭкспедиторуНеПолученНаСервере(Ссыл)
	
	НЗ = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ОригиналПорученияЭкспедиторуПолучен = Ложь;		
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОригиналПорученияЭкспедиторуНеПолучен(Команда) 
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл	   
		
		ОригиналПорученияЭкспедиторуНеПолученНаСервере(Ссыл); 
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры 

&НаСервере
Процедура ОригиналПриложенияКДоговоруПолученНаСервере(Ссыл) 
	
	НЗ = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ОригиналПриложенияКДоговоруПолучен = Истина;		
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Запись = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьМенеджерЗаписи();
		Запись.Документ = Ссыл;
		Запись.ОригиналПриложенияКДоговоруПолучен = Истина;
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОригиналПриложенияКДоговоруПолучен(Команда)
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		ОригиналПриложенияКДоговоруПолученНаСервере(Ссыл);
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОригиналПриложенияКДоговоруНеПолученНаСервере(Ссыл) 
	
	НЗ = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ОригиналПриложенияКДоговоруПолучен = Ложь;		
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОригиналПриложенияКДоговоруНеПолучен(Команда)
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл	   
		
		ОригиналПриложенияКДоговоруНеПолученНаСервере(Ссыл); 
		
	КонецЦикла;
	
	Элементы.Список.Обновить(); 
	
КонецПроцедуры

&НаСервере
Процедура ОригиналыНеПолученыВсеНаСервере(Ссыл) 
	
	НЗ = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ОригиналПриложенияКДоговоруПолучен = Ложь;
			Запись.ОригиналПорученияЭкспедиторуПолучен = Ложь;
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ОригиналыНеПолученыВсе(Команда) 
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл	   
		
		ОригиналыНеПолученыВсеНаСервере(Ссыл); 
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОригиналыПолученыВсеНаСервере(Ссыл) 
	
	НЗ = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ОригиналПриложенияКДоговоруПолучен = Истина;
			Запись.ОригиналПорученияЭкспедиторуПолучен = Истина;
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Запись = РегистрыСведений.СтатусыОригиналовДокументовПоручениеЭкспедитору.СоздатьМенеджерЗаписи();
		Запись.Документ = Ссыл;
		Запись.ОригиналПриложенияКДоговоруПолучен = Истина;
		Запись.ОригиналПорученияЭкспедиторуПолучен = Истина;
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОригиналыПолученыВсе(Команда) 
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		ОригиналыПолученыВсеНаСервере(Ссыл);
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
