
&После("ПриЗаписи")
Процедура ЛГС_ПриЗаписи(Отказ)
		
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сделка");
	
	Для Каждого Стр Из ЭтотОбъект.РаспределениеСуммПоСделкамТовары Цикл
		
		СтрТЗ = ТЗ.Добавить();
		СтрТЗ.Сделка = Стр.Сделка;
		
	КонецЦикла;
	
	ТЗ.Свернуть("Сделка");
	
	СтрокаСделки = "";
	АдресаПапок = "";
	
	Для Каждого Стр ИЗ ТЗ Цикл
		
		Если СтрокаСделки = "" Тогда
			
			СтрокаСделки = Стр.Сделка.Номер;
			
		Иначе
			
			СтрокаСделки = СтрокаСделки + ", " + Стр.Сделка.Номер;
			
		КонецЕсли;
		
		Если АдресаПапок = "" Тогда
			
			АдресаПапок = Стр.Сделка.ПутьКПапке;
			
		Иначе
			
			АдресаПапок = АдресаПапок + Символы.ПС + Стр.Сделка.ПутьКПапке;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ЛогистикаСервер.ДублируетПоВходящимРеквизитам(ЭтотОбъект) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Для данного контрагента на данную дату уже есть входящий счет с этим номером!'");
		Сообщение.Поле = "НомерВходящегоДокумента";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ДанныеСчетаПоставщиковДляВыводаВСписках.СоздатьНаборЗаписей();
	
	НЗ.Отбор.СчетПоставщика.Установить(ЭтотОбъект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись ИЗ НЗ Цикл
			
			Запись.СчетПоставщика = ЭтотОбъект.Ссылка;
			Запись.АдресаПапок = АдресаПапок;
			Запись.Сделки = СтрокаСделки;
						
		КонецЦикла;
		
	НЗ.Записать();	
		
	Иначе
		
		Запись = РегистрыСведений.ДанныеСчетаПоставщиковДляВыводаВСписках.СоздатьМенеджерЗаписи(); 
		
		Запись.СчетПоставщика = ЭтотОбъект.Ссылка; 
		Запись.АдресаПапок = АдресаПапок;
		Запись.Сделки = СтрокаСделки;
		
		Запись.Записать();
		
	КонецЕсли;
    
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура ЛГС_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	#Вставка   
	//Если Не ЭтотОбъект.Администратор тогда 
	//	
	//	ТЗ=ЭтотОбъект.РаспределениеСуммПоСделкамТовары.Выгрузить(); 
	//	ТЗ.Свернуть("Сделка");
	//	
	//	Ошибка = "Не удалось провести документ, т.к. в составе сделок есть архивные:"  +Символы.ПС;  
	//	Ошибка1 = "";
	//	Для каждого СТР из ТЗ Цикл
	//		
	//		
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	СтатусыСделок.Сделка КАК Сделка,
	//		|	СтатусыСделок.Статус КАК Статус
	//		|ИЗ
	//		|	РегистрСведений.СтатусыСделок КАК СтатусыСделок
	//		|ГДЕ
	//		|	СтатусыСделок.Сделка = &Сделка";
	//		
	//		Запрос.УстановитьПараметр("Сделка", Стр.Сделка);
	//		
	//		РезультатЗапроса = Запрос.Выполнить();
	//		
	//		Выборка = РезультатЗапроса.Выбрать();
	//		
	//		
	//		Пока Выборка.Следующий() Цикл  
	//			
	//			Если Выборка.Статус = Перечисления.СтатусыСделок.Закрыта ИЛИ Выборка.Статус = Перечисления.СтатусыСделок.Завершена Тогда
	//				Ошибка1 = Ошибка1+ Стр.Сделка +  Символы.ПС;
	//			КонецЕсли;
	//			
	//		КонецЦикла; 
	//		
	//	КонецЦикла;
	//	
	//	Если Ошибка1  <>  "" Тогда
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = Ошибка+Ошибка1;
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	#КонецВставки  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВозвратнуюТару")
		И ВозвратнаяТара.Количество() > 0 Тогда
		ВозвратнаяТара.Очистить();
	КонецЕсли;

	РаботаСДоговорамиКонтрагентовБП.ЗаполнитьДоговорПередЗаписью(ЭтотОбъект);

	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);

КонецПроцедуры
