
&НаСервере
&ИзменениеИКонтроль("ЗагрузитьПодготовленныеДанныеЗаполнениеОстатков")
Функция ЛГС_ЗагрузитьПодготовленныеДанныеЗаполнениеОстатков()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	#Вставка
	ПараметрыОтбора = Новый Структура("НеЗаполненСрокОплаты", Ложь); 
	
	ТзЗапрос = ЗапросСчетПокупателей();
	
	Для Каждого Результат из РезультатВыполнения Цикл   
	НайденаСтрока = ТзЗапрос.Найти(Результат.СчетНаОплату);	
	Если НайденаСтрока <> Неопределено Тогда
		Результат.НеЗаполненСрокОплаты = Ложь;                                     
		Результат.СрокОплаты = НайденаСтрока.СрокОплаты;
		КонецЕсли;
		КонецЦикла;
	
	ТЗЗаполненныхСроков = РезультатВыполнения.Скопировать(ПараметрыОтбора);
	
	РезультатВыполнения = ТЗЗаполненныхСроков;   	
	#КонецВставки

	Если ТипЗнч(РезультатВыполнения) = Тип("ТаблицаЗначений") И РезультатВыполнения.Количество() <> 0 Тогда

		Объект.БухОстатки.Загрузить(РезультатВыполнения);

		Элементы.БухОстатки.ТекущаяСтрока = ПолучитьИдентификаторПервойНепросроченнойОплаты();

		Если Элементы.БухОстатки.ТекущийЭлемент = Неопределено Тогда
			Элементы.БухОстатки.ТекущийЭлемент = Элементы.БухОстаткиКонтрагент;
		КонецЕсли;

	КонецЕсли;

	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("ЗаданиеВыполнено", Истина);

	ИдентификаторЗадания = Неопределено;
	УдалитьИзВременногоХранилища(АдресХранилища);
	АдресХранилища = "";

	СкрытьЭлементыОжиданияЗаполнениеОстатков(ЭтотОбъект);

	ОпределитьМоментАктуальностиОтложенныхРасчетов(Ложь);

	Возврат РезультатВыполнения;

КонецФункции

&НаСервере
Функция ЗапросСчетПокупателей()
	
	Статус = Перечисления.СтатусОплатыСчета.СогласованДляОплаты; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка,
|	СтатусыДокументов.Статус.Ссылка КАК Статус,
|	СрокиОплатыДокументов.СрокОплаты КАК СрокОплаты
|ИЗ
|	РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
|			ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиОплатыДокументов КАК СрокиОплатыДокументов
|			ПО (СрокиОплатыДокументов.Документ = СчетНаОплатуПокупателю.Ссылка)
|		ПО (СтатусыДокументов.Документ = СчетНаОплатуПокупателю.Ссылка)
|ГДЕ
|	СтатусыДокументов.Статус = &Статус"; 
	Запрос.Параметры.Вставить("Статус",Статус);  
	
	ТзЗапрос = Запрос.Выполнить().Выгрузить();
	Возврат ТзЗапрос;
	
	КонецФункции