
&НаКлиенте
Процедура Принять(Команда)
	Результат = Новый Структура();
	
	Если ЗначениеЗаполнено(Контрагент) и КонтрагентИспользовать Тогда 
		Результат.Вставить("Контрагент", Контрагент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Статус) и СтатусИспользовать Тогда 
		Результат.Вставить("Статус", Статус);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Период) и ПериодИспользовать Тогда 
		Результат.Вставить("Период", Период);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерСделки) и НомерСделкиИспользовать Тогда 
		Результат.Вставить("Номер", НомерСделки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контейнер) и КонтейнерИспользовать Тогда 
		Результат.Вставить("Контейнер", Контейнер);
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтбор(Команда)
	Контрагент = Неопределено;
	Статус = Неопределено;
	Период = Неопределено;
	НомерСделки = Неопределено; 
	Контейнер = Неопределено;
	КонтейнерИспользовать = Ложь;
	НомерСделкиИспользовать = Ложь;
	КонтрагентИспользовать = Ложь;
	СтатусИспользовать = Ложь;
	ПериодИспользовать = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Контрагент) и НЕ КонтрагентИспользовать Тогда
		КонтрагентИспользовать = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Статус) и НЕ СтатусИспользовать Тогда
		СтатусИспользовать = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Период) и НЕ ПериодИспользовать Тогда
		ПериодИспользовать = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагент") Тогда
		Контрагент = Параметры.Контрагент;
		КонтрагентИспользовать = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Статус") Тогда
		Статус = Параметры.Статус;
		СтатусИспользовать = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Период = Параметры.Период;
		ПериодИспользовать = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Номер") Тогда
		НомерСделки = Параметры.Номер;
		НомерСделкиИспользовать = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Контейнер") Тогда
		Контейнер = Параметры.Контейнер;
		КонтейнерИспользовать = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСделкиПриИзменении(Элемент)
	Если ЗначениеЗаполнено(НомерСделки) и НЕ НомерСделкиИспользовать Тогда
		НомерСделкиИспользовать = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Контейнер) и НЕ КонтейнерИспользовать Тогда 
		КонтейнерИспользовать = Истина;
	КонецЕсли;
КонецПроцедуры
