
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьДанныеНовогоЭлектронногоДокумента")
Процедура ЛГС_ЗаполнитьДанныеНовогоЭлектронногоДокумента(Основание, ВидДокумента)  
		ТипДокумента = Перечисления.ТипыДокументовЭДО.Прочее;
	
	Если ЗначениеЗаполнено(Основание) Тогда
		Основания.Добавить(Основание);
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО")
			Или ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО") Тогда
			СвойстваДокумента = ЭлектронныеДокументыЭДО.СвойстваДокумента(Основание, "Организация, Контрагент, ДоговорКонтрагента");
			Объект.Организация = СвойстваДокумента.Организация;
			Объект.Контрагент = СвойстваДокумента.Контрагент;
			Объект.ДоговорКонтрагента = СвойстваДокумента.ДоговорКонтрагента;
		ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.МЧД003") Тогда
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "ДатаВыдачи, НомерДоверенности");
			Объект.НомерДокумента = РеквизитыОснования.НомерДоверенности;
			Объект.ДатаДокумента = РеквизитыОснования.ДатаВыдачи;
			ОписаниеОбъектаУчета = ЭлектронныеДокументыЭДО.ОписаниеОбъектаУчета(Основание, ВидДокумента);
			ЗаполнитьПоОписаниюОбъектаУчета(ОписаниеОбъектаУчета, ТипДокумента);
		Иначе
			РеквизитыОснования = ИнтеграцияЭДО.ОписаниеОснованияЭлектронногоДокумента(Основание);
			Объект.Организация = РеквизитыОснования.Организация;
			Объект.Контрагент = РеквизитыОснования.Контрагент;
			Объект.НомерДокумента = РеквизитыОснования.Номер;
			Объект.ДатаДокумента = РеквизитыОснования.Дата;
			Объект.СуммаДокумента = РеквизитыОснования.СуммаДокумента;
			
			ОписаниеОбъектаУчета = ЭлектронныеДокументыЭДО.ОписаниеОбъектаУчета(Основание, ВидДокумента);
			ЗаполнитьПоОписаниюОбъектаУчета(ОписаниеОбъектаУчета, ТипДокумента);  
			#Вставка	
			Если ТипЗнч(Основание) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда	
				ТипДокумента =  Перечисления.ТипыДокументовЭДО.Договор;	
			КонецЕсли;
			#КонецВставки

		КонецЕсли;
		
	Иначе
		ЗаполнитьЗначенияПоУмолчанию();
	КонецЕсли;
	
	// Если не было предварительной подготовки данных, то документ не может иметь тип "Договорный документ"
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.ДоговорныйДокумент Тогда
		Объект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.Прочее);
	КонецЕсли;
	
	Если ЭлектронныеДокументыЭДО.ТипыДокументовПроизвольногоФормата().Найти(ТипДокумента) = Неопределено Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.Прочее;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
		Объект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипДокумента);
	КонецЕсли;
	
	ПриИзмененииКлючевыхРеквизитов();
	
	Объект.ИдентификаторДокументооборота = ЭлектронныеДокументыЭДО.НовыйИдентификаторДокументооборота();
	
	Если ТипДокумента <> Перечисления.ТипыДокументовЭДО.МашиночитаемаяДоверенность Тогда
		СвязанныеОбъектыУчета = Новый Массив;
		Для Каждого ЭлементСпискаОснований Из Основания Цикл
			СвязанныеОбъектыУчета.Добавить(ЭлементСпискаОснований.Значение);
		КонецЦикла;
		ЭлектронныеДокументыЭДО.ЗагрузитьИдентификаторыСвязанныхОбъектовУчета(Объект, СвязанныеОбъектыУчета);
	КонецЕсли;
	
	Объект.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Неформализованный;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаДокумента) Тогда
		Объект.ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеСформирован;
	
	НастройкиСхемыРегламента = НастройкиСхемыРегламента();
	ДанныеЭлементовСхемы = ИнтерфейсДокументовЭДО.НовыеДанныеЭлементовСхемы();
	ЗаполнитьДанныеЭлементаСхемыИнформацияОтправителя(ДанныеЭлементовСхемы, ТипДокумента);
	
	ИнтерфейсДокументовЭДО.ЗаполнитьСхемуРегламента(
		НастройкиСхемыРегламента, ДанныеЭлементовСхемы, СхемаРегламента);

КонецПроцедуры

&НаСервере
Процедура ЛГС_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ОтключитьВыводДопДанных = Ложь;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗагрузитьНастройкиОтображения")
Процедура ЛГС_ЗагрузитьНастройкиОтображения()

	ОтключитьВыводДопДанных = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
#Удаление
	"ОтключитьВыводДопДанных", Истина);	
#КонецУдаления
#Вставка
	"ОтключитьВыводДопДанных", Ложь);	
    // Для вывода данных комиссионера
#КонецВставки
	ОтключитьВыводКопияВерна = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
	"ОтключитьВыводКопияВерна", Истина);	
	ВыводитьБанковскиеРеквизиты = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
	"ВыводитьБанковскиеРеквизиты", Ложь);	
	ОтключитьВыводСхемыРегламента = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
	"ОтключитьВыводСхемыРегламента", Ложь);
	ОтключитьТранслитерацию = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
	"ОтключитьТранслитерацию", Ложь);

КонецПроцедуры

//&НаСервере
//&ИзменениеИКонтроль("ЗаполнитьДанныеНовогоЭлектронногоДокумента")
//Процедура ЛГС_ЗаполнитьДанныеНовогоЭлектронногоДокумента(Основание, ВидДокумента)

//	ТипДокумента = Перечисления.ТипыДокументовЭДО.Прочее;

//	Если ЗначениеЗаполнено(Основание) Тогда
//		Основания.Добавить(Основание);

//		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО")
//			Или ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО") Тогда
//			СвойстваДокумента = ЭлектронныеДокументыЭДО.СвойстваДокумента(Основание, "Организация, Контрагент, ДоговорКонтрагента");
//			Объект.Организация = СвойстваДокумента.Организация;
//			Объект.Контрагент = СвойстваДокумента.Контрагент;
//			Объект.ДоговорКонтрагента = СвойстваДокумента.ДоговорКонтрагента;
//		ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.МЧД003") Тогда
//			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "ДатаВыдачи, НомерДоверенности");
//			Объект.НомерДокумента = РеквизитыОснования.НомерДоверенности;
//			Объект.ДатаДокумента = РеквизитыОснования.ДатаВыдачи;
//			ОписаниеОбъектаУчета = ЭлектронныеДокументыЭДО.ОписаниеОбъектаУчета(Основание, ВидДокумента);
//			ЗаполнитьПоОписаниюОбъектаУчета(ОписаниеОбъектаУчета, ТипДокумента);
//		Иначе
//			РеквизитыОснования = ИнтеграцияЭДО.ОписаниеОснованияЭлектронногоДокумента(Основание);
//			Объект.Организация = РеквизитыОснования.Организация;
//			Объект.Контрагент = РеквизитыОснования.Контрагент;
//			Объект.НомерДокумента = РеквизитыОснования.Номер;
//			Объект.ДатаДокумента = РеквизитыОснования.Дата;
//			Объект.СуммаДокумента = РеквизитыОснования.СуммаДокумента;
//			// БП: 000018657
//			Если Параметры.Свойство("НомерДокумента") Тогда
//				Объект.НомерДокумента = Параметры.НомерДокумента;
//			КонецЕсли;
//			Если Параметры.Свойство("ДатаДокумента") Тогда
//				Объект.ДатаДокумента = Параметры.ДатаДокумента;
//			КонецЕсли;
//			Если ЗначениеЗаполнено(ВидДокумента) Тогда
//				ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "ТипДокумента");
//			КонецЕсли;
//			// БП: 000018657

//			ОписаниеОбъектаУчета = ЭлектронныеДокументыЭДО.ОписаниеОбъектаУчета(Основание, ВидДокумента);
//			ЗаполнитьПоОписаниюОбъектаУчета(ОписаниеОбъектаУчета, ТипДокумента); 
//			
//			#Вставка
//			
//			Если ТипЗнч(Основание) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
//				
//				ТипДокумента =  Перечисления.ТипыДокументовЭДО.Договор;
//				
//			КонецЕсли;
//			
//			#КонецВставки
//			
//		КонецЕсли;

//	Иначе
//		ЗаполнитьЗначенияПоУмолчанию();
//	КонецЕсли;

//	// Если не было предварительной подготовки данных, то документ не может иметь тип "Договорный документ"
//	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.ДоговорныйДокумент Тогда
//		Объект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.Прочее);
//	КонецЕсли;

//	Если ЭлектронныеДокументыЭДО.ТипыДокументовПроизвольногоФормата().Найти(ТипДокумента) = Неопределено Тогда
//		ТипДокумента = Перечисления.ТипыДокументовЭДО.Прочее;
//	КонецЕсли;

//	Если Не ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
//		Объект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипДокумента);
//	КонецЕсли;

//	ПриИзмененииКлючевыхРеквизитов();

//	Объект.ИдентификаторДокументооборота = ЭлектронныеДокументыЭДО.НовыйИдентификаторДокументооборота();

//	Если ТипДокумента <> Перечисления.ТипыДокументовЭДО.МашиночитаемаяДоверенность Тогда
//		СвязанныеОбъектыУчета = Новый Массив;
//		Для Каждого ЭлементСпискаОснований Из Основания Цикл
//			СвязанныеОбъектыУчета.Добавить(ЭлементСпискаОснований.Значение);
//		КонецЦикла;
//		ЭлектронныеДокументыЭДО.ЗагрузитьИдентификаторыСвязанныхОбъектовУчета(Объект, СвязанныеОбъектыУчета);
//	КонецЕсли;

//	Объект.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Неформализованный;

//	Если Не ЗначениеЗаполнено(Объект.ДатаДокумента) Тогда
//		Объект.ДатаДокумента = ТекущаяДатаСеанса();
//	КонецЕсли;

//	СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеСформирован;

//	НастройкиСхемыРегламента = НастройкиСхемыРегламента();
//	ДанныеЭлементовСхемы = ИнтерфейсДокументовЭДО.НовыеДанныеЭлементовСхемы();
//	ЗаполнитьДанныеЭлементаСхемыИнформацияОтправителя(ДанныеЭлементовСхемы, ТипДокумента);

//	ИнтерфейсДокументовЭДО.ЗаполнитьСхемуРегламента(
//	НастройкиСхемыРегламента, ДанныеЭлементовСхемы, СхемаРегламента);

//	// БП: 000018657
//	Если Параметры.Свойство("СопроводительнаяЗаписка") Тогда
//		СопроводительнаяЗаписка = Параметры.СопроводительнаяЗаписка;
//		ИзмененаСопроводительнаяЗаписка = Истина;
//		ЭлементСхемы = СхемаРегламента.ПолучитьЭлементы()[0];
//		ЭлементСхемы.ДополнительнаяИнформация = СопроводительнаяЗаписка;
//	КонецЕсли;
//	// БП: 000018657

//КонецПроцедуры
