
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаПараметров", ЭтотОбъект);
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаВводаЗаявкиНаПеревозкуНаОснованииСделки", Новый Структура("Сделка", ПараметрКоманды),ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаПараметров(Рез, ДопПарам) Экспорт
	
	Если НЕ Рез = Неопределено Тогда
		
		ФормаДок = ПолучитьФорму("Документ.ЗаявкаАвтоперевозчику.Форма.ФормаДокумента");
		
		ФормаДок.Объект.Дата = ПолучитьДатуДО(Рез); 
		
		ФормаДок.Объект.Номер = ПолучитьНомерСделки(Рез);
		
		ФормаДок.Объект.ДокументОснование = Рез.Сделка;   
		
		ФормаДок.Объект.Организация = ПолучитьОрганизацию(Рез);
		
		ФормаДок.Объект.Груз = ПолучитьГруз(Рез);
		
		Если Рез.МассивКонтейнеров.Количество() > 0 Тогда
			
			ФормаДок.Объект.Вес = ПолучитьВес(Рез);
			
			ФормаДок.Объект.ВидТранспорта = ПолучитьВидТранспорта(Рез);
			
			ФормаДок.Объект.ДатаЗагрузки = ПолучитьДатуВывозаИзПорта(Рез);
			
			ФормаДок.Объект.Перевозчик = ПолучитьПеревозчика(Рез); 
			
			ФормаДок.Объект.Направление = ПолучитьНаправление(Рез);
			
			ФормаДок.Объект.Контейнеры = ПолучитьКонтейнеры(Рез);
			
			ФормаДок.Объект.Тариф = ПолучитьТариф(Рез);
				
		КонецЕсли;
		
		ФормаДок.Элементы.ДокументОснование.Видимость = Истина;  
		
		ФормаДок.Открыть(); 
		
	КонецЕсли;
	
КонецПроцедуры 

 &НаСервере
Функция ПолучитьНомерСделки(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Сделка.Номер;	
	
КонецФункции

&НаСервере
Функция ПолучитьОрганизацию(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Сделка.Организация;	
	
КонецФункции

&НаСервере
Функция ПолучитьГруз(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Сделка.Груз;	
	
КонецФункции  

&НаСервере
Функция ПолучитьВидТранспорта(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Сделка.ВидТранспорта;	
	
КонецФункции

&НаСервере
Функция ПолучитьДатуДО(ПараметрКоманды)
	
	Возврат ПараметрКоманды.МассивКонтейнеров[0].ДатаДО;	
	
КонецФункции 

&НаСервере
Функция ПолучитьТариф(ПараметрКоманды)
	
	Возврат ПараметрКоманды.МассивКонтейнеров[0].Ставка;	
	
КонецФункции

&НаСервере
Функция ПолучитьПеревозчика(ПараметрКоманды)
	
	Возврат ПараметрКоманды.МассивКонтейнеров[0].Перевозчик;	
	
КонецФункции

&НаСервере
Функция ПолучитьНаправление(ПараметрКоманды)
	
	Возврат ПараметрКоманды.МассивКонтейнеров[0].Направление;	
	
КонецФункции

&НаСервере
Функция ПолучитьДатуВывозаИзПорта(ПараметрКоманды)
	
	Возврат ПараметрКоманды.МассивКонтейнеров[0].ДатаВывозаИзПорта;	
	
КонецФункции 

&НаСервере
Функция ПолучитьКонтейнеры(ПараметрКоманды)
	
	СтрокаКонтейнеры = "";
	
	Для Каждого Стр Из ПараметрКоманды.МассивКонтейнеров Цикл
		
		Если СтрокаКонтейнеры = "" Тогда
			
			СтрокаКонтейнеры = Строка(Стр.Контейнер);
			
		Иначе
			
			СтрокаКонтейнеры = СтрокаКонтейнеры + ", " + Строка(Стр.Контейнер);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаКонтейнеры;
	
КонецФункции

&НаСервере
Функция ПолучитьВес(ПараметрКоманды)
	
	Вес = 0;
	
	Для Каждого Стр Из ПараметрКоманды.МассивКонтейнеров Цикл
		
		Вес = Вес + Стр.Вес;
		
	КонецЦикла;
	
	Возврат Вес;	
	
КонецФункции


