&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрКоманды);
	
	ОбъектыПечати = Новый СписокЗначений; 
	ИмяМакета = "ПоручениеЭкспедиторуАльтернативное"; 
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПоручениеЭкспедиторуНовое");
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Поручение экспедитору (новое)"; 
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуПорученияЭкспедитору(МассивОбъектов, ОбъектыПечати, ИмяМакета); 
	
	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуПорученияЭкспедитору(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоручениеЭкспедитору"; 
	ТабличныйДокумент.Защита = Истина;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументПоручениеЭкспедитору(ТабличныйДокумент, МассивОбъектов[0]); 	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументПоручениеЭкспедитору(ТабДок, Док)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_НовоеПоручениеЭкспедитору";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	|	ПоручениеЭкспедитору.Номер КАК Номер,
	|	ПоручениеЭкспедитору.Дата КАК Дата,
	|	ПоручениеЭкспедитору.Проведен КАК Проведен,
	|	ПоручениеЭкспедитору.Грузоотправитель КАК Грузоотправитель,
	|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	|	ПоручениеЭкспедитору.Грузополучатель КАК Грузополучатель,
	|	ПоручениеЭкспедитору.Договор КАК Договор,
	|	ПоручениеЭкспедитору.УведомитьСторонуОПрибытииГруза КАК УведомитьСторонуОПрибытииГруза,
	|	ПоручениеЭкспедитору.СтранаПроисхожденияГруза КАК СтранаПроисхожденияГруза,
	|	ПоручениеЭкспедитору.ТоварыГотовыеКОтправкеМестоИДата КАК ТоварыГотовыеКОтправкеМестоИДата,
	|	ПоручениеЭкспедитору.ВидТранспорта КАК ВидТранспорта,
	|	ПоручениеЭкспедитору.ПунктНазначения КАК ПунктНазначения,
	|	ПоручениеЭкспедитору.Страхование КАК Страхование,
	|	ПоручениеЭкспедитору.ТоварныйКод КАК ТоварныйКод,
	|	ПоручениеЭкспедитору.Маркировка КАК Маркировка,
	|	ПоручениеЭкспедитору.КоличествоМестВидУпаковки КАК КоличествоМестВидУпаковки,
	|	ПоручениеЭкспедитору.ВесБруттоНетто КАК ВесБруттоНетто,
	|	ПоручениеЭкспедитору.Объем КАК Объем,
	|	ПоручениеЭкспедитору.СтоимостьГруза КАК СтоимостьГруза,
	|	ПоручениеЭкспедитору.РазмерУпаковки КАК РазмерУпаковки,
	|	ПоручениеЭкспедитору.ТребуемыеДокументы КАК ТребуемыеДокументы,
	|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	|	ПоручениеЭкспедитору.ДатаПриложения КАК ДатаПриложения,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	|	ПоручениеЭкспедитору.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ПоручениеЭкспедитору.НеПечататьСтоимостьУслугВПоручении КАК НеПечататьСтоимостьУслугВПоручении,
	|	ПоручениеЭкспедитору.ДатаДо КАК ДатаДо,
	|	ПоручениеЭкспедитору.ПунктОтправления КАК ПунктОтправления,
	|	ПоручениеЭкспедитору.ДокументОснование.Ссылка КАК Документ
	|ИЗ
	|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	|ГДЕ
	|	ПоручениеЭкспедитору.Ссылка = &Док";
	
	Запрос.УстановитьПараметр("Док", Док);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.НовоеПоручениеЭкспедиторуДоработка");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		КонтИнформацияЭкспедитора = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Экспедитор,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,Выборка.ДатаПриложения,Истина);
		КонтИнформацияКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Выборка.ДатаПриложения,Истина);
		
		КонтИнформацияКлиентаАдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.АдресСклада, Выборка.ДатаПриложения,Истина);
		КонтИнформацияКлиентаПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты, Выборка.ДатаПриложения,Истина);
		КонтИнформацияКлиентаТелефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, Выборка.ДатаПриложения,Истина);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Страница");
		
		ОбластьМакета.Параметры.НомерДоговора = Выборка.НомерДоговора;     
		ДатаДоговора = Прав(Выборка.Договор,10); 
		ОбластьМакета.Параметры.ДатаДоговора = ДатаДоговора; 
		ОбластьМакета.Параметры.Дата = Формат(Выборка.Дата, "ДФ='dd.MM.yyyy""г.""'");
		ОбластьМакета.Параметры.Номер = Выборка.Номер;  
		ОбластьМакета.Параметры.Клиент = Строка(Выборка.Клиент);
		ОбластьМакета.Параметры.ЮридическийАдрес = Строка(КонтИнформацияКлиента);      		
		ОбластьМакета.Параметры.Телефон = КонтИнформацияКлиентаТелефон; 
		ОбластьМакета.Параметры.Почта = КонтИнформацияКлиентаПочта; 
		
		ОбластьМакета.Параметры.Грузоотправитель = Выборка.Грузоотправитель;  
		ОбластьМакета.Параметры.Грузополучатель = Выборка.Грузополучатель;
		ОбластьМакета.Параметры.ПунктОтправления = Выборка.ПунктОтправления; 
		ОбластьМакета.Параметры.ПунктНазначения = Выборка.ПунктНазначения;  
		ОбластьМакета.Параметры.ДиректорКлиента = Выборка.Клиент.ОсновноеКонтактноеЛицо;
		
		ФайлыПечатиИПодписи = Справочники.Организации.ПодписиИПечатиОрганизации(Выборка.Экспедитор, Выборка.ДатаПриложения);
		ОбластьМакета.Рисунки.Печать.Картинка = ФайлыПечатиИПодписи["ФаксимилеПечать"];
		ОбластьМакета.Рисунки.Подпись.Картинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"];
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции 

//заполнение старого макета ПорученияЭкспедитора

//&НаСервере
//Функция ЗаполнитьТабличныйДокументПоручениеЭкспедитору(ТабДок, Док) 	
		
	//УстановитьПривилегированныйРежим(Истина);
	//
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.АвтоМасштаб			= Истина;
	//ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	//ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Поручение_ЭкспедиторуАльтернативное";
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	//|	ПоручениеЭкспедитору.Номер КАК Номер,
	//|	ПоручениеЭкспедитору.Дата КАК Дата,
	//|	ПоручениеЭкспедитору.Проведен КАК Проведен,
	//|	ПоручениеЭкспедитору.Грузоотправитель КАК Грузоотправитель,
	//|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	//|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	//|	ПоручениеЭкспедитору.Грузополучатель КАК Грузополучатель,
	//|	ПоручениеЭкспедитору.Договор КАК Договор,
	//|	ПоручениеЭкспедитору.УведомитьСторонуОПрибытииГруза КАК УведомитьСторонуОПрибытииГруза,
	//|	ПоручениеЭкспедитору.СтранаПроисхожденияГруза КАК СтранаПроисхожденияГруза,
	//|	ПоручениеЭкспедитору.ТоварыГотовыеКОтправкеМестоИДата КАК ТоварыГотовыеКОтправкеМестоИДата,
	//|	ПоручениеЭкспедитору.ВидТранспорта КАК ВидТранспорта,
	//|	ПоручениеЭкспедитору.ПунктНазначения КАК ПунктНазначения,
	//|	ПоручениеЭкспедитору.Страхование КАК Страхование,
	//|	ПоручениеЭкспедитору.ТоварныйКод КАК ТоварныйКод,
	//|	ПоручениеЭкспедитору.Маркировка КАК Маркировка,
	//|	ПоручениеЭкспедитору.КоличествоМестВидУпаковки КАК КоличествоМестВидУпаковки,
	//|	ПоручениеЭкспедитору.ВесБруттоНетто КАК ВесБруттоНетто,
	//|	ПоручениеЭкспедитору.Объем КАК Объем,
	//|	ПоручениеЭкспедитору.СтоимостьГруза КАК СтоимостьГруза,
	//|	ПоручениеЭкспедитору.РазмерУпаковки КАК РазмерУпаковки,
	//|	ПоручениеЭкспедитору.ТребуемыеДокументы КАК ТребуемыеДокументы,
	//|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	//|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	//|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	//|	ПоручениеЭкспедитору.ОсобыеОтметки КАК ОсобыеОтметки,
	//|	ПоручениеЭкспедитору.НеПечататьСтоимостьУслугВПоручении КАК НеПечататьСтоимостьУслугВПоручении,
	//|	ПоручениеЭкспедитору.ДокументОснование КАК ДокументОснование
	//|ИЗ
	//|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	//|ГДЕ
	//|	ПоручениеЭкспедитору.Ссылка = &Док";
	//
	//Запрос.УстановитьПараметр("Док", Док);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//ПервыйДокумент = Истина;

	//Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
	//	
	//	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.ПоручениеЭкспедиторуНовый"); 
	//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.НовоеПоручениеЭкспедитору1");

	//	
	//	Если НЕ ПервыйДокумент Тогда
	//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	
	//	ПервыйДокумент = Ложь;
	//	
	//	// Запомним номер строки, с которой начали выводить текущий документ.
	//	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Страница");
	//	
	//	ОбластьМакета.Параметры.Номер = Выборка.Номер;
	//	ОбластьМакета.Параметры.Дата = Формат(Выборка.Дата, "ДФ='dd.MM.yyyy""г.""'"); 		
	//	
	//	СуммаАвтодоставка = 0;
	//	
	//	СуммаТерминальнаяОбработка = 0;
	//	
	//	Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
	//		
	//		//ОбластьМакета.Параметры.Коносамент = Выборка.ДокументОснование.Коносамент;	
	//		//ОбластьМакета.Параметры.УсловиеПоставки = Выборка.ДокументОснование.УсловиеПоставки;
	//		ОбластьМакета.Параметры.ДатаПрибытия = Формат(Выборка.ДокументОснование.ДатаПрибытия, "ДФ='dd.MM.yyyy""г.""'");
	//		//ОбластьМакета.Параметры.ПортОтгрузки = Выборка.ДокументОснование.ПортОтгрузки;
	//		//ОбластьМакета.Параметры.Груз = Выборка.ДокументОснование.Груз;
	//		
	//		СтрКонтейнеры = "";
	//		//
	//		//Для Каждого Стр Из Выборка.ДокументОснование.Контейнеры Цикл
	//		//	
	//		//	Если СтрКонтейнеры = "" Тогда   
	//		//		
	//		//		ОбластьМакета.Параметры.Контейнеры = Строка(Стр.Контейнер);
	//		//		
	//		//	Иначе  
	//		//		
	//		//		ОбластьМакета.Параметры.Контейнеры = СтрКонтейнеры + ", " + Строка(Стр.Контейнер);
	//		//		
	//		//	КонецЕсли;
	//		//	
	//		//КонецЦикла;
	//		
	//		//Для Каждого Стр Из Выборка.ДокументОснование.РасходыКлиента Цикл
	//		//	
	//		//	Если СтрНайти(ВРЕГ(Строка(Стр.Номенклатура)), "АВТОДОСТАВКА") > 0 Тогда
	//		//		
	//		//		СуммаАвтодоставка = СуммаАвтодоставка + Стр.Сумма;
	//		//		
	//		//	ИначеЕсли СтрНайти(ВРЕГ(Строка(Стр.Номенклатура)), "ТЕРМИНАЛЬНАЯ ОБРАБОТКА") > 0 Тогда
	//		//		
	//		//		СуммаТерминальнаяОбработка = СуммаТерминальнаяОбработка + Стр.Сумма;
	//		//		
	//		//	КонецЕсли;
	//		//	
	//		//КонецЦикла;
	//		
	//		ТЗ = Новый ТаблицаЗначений;
	//		ТЗ.Колонки.Добавить("Направление");
	//		
	//		Для Каждого Стр Из Выборка.ДокументОснование.ИнформацияОПеревозчиках Цикл
	//			
	//			СтрТЗ = ТЗ.Добавить();
	//			СтрТЗ.Направление = Стр.Направление;
	//			
	//		КонецЦикла;
	//		
	//		ТЗ.Свернуть("Направление"); 
	//		
	//		Направления = "";
	//		
	//		Маршрут = "";
	//		
	//		Для Каждого СтрТЗ Из ТЗ Цикл
	//			
	//			Если Направления = "" Тогда
	//				
	//				Направления = Строка(СтрТЗ.Направление);
	//				
	//			Иначе
	//				
	//				Направления = Направления + ", " + Строка(СтрТЗ.Направление);
	//				
	//			КонецЕсли;
	//			
	//			Если Маршрут = "" Тогда
	//				
	//				Маршрут = Строка(Выборка.ДокументОснование.ПортОтгрузки) + " - " + Строка(СтрТЗ.Направление);
	//				
	//			Иначе
	//				
	//				Маршрут = Маршрут + ", " + Строка(Выборка.ДокументОснование.ПортОтгрузки) + " - " + Строка(СтрТЗ.Направление);
	//				
	//			КонецЕсли;
	//			
	//		КонецЦикла;
	//		
	//		//ОбластьМакета.Параметры.Направление = Направления;
	//		ОбластьМакета.Параметры.Маршрут = Маршрут;
	//		
	//	КонецЕсли;  
	//	//ОбластьМакета.Параметры.Сумма = Выборка.Сумма; восстановить
	//	//ОбластьМакета.Параметры.СуммаАвтодоставка = Формат(СуммаАвтодоставка,"ЧДЦ=2; ЧГ=; ЧФ='Ч"" руб.""'");
	//	//ОбластьМакета.Параметры.СуммаТерминальнаяОбработка = Формат(СуммаТерминальнаяОбработка,"ЧДЦ=2; ЧГ=; ЧФ='Ч"" руб.""'");
	//	//
	//	//ОбластьМакета.Параметры.ГрузовыеМеста = ?(ЗначениеЗаполнено(Выборка.КоличествоМестВидУпаковки), Выборка.КоличествоМестВидУпаковки + " мест ", "") + ?(ЗначениеЗаполнено(Выборка.ВесБруттоНетто), Выборка.ВесБруттоНетто + " кг ", "") + ?(ЗначениеЗаполнено(Выборка.Объем), Выборка.Объем + " м3", "");
	//	//ОбластьМакета.Параметры.СтранаПроисхожденияГруза = Выборка.СтранаПроисхожденияГруза;
	//	ОбластьМакета.Параметры.Грузоотправитель = Выборка.Грузоотправитель;
	//	ОбластьМакета.Параметры.Грузополучатель = Выборка.Грузополучатель;
	//	
	//	ФайлыПечатиИПодписи = Справочники.Организации.ПодписиИПечатиОрганизации(Выборка.Экспедитор, Выборка.Дата);
	//	
	//	ОбластьМакета.Рисунки.Печать.Картинка = ФайлыПечатиИПодписи["ФаксимилеПечать"];
	//	ОбластьМакета.Рисунки.Подпись.Картинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"];	
	//	
	//	//ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Выборка.Экспедитор, Выборка.Дата, Неопределено);
	//	//ОбластьМакета.Параметры.ФИОРуководителяЭкспедитора = ОтветственныеЛицаОрганизации.РуководительПредставление;
	//	//
	//	//ОбластьМакета.Параметры.ЭкспедиторскоеСопровождение = "5 000";
	//	
	//	//ОбластьМакета.Параметры.Заказчик = "ООО «ЮГМАКС»";
	//	//ОбластьМакета.Параметры.КоносаментВладелец = "ООО «КАРГО СТАР»";
	//	//ОбластьМакета.Параметры.НомерДоговора = "№ ТЭО-22/24 от «03» мая 2024г.";
	//	
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//КонецЦикла;
	//
	//ТабличныйДокумент.АвтоМасштаб = Истина;
	//ТабличныйДокумент.Защита = Ложь;
	//
	//Возврат ТабличныйДокумент; 
	
	//КонецФункции
