
&НаКлиенте
Процедура ОК(Команда)
	
	Если ЗначениеЗаполнено(ВидФайла) Тогда
		
		ИзменитьВидФайла(); 
		
		ЭтаФорма.ВладелецФормы.Элементы.Список.Обновить();
		
		ЭтаФорма.Закрыть();
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения();
		
		ПоказатьПредупреждение(ОписаниеОповещения, "Не указан вид файла", 60, "Ошибка");		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаФайл = Параметры.СсылкаНаФайл;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидФайла()
	
	Файл = СсылкаНаФайл.ПолучитьОбъект();
	
	Файл.ВидФайла = ВидФайла;
	
	Файл.Записать();
	
КонецПроцедуры