&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Контрагенты",КонтрагентПоПользователю());
КонецПроцедуры

&НаСервере
Функция КонтрагентПоПользователю()
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	МассивКонтрагентов = ТекПользователь.ДоступныеКонтрагенты.ВыгрузитьКолонку("Контрагент");
	
	Возврат МассивКонтрагентов;
	
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

    ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	ИмяФайла = "";
	Если Поле.Заголовок = "Счет" Тогда
		Ссылка = ПолучитьСчет(ПолучитьНомер(ТекДанные.ПредставлениеСчет));
		ИмяФайла = ТекДанные.ПредставлениеСчет;
		ТабличныйДокумент = ТабДокСчет(Ссылка);
	ИначеЕсли Поле.Заголовок = "Акт" Тогда
		Если СтрНайти(ТекДанные.ПредставлениеАкт,"Отчет") = 0 Тогда
			Ссылка = ПолучитьАкт(ПолучитьНомер(ТекДанные.ПредставлениеАкт));
			Если СтрНайти(ТекДанные.ПредставлениеАкт, "УПД") Тогда
				ТабличныйДокумент = ТабДокУПД(Ссылка);
			Иначе
				ТабличныйДокумент = ТабДокАкт(Ссылка);
			КонецЕсли;
		Иначе
			Ссылка = ПолучитьОтчетКомитенту(ПолучитьНомер(ТекДанные.ПредставлениеАкт));
			//ТабличныйДокумент = ТабДокОтчет(Ссылка);
		КонецЕсли;
		ИмяФайла = ТекДанные.ПредставлениеАкт;
	ИначеЕсли Поле.Заголовок = "Счет-фактура" Тогда
		Ссылка = ПолучитьСФ(ПолучитьНомер(ТекДанные.ПредставлениеСФ));
		ИмяФайла = ТекДанные.ПредставлениеСФ;
		//ТабличныйДокумент = ТабДокСФ(Ссылка);
	КонецЕсли;
	
	ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла)
	
	ВремФайл = ОбработатьИмяВремФайла(ПолучитьИмяВременногоФайла("pdf"), ИмяФайла);
	
	ТабличныйДокумент.Записать(ВремФайл,ТипФайлаТабличногоДокумента.PDF);
	Файл = Новый Файл(ВремФайл);
	
	ДД = Новый ДвоичныеДанные(Файл.ПолноеИмя);
	
	СсылкаНаФайл = ПоместитьВоВременноеХранилище(ДД, Новый УникальныйИдентификатор);
	
	СтруктураФайла = Новый Структура;
	СтруктураФайла.Вставить("ДвоичныеДанные", ДД);
	СтруктураФайла.Вставить("ИмяФайла", Файл.Имя);
	СтруктураФайла.Вставить("ПутьФайла", Файл.ПолноеИмя);
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(СтруктураФайла);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивФайлов",МассивФайлов);
	
	#Если ВебКлиент Тогда
		
		ПодключитьРасширениеРаботыСФайламиНаКлиенте(Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Истина, СтруктураВозврата.МассивФайлов));
		
	#КонецЕсли
	
	#Если НЕ ВебКлиент Тогда
		
		Если СтруктураВозврата.МассивФайлов.Количество() > 0 Тогда
			
			Попытка
				
				//СсылкаНаФайл = ПолучитьСсылкуНаФайл(СтруктураВозврата.МассивФайлов);
				
				Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
					
					ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
					
					Возврат; 
					
				КонецЕсли;
				
				ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
				ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
				ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
				
				
				НачатьПолучениеФайлаССервера(СсылкаНаФайл, Файл.Имя, ПараметрыДиалогаПолученияФайлов);
				
			Исключение	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
				Сообщение.Сообщить();  
				
			КонецПопытки;
			
		КонецЕсли;
		
	#КонецЕсли	
	
КонецПроцедуры

&НаСервере
Функция ОбработатьИмяВремФайла(Стр, ИмяФайла)
	Массив = СтрРазделить(Стр,"\");
	ИтогСтр = "";
	Для Каждого Зн Из Массив Цикл
		
		Если СтрНайти(Зн,".pdf") Тогда
			
			Зн = ИмяФайла+".pdf";	
			
		КонецЕсли;
		
		ИтогСтр = ИтогСтр + "\" + Зн;
		
	КонецЦикла;
	
	Возврат ИтогСтр;
	
КонецФункции

Функция ПолучитьНомер(Номер)
	ИтогСтр = СтрЗаменить(Номер,"Счет №", "");
	ИтогСтр = СтрЗаменить(ИтогСтр,"Акт №", "");
	ИтогСтр = СтрЗаменить(ИтогСтр,"УПД №", "");
	ИтогСтр = СтрЗаменить(ИтогСтр,"Счет-фактура №", "");
	ИтогСтр = СтрЗаменить(ИтогСтр,"Отчет №", "");
	
	Возврат СокрЛП(ИтогСтр);
КонецФункции

&НаСервере
Функция ПолучитьСчет(НомерСчета)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	                      |ГДЕ
	                      |	СчетНаОплатуПокупателю.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Номер", НомерСчета);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат	Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСФ(НомерСчета)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетФактураВыданный.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	                      |ГДЕ
	                      |	СчетФактураВыданный.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Номер", НомерСчета);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат	Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьАкт(НомерАкта)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |ГДЕ
	                      |	РеализацияТоваровУслуг.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Номер", НомерАкта);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат	Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьОтчетКомитенту(НомерАкта)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	                      |ГДЕ
	                      |	ОтчетКомитентуОПродажах.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Номер", НомерАкта);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат	Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ТабДокУПД(Сф)	
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Сф);
	
	НастройкиПечати = УчетНДСВызовСервера.ПолучитьНастройкиПечатиУниверсальныхПередаточныхДокументов(
	МассивОбъектов);
	
	ЕстьСчетаФактурыВыданные   = Ложь;
	ЕстьСчетаФактурыПолученные = Ложь;
	
	Для каждого Объект Из НастройкиПечати.УниверсальныеПередаточныеДокументы Цикл
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ЕстьСчетаФактурыВыданные = Истина;
			Прервать;
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			ЕстьСчетаФактурыПолученные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(НастройкиПечати.СписокМакетов) = Тип("Строка") Тогда
		ИменаМакетов = СтрРазделить(НастройкиПечати.СписокМакетов,",");	
	КОнецЕсли;
	
	ТекстЗапроса = "";
	ОбъектыПечати = Новый СписокЗначений();
	ТаблицаМакетовУПД = УчетНДС.ТаблицаМакетовУПД(); 
	ПараметрыПечати = ПолучитьПараметрыПечати();
	ВременнаяКоллекцияДляОднойПечатнойФормы = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(НастройкиПечати.СписокМакетов);
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	Для Каждого МакетУПД ИЗ ТаблицаМакетовУПД Цикл 
		Если МакетУПД.Статус <> "1" Тогда
			Продолжить;
		КонецЕсли; 
		
		Если УправлениеПечатью.НужноПечататьМакет(ВременнаяКоллекцияДляОднойПечатнойФормы, МакетУПД.ИДМакета) Тогда
			Если ЕстьСчетаФактурыВыданные Тогда
				ТекстЗапроса = Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(
				МакетУПД.ВерсияПостановленияНДС1137, Истина, МакетУПД.ПрослеживаемыеТовары);
			Иначе
				ТекстЗапроса = Документы.СчетФактураПолученный.ТекстЗапросаПечатьСчетовФактур(
				МакетУПД.ВерсияПостановленияНДС1137, МакетУПД.ПрослеживаемыеТовары);
			КонецЕсли;
			
			СтруктураПараметровПечати = УчетНДС.НовыйСтруктураПараметровПечатиУПД_УКД();
			СтруктураПараметровПечати.МассивОбъектов              = НастройкиПечати.УниверсальныеПередаточныеДокументы;
			СтруктураПараметровПечати.ОбъектыПечати               = ОбъектыПечати;
			СтруктураПараметровПечати.ТекстЗапросаДокументам      = ТекстЗапроса;
			СтруктураПараметровПечати.ТолькоПередаточныйДокумент  = Ложь;
			СтруктураПараметровПечати.ТабДокумент                 = Неопределено;
			СтруктураПараметровПечати.ПараметрыПечати             = ПараметрыПечати;
			СтруктураПараметровПечати.КлючПараметровПечати        = МакетУПД.КлючПараметровПечати;
			СтруктураПараметровПечати.ПолныйПутьКМакету           = МакетУПД.ПолныйПутьКМакету;
			СтруктураПараметровПечати.ПараметрыВывода             = ПараметрыВывода;
			
			ТабличныйДокумент = УчетНДС.ПечатьУниверсальныхПередаточныхДокументов(СтруктураПараметровПечати);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
		
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокСчет(Сч)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	ПараметрыПечати.Вставить("ВыводитьКоносамент",Истина);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Сч);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	СоответствиеСчетовРеализациям = Неопределено;
	ДокументыБезСчетовНаОплату = Неопределено;
	ТаблицаСведенийСчетНаОплату = Документы.СчетНаОплатуПокупателю.ПолучитьТаблицуСведенийСчетаНаОплату(
			МассивОбъектов, СоответствиеСчетовРеализациям, ДокументыБезСчетовНаОплату);
	
	ТабличныйДокумент = ПечатьТорговыхДокументов.ПечатьСчетаНаОплату(ТаблицаСведенийСчетНаОплату,ОбъектыПечатиВрем,ПараметрыПечати);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокАкт(Акт)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВидДокументаПечати",  "РеализацияТоваровУслуг");
	ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Акт");
	ПараметрыПечати.Вставить("ИмяМакетаПечати",     "Документ.РеализацияТоваровУслуг.ПФ_MXL_Акт");
	ПараметрыПечати.Вставить("ВыводитьКоносамент", Истина);
	ПараметрыПечати.Вставить("ОтслеживатьОригинал", Истина); 
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Акт);
	
	ТаблицаСведенийАктаОбОказанииУслуг = Документы.РеализацияТоваровУслуг.ПолучитьТаблицуСведенийАктаОбОказанииУслуг(МассивОбъектов);
	
	ТабличныйДокумент = ПечатьТорговыхДокументов.ПечатьАктаОбОказанииУслуг(ТаблицаСведенийАктаОбОказанииУслуг, ОбъектыПечати, ПараметрыПечати);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Процедура ОбработатьФаксимилеТабДок(ТабличныйДокумент)

	ФайлыПечатиИПодписи = Справочники.Организации.ПодписиИПечатиОрганизации(Справочники.Организации.ОрганизацияПоУмолчанию(), ТекущаяДата());
	
	Для Каждого Рис ИЗ ТабличныйДокумент.Рисунки Цикл
				
		Если СтрНайти(Рис.Имя,"Печать") <> 0 И ФаксимилеИспользуется Тогда
			Рис.Картинка = ФайлыПечатиИПодписи["ФаксимилеПечать"];
		ИначеЕсли СтрНайти(Рис.Имя,"Руководитель") <> 0 И ФаксимилеИспользуется Тогда
			Рис.Картинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"];
		Иначе
			Рис.ВыводитьНаПечать = Ложь;	
		КОнецЕсли;
		
		Рис.ГраницаСверху = Ложь;
		Рис.ГраницаСлева = Ложь;
		Рис.ГраницаСнизу = Ложь;
		Рис.ГраницаСправа = Ложь;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПечати()
	
	ПараметрыПечати = Новый Структура;
	
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", ЛОЖЬ);
	ПараметрыПечати.Вставить("ИдентификаторВКомплекте", "УниверсальныйПередаточныйДокументКомплект");
	ПараметрыПечати.Вставить("ОтслеживатьОригинал", Истина);
	
	Возврат ПараметрыПечати;
	
КонецФункции

&НаСервере
Функция ПолучитьРез()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |ГДЕ
	                      |	РеализацияТоваровУслуг.Номер = &Номер");
	Запрос.УстановитьПараметр("Номер", "ДЦ00-000003");
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;	
	КонецЕсли;	

КОнецФункции

&НаКлиенте
Процедура ПослеПодключенияРасширения(Подключено, ДопПараметры) Экспорт
	
	Если Подключено Тогда
		
		Попытка
			Если ДопПараметры.МассивФайлов.Количество <> 0 Тогда 
				ДанныеФайла = ДопПараметры.МассивФайлов[0];
				СсылкаНаФайл = ПоместитьВоВременноеХранилище(ДанныеФайла.ДвоичныеДанные, Новый УникальныйИдентификатор);
			КонецЕсли;
			
			//СсылкаНаФайл = ПолучитьСсылкуНаФайл(ДопПараметры.МассивФайлов);
			
			Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
				
				ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
				
				Возврат; 
				
			КонецЕсли;
			
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
			
			НачатьПолучениеФайлаССервера(СсылкаНаФайл, ДанныеФайла.ИмяФайла, ПараметрыДиалогаПолученияФайлов);
			
		Исключение	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
			Сообщение.Сообщить();  
			
		КонецПопытки;	
		
	ИначеЕсли ДопПараметры.УстановитьЕслиНеПодключено Тогда
		
		НачатьУстановкуРасширенияРаботыСФайлами(
            Новый ОписаниеОповещения(
                "ПодключитьРасширениеРаботыСФайламиНаКлиенте",
                ЭтотОбъект,
                Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Ложь, ДопПараметры.МассивФайлов)));
		
	Иначе
		
		ПоказатьПредупреждение( , НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодключитьРасширениеРаботыСФайламиНаКлиенте(ДопПараметры) Экспорт
	
	ОповещениеОПодключенииРасширенияРаботыСФайлами = Новый ОписаниеОповещения("ПослеПодключенияРасширения", ЭтотОбъект, ДопПараметры);
	
	НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеОПодключенииРасширенияРаботыСФайлами);
	
КонецПроцедуры








