
&НаСервере
Функция СформироватьОтчетНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	
	
	Макет = Обработки.ОтчетНачисленияПремийПоСделкам.ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТЧ");
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сделка.Ссылка КАК Сделка,
		|	Сделка.Контрагент КАК Контрагент,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделка_1.Ссылка) КАК Номер
		|ПОМЕСТИТЬ ВТ_НомераСделок
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка_1
		|		ПО Сделка.МоментВремени >= Сделка_1.МоментВремени
		|			И Сделка.Контрагент = Сделка_1.Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	Сделка.Контрагент,
		|	Сделка.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаОплатуПоставщикаТовары.Ссылка КАК Ссылка,
		|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК СделкаСсылка,
		|	СчетНаОплатуПоставщикаТовары.Номенклатура КАК Номенклатура,
		|	СчетНаОплатуПоставщикаТовары.Ссылка.Контрагент КАК Контрагент,
		|	СчетНаОплатуПоставщикаТовары.Ссылка.Номер КАК Номер,
		|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения КАК СуммаРаспределения,
		|	СчетНаОплатуПоставщикаТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
		|	СтатусыДокументов.Статус КАК СтатусОплаты
		|ПОМЕСТИТЬ ВТ_СчетПоставщикаСделки
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
		|		ПО СчетНаОплатуПоставщикаТовары.Ссылка = СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка
		|			И (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
		|		ПО (СтатусыДокументов.Документ = СчетНаОплатуПоставщикаТовары.Ссылка)
		|			И СчетНаОплатуПоставщикаТовары.Ссылка.Организация = СтатусыДокументов.Организация
		|ГДЕ
		|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка ЕСТЬ НЕ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка КАК Ссылка,
		|	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка КАК Сделка,
		|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения КАК СуммаРаспределения,
		|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка.Номер КАК Номер,
		|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка.ДокументОснование КАК ДокументОснование,
		|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка.ВалютаДокумента КАК ВалютаДокумента
		|ПОМЕСТИТЬ ВТ_АктПоставщика
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
		|		ПО ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка
		|			И ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи
		|ГДЕ
		|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка ЕСТЬ НЕ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаРасходыКлиента.Ссылка КАК СделкаСсылка,
		|	СделкаРасходыКлиента.Номенклатура КАК Номенклатура,
		|	СделкаРасходыКлиента.СчетНаОплату КАК СчетНаОплату,
		|	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
		|	СтатусыДокументов.Статус КАК Статус,
		|	СчетНаОплатуПокупателюТовары.Ссылка.ВалютаДокумента КАК ВалютаСчетПокупателю
		|ПОМЕСТИТЬ ВТ_СчетПокупателюСделки
		|ИЗ
		|	Документ.Сделка.РасходыКлиента КАК СделкаРасходыКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
		|			ПО (СтатусыДокументов.Организация = СчетНаОплатуПокупателюТовары.Ссылка.Организация)
		|				И (СтатусыДокументов.Документ = СчетНаОплатуПокупателюТовары.Ссылка.Ссылка)
		|		ПО СделкаРасходыКлиента.СчетНаОплату = СчетНаОплатуПокупателюТовары.Ссылка
		|			И СделкаРасходыКлиента.Номенклатура = СчетНаОплатуПокупателюТовары.Номенклатура
		|ГДЕ
		|	СделкаРасходыКлиента.СчетНаОплату ЕСТЬ НЕ NULL 
		|	И СделкаРасходыКлиента.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СчетПокупателюСделки.СчетНаОплату КАК СчетНаОплату,
		|	ВТ_СчетПокупателюСделки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугУслуги.Ссылка.Дата КАК Дата,
		|	РеализацияТоваровУслугУслуги.Сумма КАК Сумма,
		|	ВТ_СчетПокупателюСделки.СделкаСсылка КАК СделкаСсылка
		|ПОМЕСТИТЬ ВТ_АктЗаказчика
		|ИЗ
		|	ВТ_СчетПокупателюСделки КАК ВТ_СчетПокупателюСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ПО (РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю = ВТ_СчетПокупателюСделки.СчетНаОплату)
		|			И ВТ_СчетПокупателюСделки.Номенклатура = РеализацияТоваровУслугУслуги.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаРасходыКлиента.Ссылка КАК Ссылка,
		|	ВТ_НомераСделок.Номер КАК НомерСделкиПоКонтрагенту,
		|	СделкаРасходыКлиента.Ссылка.Вид КАК ВидСделки,
		|	СделкаРасходыКлиента.Ссылка.Контрагент КАК КонтрагентЗаказчик,
		|	СделкаРасходыКлиента.Ссылка.Номер КАК НомерСделки,
		|	СделкаРасходыКлиента.Номенклатура КАК Номенклатура,
		|	СделкаРасходыКлиента.Ссылка.Дата КАК Дата,
		|	СделкаРасходыКлиента.Ссылка.Менеджер КАК Менеджер,
		|	ВТ_СчетПоставщикаСделки.Контрагент КАК КонтрагентПоставщик,
		|	ВТ_СчетПоставщикаСделки.Номер КАК НомерСчетПоставщика,
		|	ЕСТЬNULL(ВТ_СчетПоставщикаСделки.СуммаРаспределения, 0) КАК СуммаСчетПоставщика,
		|	ВТ_СчетПоставщикаСделки.ВалютаДокумента КАК ВалютаСчетПоставщика,
		|	ВТ_СчетПоставщикаСделки.СтатусОплаты КАК СтатусОплатыСчетПоставщика,
		|	ВТ_АктПоставщика.Номер КАК НомерАкта,
		|	ЕСТЬNULL(ВТ_АктПоставщика.СуммаРаспределения, 0) КАК СуммаАкт,
		|	ВТ_АктПоставщика.ВалютаДокумента КАК ВалютаАкт,
		|	ВТ_СчетПокупателюСделки.СчетНаОплату.Номер КАК СчетНаОплатуНомер,
		|	ЕСТЬNULL(ВТ_СчетПокупателюСделки.Сумма, 0) КАК СуммаСчетИсх,
		|	ВТ_СчетПокупателюСделки.ВалютаСчетПокупателю КАК ВалютаСчетИсх,
		|	ВЫБОР
		|		КОГДА ВТ_СчетПокупателюСделки.СчетНаОплату.Номер ЕСТЬ НЕ NULL 
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_СчетПокупателюСделки.Статус, &СтатусОплатыПоУмолчанию) КАК Перечисление.СтатусОплатыСчета)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК СтатусИсхСчет,
		|	ВТ_АктЗаказчика.Дата КАК ДатаАктЗаказчик,
		|	ЕСТЬNULL(ВТ_АктЗаказчика.Сумма, 0) КАК СуммаАктЗаказчик
		|ИЗ
		|	Документ.Сделка.РасходыКлиента КАК СделкаРасходыКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетПоставщикаСделки КАК ВТ_СчетПоставщикаСделки
		|		ПО СделкаРасходыКлиента.Ссылка = ВТ_СчетПоставщикаСделки.СделкаСсылка
		|			И (ВТ_СчетПоставщикаСделки.Номенклатура = СделкаРасходыКлиента.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераСделок КАК ВТ_НомераСделок
		|		ПО (ВТ_НомераСделок.Сделка = СделкаРасходыКлиента.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктПоставщика КАК ВТ_АктПоставщика
		|		ПО СделкаРасходыКлиента.Ссылка = ВТ_АктПоставщика.Сделка
		|			И СделкаРасходыКлиента.Номенклатура = ВТ_АктПоставщика.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетПокупателюСделки КАК ВТ_СчетПокупателюСделки
		|		ПО (ВТ_СчетПокупателюСделки.СделкаСсылка = СделкаРасходыКлиента.Ссылка)
		|			И (ВТ_СчетПокупателюСделки.Номенклатура = СделкаРасходыКлиента.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктЗаказчика КАК ВТ_АктЗаказчика
		|		ПО СделкаРасходыКлиента.Ссылка = ВТ_АктЗаказчика.СделкаСсылка
		|			И (ВТ_АктЗаказчика.Номенклатура = СделкаРасходыКлиента.Номенклатура)
		|ГДЕ
		|	СделкаРасходыКлиента.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", ЭтотОбъект.ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ЭтотОбъект.ПериодОтчета.ДатаОкончания);
	Запрос.УстановитьПараметр("СтатусОплатыПоУмолчанию", Перечисления.СтатусОплатыСчета.НеОплачен);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	//ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
		
		Профит = Выборка.СуммаСчетИсх - Выборка.СуммаАкт;
		
		ОбластьСтрокаТЧ.Параметры.Клиент = Выборка.КонтрагентЗаказчик;
		ОбластьСтрокаТЧ.Параметры.НомСделки = Выборка.НомерСделки;
		ОбластьСтрокаТЧ.Параметры.Номенклатура = Выборка.Номенклатура;
		ОбластьСтрокаТЧ.Параметры.ДатаСделки = Выборка.Дата;
		ОбластьСтрокаТЧ.Параметры.Подрядчик = Выборка.КонтрагентПоставщик;
		ОбластьСтрокаТЧ.Параметры.ВходящийСчет = Выборка.НомерСчетПоставщика;
		ОбластьСтрокаТЧ.Параметры.СуммаВходСчета = Выборка.СуммаСчетПоставщика;
		ОбластьСтрокаТЧ.Параметры.ВалютаПоставщик = Выборка.ВалютаСчетПоставщика;
		ОбластьСтрокаТЧ.Параметры.ОплатаСчетаВход = Выборка.СтатусОплатыСчетПоставщика;
		ОбластьСтрокаТЧ.Параметры.ВходАКТ = Выборка.НомерАкта;
		ОбластьСтрокаТЧ.Параметры.СуммаВходАкт = Выборка.СуммаАкт;
		ОбластьСтрокаТЧ.Параметры.ВалютаВходАкт = Выборка.ВалютаАкт;
		ОбластьСтрокаТЧ.Параметры.ИсходящийСчет = Выборка.СчетНаОплатуНомер;
		ОбластьСтрокаТЧ.Параметры.СуммаИсхСчет = Выборка.СуммаСчетИсх;
		ОбластьСтрокаТЧ.Параметры.ВалютаИсхСчет = Выборка.ВалютаСчетИсх;
		ОбластьСтрокаТЧ.Параметры.ОплатаИсхСчет = Выборка.СтатусИсхСчет;
		ОбластьСтрокаТЧ.Параметры.СуммаИсхАкт = Выборка.СуммаАктЗаказчик;
		ОбластьСтрокаТЧ.Параметры.ДатаИсхАкт = Выборка.ДатаАктЗаказчик;
		ОбластьСтрокаТЧ.Параметры.Профит = Профит;
		ОбластьСтрокаТЧ.Параметры.Менеджер = Выборка.Менеджер;
		ОбластьСтрокаТЧ.Параметры.ПремияРОП = Выборка.СуммаСчетИсх * 0.04;
		ОбластьСтрокаТЧ.Параметры.ПремияРОД = Выборка.СуммаСчетИсх * 0.04;
		
		Если Профит > 0 Тогда
			ОбластьСтрокаТЧ.Параметры.ПремияМенеджер = ?(Выборка.НомерСделкиПоКонтрагенту = 1, Профит*0.15, Профит*0.075);
		КонецЕсли;
		
		Если Выборка.ВидСделки <> Перечисления.ВидыСделок.Декларирование И Профит > 0 Тогда
			
			// Расчет премии отдела работы с клиентами (ОРК)
			ОбластьСтрокаТЧ.Параметры.ПремияОРК = Профит * 0.06;                  
			
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьСтрокаТЧ);
		
	КонецЦикла;

   Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)

	Если ЗначениеЗаполнено(ПериодОтчета.ДатаНачала) И ЗначениеЗаполнено(ПериодОтчета.ДатаОкончания) Тогда
		
		Если ПериодОтчета.ДатаНачала <= ПериодОтчета.ДатаОкончания Тогда
			
			КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ОтчетНачисленияПремийПоСделкам");    
			// Добавляем в коллекцию (тип массив) сформированный Табличный документ
			КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьОтчетНаСервере(); 
			// если требуется устанавливаем параметры печати
			КоллекцияПечатныхФорм[0].СинонимМакета = "Сводка по выручке и профитам по клиентам";
			
			КоллекцияПечатныхФорм[0].Экземпляров = 1;
			
			УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);  
			
			
		Иначе 
			
			Сообщить("Невозможно вывести отчет: конец периода должен быть больше начала периода");  
			
		КонецЕсли; 
		
	Иначе
		
		Сообщить("Невозможно вывести отчет: период должен быть заполнен");
		
	КонецЕсли;

КонецПроцедуры
