
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	СтандартнаяОбработка = Ложь;  
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("Номенклатура", Элементы.Список.ТекущиеДанные.Номенклатура);
	ПараметрыДанных.Вставить("Перевыставляемый", Элементы.Список.ТекущиеДанные.Перевыставляемый);
	
	ЭтаФорма.Закрыть();
	
	Оповестить("ПодборРасходыКлиента", ПараметрыДанных, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	//Оповестить("ПодборРасходыКлиента", Элементы.Список.ТекущиеДанные.Номенклатура, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда) 
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("Номенклатура", Элементы.Список.ТекущиеДанные.Номенклатура);
	ПараметрыДанных.Вставить("Перевыставляемый", Элементы.Список.ТекущиеДанные.Перевыставляемый);


	ЭтаФорма.Закрыть();
	
    Оповестить("ПодборРасходыКлиента", ПараметрыДанных, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	//Оповестить("ПодборРасходыКлиента", Элементы.Список.ТекущиеДанные.Номенклатура, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	
КонецПроцедуры
