
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
		
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодстатусБухгалтерия"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	СписокПодстатусовБухгалтерия = Новый Массив;
	
	СписокПодстатусовБухгалтерия.Добавить(Перечисления.ПодстатусыБухгалтерияСделок.ВОбработке);
	СписокПодстатусовБухгалтерия.Добавить(Перечисления.ПодстатусыБухгалтерияСделок.Выставить);
	
	ЭлементОтбора.ПравоеЗначение = СписокПодстатусовБухгалтерия;
	
	УсловияОтбораГруппойИли = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    УсловияОтбораГруппойИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	УсловияОтбораГруппойИли.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	
	ЭлементОтбора = УсловияОтбораГруппойИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;  
	
	СписокСтатусов = Новый СписокЗначений;
	 
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Выгружен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Вывезен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Доставлен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.СданПорожний);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВПорту);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыходИзПорта);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.НаПодходе);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ГотовКВывозу);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.SWBОформлен);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыставленыВсеРасходы);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ДокументыПодготовлены);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ПретензияСуд);
	СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Закрыта);
	
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов;

	
	УсловияОтбораГруппойИ = УсловияОтбораГруппойИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    УсловияОтбораГруппойИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	УсловияОтбораГруппойИ.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; 
	
	ЭлементОтбора = УсловияОтбораГруппойИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Фрахт"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
    ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусФрахта.Наш; 
	
	
	ЭлементОтбора = УсловияОтбораГруппойИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;  	
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыСделок.НаПодходе;
		
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НетСтавки"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	Если Параметры.Свойство("Страница") Тогда
		
		Если ЗначениеЗаполнено(Параметры.Страница) Тогда
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[Параметры.Страница];
			
		КонецЕсли;
		
	КонецЕсли;  
	
	ЭлементОтбора = СписокВыполненные.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	ЭлементОтбора.ПравоеЗначение = СписокСтатусов;
	
	ЭлементОтбора = СписокВыполненные.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодстатусБухгалтерия"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.ПодстатусыБухгалтерияСделок.Выполнено;
	
	ЭлементОтбора = СписокПрофитыИОплата.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	
	СписокСтатусовПрофитыИОплата = Новый СписокЗначений;
	СписокСтатусовПрофитыИОплата.Добавить(Перечисления.СтатусыСделок.ВыставленыВсеРасходы);
	
	ЭлементОтбора.ПравоеЗначение = СписокСтатусовПрофитыИОплата;
	
	ЭлементОтбора = СписокПроверкаСредствДляРелиза.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодстатусОплатаВЛинию"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.ПодстатусыОплатаВЛиниюСделок.ПроверкаСредствДляРелиза;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ЭтаФорма.Заголовок = ТекущаяСтраница.Заголовок + " финансиста";
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетовНаОплатуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокСчетовНаОплатуСчетНаОплату" Тогда
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.СчетНаОплату) Тогда 
			
			ПараметрыФормы = Новый Структура("Ключ", Элементы.СписокСчетовНаОплату.ТекущиеДанные.СчетНаОплату);
			ОткрытьФорму("Документ.СчетНаОплатуПокупателю.Форма.ФормаДокумента", ПараметрыФормы);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПрофитыИОплатаПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.СписокПрофитыИОплата.ТекущиеДанные = Неопределено И Элементы.СписокСчетовНаОплату.Видимость Тогда
		
		ЗаполнитьСчетаНаОплатуИСтатусыПоСделке(Элементы.СписокПрофитыИОплата.ТекущиеДанные.Ссылка);	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСчетаНаОплатуИСтатусыПоСделке(Ссыл)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаРасходыКлиента.СчетНаОплату КАК СчетНаОплату,
	               |	СтатусыДокументов.Статус КАК Статус,
	               |	СделкаРасходыКлиента.Комментарий КАК Комментарий
	               |ИЗ
	               |	Документ.Сделка.РасходыКлиента КАК СделкаРасходыКлиента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |		ПО СделкаРасходыКлиента.СчетНаОплату.Ссылка = СтатусыДокументов.Документ.Ссылка
	               |ГДЕ
	               |	СделкаРасходыКлиента.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаРасходыКлиента.СчетНаОплату,
	               |	СтатусыДокументов.Статус,
	               |	СделкаРасходыКлиента.Комментарий";
	
	Запрос.УстановитьПараметр("Ссылка", Ссыл);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокСчетовНаОплату.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Стр = СписокСчетовНаОплату.Добавить();
		Стр.СчетНаОплату = Выборка.СчетНаОплату;
		Стр.Комментарий = Выборка.Комментарий;
		
		Если Выборка.Статус = Null Тогда
			
			Стр.Статус = Перечисления.СтатусОплатыСчета.НеОплачен;
			
		Иначе
			
			Стр.Статус = Выборка.Статус;
			
		КонецЕсли;
		
		Если Стр.Статус = Перечисления.СтатусОплатыСчета.Оплачен Тогда
			
			Стр.Оплачен = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьТаблицуОплатСчетов(Команда)
	
	Если Элементы.СписокСчетовНаОплату.Видимость = Ложь Тогда
		
		Элементы.СписокСчетовНаОплату.Видимость = Истина;
		
		Элементы.СвернутьРазвернутьТаблицуОплатСчетов.Картинка = БиблиотекаКартинок.ПерейтиВперед;
		
	Иначе
		
		Элементы.СписокСчетовНаОплату.Видимость = Ложь;
		Элементы.СвернутьРазвернутьТаблицуОплатСчетов.Картинка = БиблиотекаКартинок.ПерейтиНазад;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПроверкаСредствДляРелиза(Команда)
	
	Для Каждого Стр Из Элементы.СписокПроверкаСредствДляРелиза.ВыделенныеСтроки Цикл 
		
		СменитьСтатусНаПроверкаСредствДляРелиза(Элементы.СписокПроверкаСредствДляРелиза.ДанныеСтроки(Стр).Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура СменитьСтатусНаПроверкаСредствДляРелиза(Ссыл)  
	
	НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Сделка.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 Тогда
		
		МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
		
		МЗ.Сделка = Ссыл;
		МЗ.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.ПроверкаСредствДляРелиза;
		МЗ.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
		МЗ.Записать();
		
	Иначе
		
		Для Каждого Запись ИЗ НЗ Цикл 
			
			Запись.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.ПроверкаСредствДляРелиза;
			Запись.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусБалансПодтвержден(Команда)
	
	Для Каждого Стр Из Элементы.СписокПроверкаСредствДляРелиза.ВыделенныеСтроки Цикл 
		
		СменитьСтатусНаБалансПодтвержден(Элементы.СписокПроверкаСредствДляРелиза.ДанныеСтроки(Стр).Ссылка);
		
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура СменитьСтатусНаБалансПодтвержден(Ссыл)  
	
	НЗ = РегистрыСведений.СтатусыСделок.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Сделка.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 Тогда
		
		МЗ = РегистрыСведений.СтатусыСделок.СоздатьМенеджерЗаписи();
		
		МЗ.Сделка = Ссыл;
		МЗ.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.БалансПодтвержден;
		МЗ.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
		МЗ.Записать();
		
	Иначе
		
		Для Каждого Запись ИЗ НЗ Цикл 
			
			Запись.ПодстатусОплатаВЛинию = Перечисления.ПодстатусыОплатаВЛиниюСделок.БалансПодтвержден;
			Запись.ДатаВремяПоследнейСменыПодстатусаОплатаВЛинию = ТекущаяДата();
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПуть(Ссыл)
	
	Возврат Ссыл.ПутьКПапке;
	
КонецФункции

&НаКлиенте
Процедура СписокПрофитыИОплатаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаСредствДляРелизаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)   
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыполненныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры
