
&НаСервере
Процедура ЛГС_НеОтправленоПоПочтеПослеНаСервере(Ссыл)
	
	НЗ = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьНаборЗаписей();
	НЗ.Отбор.Реализация.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.Почта = Ложь;		
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_НеОтправленоПоПочтеПосле(Команда)
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл	   
		
		ЛГС_НеОтправленоПоПочтеПослеНаСервере(Ссыл); 
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_НеОтправленоПоЭДОПослеНаСервере(Ссыл)
	
	НЗ = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьНаборЗаписей();
	НЗ.Отбор.Реализация.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ЭДО = Ложь;		
			
		КонецЦикла;
		
		НЗ.Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛГС_НеОтправленоПоЭДОПосле(Команда)
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл	   
		
		ЛГС_НеОтправленоПоЭДОПослеНаСервере(Ссыл); 
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_ОтправленоПоПочтеПослеНаСервере(Ссыл)  
	
	НЗ = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьНаборЗаписей();
	НЗ.Отбор.Реализация.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.Почта = Истина;		
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Запись = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьМенеджерЗаписи();
		Запись.Реализация = Ссыл;
		Запись.Почта = Истина;
		Запись.Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ОтправленоПоПочтеПосле(Команда)
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл	   
		
		ЛГС_ОтправленоПоПочтеПослеНаСервере(Ссыл); 
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_ОтправленоПоЭДОПослеНаСервере(Ссыл)
	
	НЗ = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьНаборЗаписей();
	НЗ.Отбор.Реализация.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ЭДО = Истина;		
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Запись = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьМенеджерЗаписи();
		Запись.Реализация = Ссыл;
		Запись.ЭДО = Истина;
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ОтправленоПоЭДОПосле(Команда) 
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл	   
		
		ЛГС_ОтправленоПоЭДОПослеНаСервере(Ссыл); 
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_ОтправленоПоЭДОИПочтеПослеНаСервере(Ссыл)
	
	НЗ = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьНаборЗаписей();
	НЗ.Отбор.Реализация.Установить(Ссыл);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.ЭДО = Истина;
			Запись.Почта = Истина;
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Запись = РегистрыСведений.СтатусыОтправкиРеализацийПоЭДОИПочте.СоздатьМенеджерЗаписи();
		Запись.Реализация = Ссыл;
		Запись.ЭДО = Истина;
		Запись.Почта = Истина;
		Запись.Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ОтправленоПоЭДОИПочтеПосле(Команда)
	
	Для Каждого Ссыл Из Элементы.Список.ВыделенныеСтроки Цикл	   
		
		ЛГС_ОтправленоПоЭДОИПочтеПослеНаСервере(Ссыл); 
		
	КонецЦикла;
	
	Элементы.Список.Обновить();     
	
КонецПроцедуры
