&НаСервере
Функция ПолучитьТему(Стр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаРасходыКлиента.Ссылка.Номер КАК Номер,
	               |	СделкаРасходыКлиента.Контейнеры КАК Контейнеры,
	               |	СделкаРасходыКлиента.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю1
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.РасходыКлиента КАК СделкаРасходыКлиента
	               |			ПО СчетНаОплатуПокупателю1.Ссылка = СделкаРасходыКлиента.СчетНаОплату.Ссылка
	               |		ПО РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Ссылка = СчетНаОплатуПокупателю1.Ссылка
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Ссылка = &Ссылка
	               |	И СделкаРасходыКлиента.Ссылка.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ссылка", Стр);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Контейнеры = "";
	
	СделкаНомер = "";
	
	Пока Выборка.Следующий() Цикл
		
		СделкаНомер = Выборка.Номер;
		
		Если Выборка.Контейнеры = "Все" Тогда
			
			СтрКонтейнеры = ПолучитьВсеКонтейнеры(Выборка.Ссылка);
			
		Иначе
			
			СтрКонтейнеры = Выборка.Контейнеры;	
			
		КонецЕсли;
		
		Если Контейнеры = "" Тогда
			
			Контейнеры = СтрКонтейнеры;
			
		Иначе
			
			Контейнеры = Контейнеры + ", " + СтрКонтейнеры;
			
		КонецЕсли;
		
	КонецЦикла;
	
	МассивКонтейнеры = СтрРазделить(Контейнеры, ", ", Ложь);
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Контейнер");
	
	Для Каждого Стр Из МассивКонтейнеры Цикл
		
		СтрТЗ = ТЗ.Добавить();
		СтрТЗ.Контейнер = Стр;
		
	КонецЦикла;    
	
	ТЗ.Свернуть("Контейнер");
	
	Контейнеры = "";
	
	Для Каждого СтрТЗ Из ТЗ Цикл
		
		Если Контейнеры = "" Тогда
			
			Контейнеры = СтрТЗ.Контейнер;
			
		Иначе
			
			Контейнеры = Контейнеры + ", " + СтрТЗ.Контейнер;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Тема = "Сделка " + СделкаНомер + " к/р " + Контейнеры;
		
	Возврат Тема;
	
КонецФункции 

&НаСервере
Функция ПолучитьВсеКонтейнеры(Ссыл)
	
	Контейнеры = "";
	
	Для Каждого Стр Из Ссыл.Контейнеры Цикл
		
	Если Контейнеры = "" Тогда
			
			Контейнеры = Строка(Стр.Контейнер);
			
		Иначе
			
			Контейнеры = Контейнеры + ", " + Строка(Стр.Контейнер);
			
		КонецЕсли;	
		
	КонецЦикла; 
	
	Возврат Контейнеры;
	
КонецФункции
