
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ТекДень = ТекущаяДата();
	
	Прошлое = ТекущаяДата() - 86400 * 15;
	Будущее = ТекущаяДата() + 86400 * 15;
	
	Список.Параметры.УстановитьЗначениеПараметра("Контрагенты",КонтрагентПоПользователю());
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь",ТекПользователь());
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Контрагенты",КонтрагентПоПользователю());
	
	Отбор = СписокДокументов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	Отбор.ПравоеЗначение = НачалоДня(Прошлое);
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Отбор.Использование = Истина;
	
	Отбор = СписокДокументов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	Отбор.ПравоеЗначение = КонецДня(Будущее);
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата"); 
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Отбор.Использование = Истина;
	
	СписокАктовСверки.Параметры.УстановитьЗначениеПараметра("Контрагенты",КонтрагентПоПользователю());
	СписокПрисоединенныеФайлы.Параметры.УстановитьЗначениеПараметра("Контрагенты",КонтрагентПоПользователю());
	СписокСчета.Параметры.УстановитьЗначениеПараметра("Контрагенты",КонтрагентПоПользователю());
	СписокПлатежи.Параметры.УстановитьЗначениеПараметра("Контрагенты",КонтрагентПоПользователю()); 
	
КонецПроцедуры

&НаСервере
Функция КонтрагентПоПользователю()
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	МассивКонтрагентов = ТекПользователь.ДоступныеКонтрагенты.ВыгрузитьКолонку("Контрагент");
	
	Возврат МассивКонтрагентов;
	
КонецФункции

&НаСервере
Функция ТекПользователь()
	
	Возврат Пользователи.ТекущийПользователь();
	
КонецФункции


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока);
    
    ОткрытьФорму("Документ.Сделка.Форма.ФормаДокументаЛК", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Фильтр(Команда)
	
	ТекСтраница = Элементы.ГруппаСтраницаСписокСделок.ТекущаяСтраница.Имя;
	
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФильтра",ЭтаФорма, ТекСтраница);
	
	ДопПараметры = Новый Структура;
	дПериод = Новый СтандартныйПериод;
	ПкдДата = Новый ПолеКомпоновкиДанных("Дата");
		
	ТекСписок = ОпределитьТекСписок(ТекСтраница);
	
	Для Каждого Стр ИЗ ТекСписок.Отбор.Элементы Цикл
		
		Если Стр.ЛевоеЗначение = ПкдДата Тогда
			Если Стр.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
				дПериод.ДатаНачала = Стр.ПравоеЗначение;
			ИначеЕсли Стр.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
				дПериод.ДатаОкончания = Стр.ПравоеЗначение;
			КонецЕсли;
		Иначе
			ДопПараметры.Вставить(Стр.ЛевоеЗначение, Стр.ПравоеЗначение);	
		КонецЕсли;
				
	КонецЦикла;
	
	Если ЗначениеЗаполнено(дПериод.ДатаНачала) Или ЗначениеЗаполнено(дПериод.ДатаОкончания) Тогда
		ДопПараметры.Вставить("Период", дПериод);	
	КОнецЕсли;
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаОтбора",ДопПараметры,ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФильтра(Результат, ДопПараметры) Экспорт
	
	Если ДопПараметры <> Неопределено Тогда
			
		ТекСписок = ОпределитьТекСписок(ДопПараметры);
		
	КонецЕсли;
	
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ТекСписок.Отбор.Элементы.Очистить();
		
		Для Каждого Ключ ИЗ Результат Цикл
			
			Если Ключ.Ключ = "Период" Тогда
				
				Отбор = ТекСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				Отбор.ПравоеЗначение = Ключ.Значение.ДатаНачала;
				Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
				Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Отбор.Использование = Истина;
				
				Отбор = ТекСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				Отбор.ПравоеЗначение = Ключ.Значение.ДатаОкончания;
				Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата"); 
				Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Отбор.Использование = Истина;
				
			ИначеЕсли Ключ.Ключ = "Контейнер" Тогда
				
				Отбор = ТекСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
				Отбор.ПравоеЗначение = Ключ.Значение;
				Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Ключ.Ключ);
				Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Отбор.Использование = Истина;	
				
			Иначе
				
				Отбор = ТекСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				Отбор.ПравоеЗначение = Ключ.Значение;
				Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Ключ.Ключ);
				Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Отбор.Использование = Истина;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтаФорма.УсловноеОформление.Элементы[0].Отбор.Элементы[0].Элементы[1].ПравоеЗначение = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сделка",Элементы.Список.ТекущаяСтрока);
	//ПараметрыФормы.Вставить("Сделка", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОТкрытьФОрму("Документ.Сделка.Форма.ФормаДокументовСделки",ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

    ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	ИмяФайла = "";
	Если Поле.Заголовок = "Счет" Тогда
		Ссылка = ПолучитьСчет(ПолучитьНомер(ТекДанные.ПредставлениеСчет));
		ИмяФайла = ТекДанные.ПредставлениеСчет;
		ТабличныйДокумент = ТабДокСчет(Ссылка);
	ИначеЕсли Поле.Заголовок = "Акт" Тогда
		Если СтрНайти(ТекДанные.ПредставлениеАкт,"Отчет") = 0 Тогда
			Ссылка = ПолучитьАкт(ПолучитьНомер(ТекДанные.ПредставлениеАкт));
			Если СтрНайти(ТекДанные.ПредставлениеАкт, "УПД") Тогда
				ТабличныйДокумент = ТабДокУПД(Ссылка);
			Иначе
				ТабличныйДокумент = ТабДокАкт(Ссылка);
			КонецЕсли;
		Иначе
			Ссылка = ПолучитьОтчетКомитенту(ПолучитьНомер(ТекДанные.ПредставлениеАкт));
			ТабличныйДокумент = ТабДокОтчет(Ссылка);
		КонецЕсли;
		ИмяФайла = ТекДанные.ПредставлениеАкт;
	ИначеЕсли Поле.Заголовок = "Счет-фактура" Тогда
		Ссылка = ПолучитьСФ(ПолучитьНомер(ТекДанные.ПредставлениеСФ));
		ИмяФайла = ТекДанные.ПредставлениеСФ;
		ТабличныйДокумент = ТабДокСФ(Ссылка);
	КонецЕсли;
	
	Если Поле.Заголовок = "Акт-сверки" Тогда
		ТекДанные = Элементы.СписокАктовСверки.ТекущиеДанные;
		Ссылка = ПолучитьАктСверки(ПолучитьНомер(ТекДанные.ПредставлениеАктСверки));
		ИмяФайла = ТекДанные.ПредставлениеАктСверки;
		ТабличныйДокумент = ТабДокАктСверки(Ссылка);
	КонецЕсли;
	
	Если ТабличныйДокумент <> Неопределено Тогда
		
		//МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
		//КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИмяФайла);
		//КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент;   
		//МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
		ТабличныйДокумент.Показать();
		//ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОткрытиеТЧ(ТабличныйДокумент, ИмяФайла)
	
	СтруктураПарам = Новый Структура;
	СтруктураПарам.Вставить("ТабличныйДокумент",ТабличныйДокумент);
	СтруктураПарам.Вставить("ИмяФайла", ИмяФайла);
	
	//ИмяФайла = СокрП(ИмяФайла);
	//
	//ВремФайл = ОбработатьИмяВремФайла(ПолучитьИмяВременногоФайла("pdf"), ИмяФайла);
	//
	//ТабличныйДокумент.Записать(ВремФайл,ТипФайлаТабличногоДокумента.PDF);
	//Файл = Новый Файл(ВремФайл);
	//
	//ДД = Новый ДвоичныеДанные(Файл.ПолноеИмя);
	//
	//СсылкаНаФайл = ПоместитьВоВременноеХранилище(ДД, Новый УникальныйИдентификатор);
	//
	//СтруктураФайла = Новый Структура;
	//СтруктураФайла.Вставить("ДвоичныеДанные", ДД);
	//СтруктураФайла.Вставить("ИмяФайла", Файл.Имя);
	//СтруктураФайла.Вставить("ПутьФайла", Файл.ПолноеИмя);
	//
	//МассивФайлов = Новый Массив;
	//МассивФайлов.Добавить(СтруктураФайла);
	//
	//СтруктураВозврата = Новый Структура;
	//СтруктураВозврата.Вставить("МассивФайлов",МассивФайлов);
	
	#Если ВебКлиент Тогда
		
		ПодключитьРасширениеРаботыСФайламиНаКлиенте(Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Истина, СтруктураПарам));
		
	#КонецЕсли
	
	#Если НЕ ВебКлиент Тогда
		//нов = СтруктураПарам.ИмяФайла1;
		ИмяФайла = СокрП(ИмяФайла);
		
		ВремФайл = ОбработатьИмяВремФайла(ПолучитьИмяВременногоФайла("pdf"), ИмяФайла);
		//ВремФайл = ИмяФайла+".pdf";
		
		ТабличныйДокумент.Записать(ВремФайл,ТипФайлаТабличногоДокумента.PDF);
		Файл = Новый Файл(ВремФайл);
		
		ДД = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		
		СсылкаНаФайл = ПоместитьВоВременноеХранилище(ДД, Новый УникальныйИдентификатор);
		
		СтруктураФайла = Новый Структура;
		СтруктураФайла.Вставить("ДвоичныеДанные", ДД);
		СтруктураФайла.Вставить("ИмяФайла", Файл.Имя);
		СтруктураФайла.Вставить("ПутьФайла", Файл.ПолноеИмя);
		
		МассивФайлов = Новый Массив;
		МассивФайлов.Добавить(СтруктураФайла);
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("МассивФайлов",МассивФайлов);
		
		Если СтруктураВозврата.МассивФайлов.Количество() > 0 Тогда
			
			Попытка
				
				//СсылкаНаФайл = ПолучитьСсылкуНаФайл(СтруктураВозврата.МассивФайлов);
				
				Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
					
					ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
					
					Возврат; 
					
				КонецЕсли;
				
				ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
				ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
				ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
				
				
				НачатьПолучениеФайлаССервера(СсылкаНаФайл, Файл.Имя, ПараметрыДиалогаПолученияФайлов);
				
			Исключение	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
				Сообщение.Сообщить();  
				
			КонецПопытки;
			
		КонецЕсли;
		
	#КонецЕсли	
	
КонецПроцедуры

&НаСервере
Функция ОбработатьИмяВремФайла(Стр, ИмяФайла)
	Массив = СтрРазделить(Стр,"\");
	ИтогСтр = "";
	Для Каждого Зн Из Массив Цикл
		
		Если СтрНайти(Зн,".pdf") Тогда
			
			Зн = ИмяФайла+".pdf";	
			
		КонецЕсли;
		
		ИтогСтр = ИтогСтр + "\" + Зн;
		
	КонецЦикла;
	
	Возврат ИтогСтр;
	
КонецФункции

Функция ПолучитьНомер(Номер)
	ИтогСтр = СтрЗаменить(Номер,"Счет №", "");
	ИтогСтр = СтрЗаменить(ИтогСтр,"Акт №", "");
	ИтогСтр = СтрЗаменить(ИтогСтр,"УПД №", "");
	ИтогСтр = СтрЗаменить(ИтогСтр,"Счет-фактура №", "");
	ИтогСтр = СтрЗаменить(ИтогСтр,"Отчет №", "");
	ИтогСтр = СтрЗаменить(ИтогСтр,"Акт-сверки №", "");
	
	Возврат СокрЛП(ИтогСтр);
КонецФункции

&НаСервере
Функция ПолучитьСчет(НомерСчета)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	                      |ГДЕ
	                      |	СчетНаОплатуПокупателю.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Номер", НомерСчета);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат	Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСФ(НомерСчета)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетФактураВыданный.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	                      |ГДЕ
	                      |	СчетФактураВыданный.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Номер", НомерСчета);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат	Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьАкт(НомерАкта)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |ГДЕ
	                      |	РеализацияТоваровУслуг.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Номер", НомерАкта);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат	Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьАктСверки(НомерАкта)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АктСверкиВзаиморасчетов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	                      |ГДЕ
	                      |	АктСверкиВзаиморасчетов.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Номер", НомерАкта);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат	Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьОтчетКомитенту(НомерАкта)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	                      |ГДЕ
	                      |	ОтчетКомитентуОПродажах.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Номер", НомерАкта);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат	Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ТабДокУПД(Сф)	
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Сф);
	
	НастройкиПечати = УчетНДСВызовСервера.ПолучитьНастройкиПечатиУниверсальныхПередаточныхДокументов(
	МассивОбъектов);
	
	ЕстьСчетаФактурыВыданные   = Ложь;
	ЕстьСчетаФактурыПолученные = Ложь;
	
	Для каждого Объект Из НастройкиПечати.УниверсальныеПередаточныеДокументы Цикл
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ЕстьСчетаФактурыВыданные = Истина;
			Прервать;
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			ЕстьСчетаФактурыПолученные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(НастройкиПечати.СписокМакетов) = Тип("Строка") Тогда
		ИменаМакетов = СтрРазделить(НастройкиПечати.СписокМакетов,",");	
	КОнецЕсли;
	
	ТекстЗапроса = "";
	ОбъектыПечати = Новый СписокЗначений();
	ТаблицаМакетовУПД = УчетНДС.ТаблицаМакетовУПД(); 
	ПараметрыПечати = ПолучитьПараметрыПечати();
	ВременнаяКоллекцияДляОднойПечатнойФормы = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(НастройкиПечати.СписокМакетов);
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	// Печать УПД в статусе "1"
	Для Каждого МакетУПД ИЗ ТаблицаМакетовУПД Цикл 
		Если МакетУПД.Статус <> "1" Тогда
			Продолжить;
		КонецЕсли; 
		
		Если УправлениеПечатью.НужноПечататьМакет(ВременнаяКоллекцияДляОднойПечатнойФормы, МакетУПД.ИДМакета) Тогда
			Если ЕстьСчетаФактурыВыданные Тогда
				ТекстЗапроса = Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(
				МакетУПД.ВерсияПостановленияНДС1137, Истина, МакетУПД.ПрослеживаемыеТовары);
			Иначе
				ТекстЗапроса = Документы.СчетФактураПолученный.ТекстЗапросаПечатьСчетовФактур(
				МакетУПД.ВерсияПостановленияНДС1137, МакетУПД.ПрослеживаемыеТовары);
			КонецЕсли;
			
			СтруктураПараметровПечати = УчетНДС.НовыйСтруктураПараметровПечатиУПД_УКД();
			СтруктураПараметровПечати.МассивОбъектов              = НастройкиПечати.УниверсальныеПередаточныеДокументы;
			СтруктураПараметровПечати.ОбъектыПечати               = ОбъектыПечати;
			СтруктураПараметровПечати.ТекстЗапросаДокументам      = ТекстЗапроса;
			СтруктураПараметровПечати.ТолькоПередаточныйДокумент  = Ложь;
			СтруктураПараметровПечати.ТабДокумент                 = Неопределено;
			СтруктураПараметровПечати.ПараметрыПечати             = ПараметрыПечати;
			СтруктураПараметровПечати.КлючПараметровПечати        = МакетУПД.КлючПараметровПечати;
			СтруктураПараметровПечати.ПолныйПутьКМакету           = МакетУПД.ПолныйПутьКМакету;
			СтруктураПараметровПечати.ПараметрыВывода             = ПараметрыВывода;
			
			ТабличныйДокумент = УчетНДС.ПечатьУниверсальныхПередаточныхДокументов(СтруктураПараметровПечати);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Печать УПД в статусе "2"
	Для Каждого МакетУПД ИЗ ТаблицаМакетовУПД Цикл
		Если МакетУПД.Статус <> "2" Тогда
			Продолжить;
		КонецЕсли;
		Если УправлениеПечатью.НужноПечататьМакет(ВременнаяКоллекцияДляОднойПечатнойФормы, МакетУПД.ИДМакета) Тогда
			ТекстЗапросаПечатьУниверсальныхПередаточныхДокументов = "";
			Для каждого Объект Из МассивОбъектов Цикл
				Если ТипЗнч(Объект) <> Тип("ДокументСсылка.СчетФактураВыданный")
					И ТипЗнч(Объект) <> Тип("ДокументСсылка.СчетФактураПолученный") Тогда
					ТекстЗапросаПечатьУниверсальныхПередаточныхДокументов = 
						Документы[Объект.Метаданные().Имя].ТекстЗапросаПечатьУниверсальныхПередаточныхДокументов(
							МакетУПД.ВерсияПостановленияНДС1137, МакетУПД.ПрослеживаемыеТовары);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ПустаяСтрока(ТекстЗапросаПечатьУниверсальныхПередаточныхДокументов) Тогда
				
				СтруктураПараметровПечати = УчетНДС.НовыйСтруктураПараметровПечатиУПД_УКД();
				СтруктураПараметровПечати.МассивОбъектов              = МассивОбъектов;
				СтруктураПараметровПечати.ОбъектыПечати               = ОбъектыПечати;
				СтруктураПараметровПечати.ТекстЗапросаДокументам      = ТекстЗапросаПечатьУниверсальныхПередаточныхДокументов;
				СтруктураПараметровПечати.ТолькоПередаточныйДокумент  = Истина;
				СтруктураПараметровПечати.ТабДокумент                 = Неопределено;
				СтруктураПараметровПечати.ПараметрыПечати             = ПараметрыПечати;
				СтруктураПараметровПечати.КлючПараметровПечати        = МакетУПД.КлючПараметровПечати;
				СтруктураПараметровПечати.ПолныйПутьКМакету           = МакетУПД.ПолныйПутьКМакету;
				СтруктураПараметровПечати.ПараметрыВывода             = ПараметрыВывода;
				
				ТабличныйДокумент = УчетНДС.ПечатьУниверсальныхПередаточныхДокументов(СтруктураПараметровПечати);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
			
	ОбработатьФаксимилеТабДок(ТабличныйДокумент); 
				
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокСчет(Сч)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	ПараметрыПечати.Вставить("ВыводитьКоносамент",Истина);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Сч);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	СоответствиеСчетовРеализациям = Неопределено;
	ДокументыБезСчетовНаОплату = Неопределено;
	ТаблицаСведенийСчетНаОплату = Документы.СчетНаОплатуПокупателю.ПолучитьТаблицуСведенийСчетаНаОплату(
			МассивОбъектов, СоответствиеСчетовРеализациям, ДокументыБезСчетовНаОплату);
	
	ТабличныйДокумент = ПечатьТорговыхДокументов.ПечатьСчетаНаОплату(ТаблицаСведенийСчетНаОплату,ОбъектыПечатиВрем,ПараметрыПечати);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокАкт(Акт)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВидДокументаПечати",  "РеализацияТоваровУслуг");
	ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Акт");
	ПараметрыПечати.Вставить("ИмяМакетаПечати",     "Документ.РеализацияТоваровУслуг.ПФ_MXL_Акт");
	ПараметрыПечати.Вставить("ВыводитьКоносамент", Истина);
	ПараметрыПечати.Вставить("ОтслеживатьОригинал", Истина); 
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Акт);
	
	ТаблицаСведенийАктаОбОказанииУслуг = Документы.РеализацияТоваровУслуг.ПолучитьТаблицуСведенийАктаОбОказанииУслуг(МассивОбъектов);
	
	ТабличныйДокумент = ПечатьТорговыхДокументов.ПечатьАктаОбОказанииУслуг(ТаблицаСведенийАктаОбОказанииУслуг, ОбъектыПечати, ПараметрыПечати);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокСФ(СФ)
	
	ПорядокПримененияФормСФ = 
		УчетНДСПереопределяемый.СоответствиеВерсийПостановленияФормамСчетовФактур();
		
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();	
		
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СФ);
	
	НастройкиПечати = УчетНДСВызовСервера.ПолучитьНастройкиПечатиСчетовФактур(МассивОбъектов);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	СоответствиеСчетовРеализациям = Неопределено;
	ДокументыБезСчетовНаОплату = Неопределено;
	ТаблицаСведенийСчетНаОплату = Документы.СчетНаОплатуПокупателю.ПолучитьТаблицуСведенийСчетаНаОплату(
			МассивОбъектов, СоответствиеСчетовРеализациям, ДокументыБезСчетовНаОплату);
	
	ТабличныйДокумент = УчетНДС.ПечатьСчетовФактур1096(
			МассивОбъектов,
			ОбъектыПечати,
			Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(ПорядокПримененияФормСФ["СчетФактура1096"]),
			ПараметрыПечати,
			ПараметрыВывода);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ТабДокОтчет(Отчет)
		
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечатиВрем = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(ОбъектыПечати);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Отчет);
	
	ТабличныйДокумент = Документы.ОтчетКомитентуОПродажах.ЛГС_ПечатьОтчетаКомитенту1(МассивОбъектов, ОбъектыПечати);	
	
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ТабДокАктСверки(Акт)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Акт);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",  Ложь);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	ТабличныйДокумент = Документы.АктСверкиВзаиморасчетов.ПечатьАктаСверкиЛК(МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
	ОбработатьФаксимилеТабДок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Процедура ОбработатьФаксимилеТабДок(ТабличныйДокумент)

	ФайлыПечатиИПодписи = Справочники.Организации.ПодписиИПечатиОрганизации(Справочники.Организации.ОрганизацияПоУмолчанию(), ТекущаяДата());
	
	Для Каждого Рис ИЗ ТабличныйДокумент.Рисунки Цикл
				
		Если СтрНайти(Рис.Имя,"Печать") <> 0 И ФаксимилеИспользуется Тогда
			Рис.Картинка = ФайлыПечатиИПодписи["ФаксимилеПечать"];
		ИначеЕсли СтрНайти(Рис.Имя,"Руководитель") <> 0 И ФаксимилеИспользуется Тогда
			Рис.Картинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"];
		Иначе
			Рис.ВыводитьНаПечать = Ложь;	
		КОнецЕсли;
		
		Рис.ГраницаСверху = Ложь;
		Рис.ГраницаСлева = Ложь;
		Рис.ГраницаСнизу = Ложь;
		Рис.ГраницаСправа = Ложь;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПечати()
	
	ПараметрыПечати = Новый Структура;
	
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", ЛОЖЬ);
	ПараметрыПечати.Вставить("ИдентификаторВКомплекте", "УниверсальныйПередаточныйДокументКомплект");
	ПараметрыПечати.Вставить("ОтслеживатьОригинал", Истина);
	
	Возврат ПараметрыПечати;
	
КонецФункции

&НаСервере
Функция ПолучитьРез()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |ГДЕ
	                      |	РеализацияТоваровУслуг.Номер = &Номер");
	Запрос.УстановитьПараметр("Номер", "ДЦ00-000003");
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;	
	КонецЕсли;	

КОнецФункции

&НаКлиенте
Процедура ПослеПодключенияРасширения(Подключено, ДопПараметры) Экспорт
	
	Если Подключено Тогда
		
		Попытка
			
			ИмяФайла = СокрП(ДопПараметры.ИмяФайла);
			
			//ВремФайл = ОбработатьИмяВремФайла(ПолучитьИмяВременногоФайла("pdf"), ИмяФайла);
			ВремФайл = ИмяФайла+".pdf";
			
			ДопПараметры.ТабличныйДокумент.Записать(ВремФайл,ТипФайлаТабличногоДокумента.PDF);
			Файл = Новый Файл(ВремФайл);
			
			ДД = Новый ДвоичныеДанные(Файл.ПолноеИмя);
			
			СсылкаНаФайл = ПоместитьВоВременноеХранилище(ДД, Новый УникальныйИдентификатор);
			
			СтруктураФайла = Новый Структура;
			СтруктураФайла.Вставить("ДвоичныеДанные", ДД);
			СтруктураФайла.Вставить("ИмяФайла", Файл.Имя);
			СтруктураФайла.Вставить("ПутьФайла", Файл.ПолноеИмя);
			
			МассивФайлов = Новый Массив;
			МассивФайлов.Добавить(СтруктураФайла);
			
			СтруктураВозврата = Новый Структура;
			СтруктураВозврата.Вставить("МассивФайлов",МассивФайлов);
			
			Если МассивФайлов.Количество <> 0 Тогда 
				ДанныеФайла = МассивФайлов[0];
				СсылкаНаФайл = ПоместитьВоВременноеХранилище(ДанныеФайла.ДвоичныеДанные, Новый УникальныйИдентификатор);
			КонецЕсли;
			
			//СсылкаНаФайл = ПолучитьСсылкуНаФайл(ДопПараметры.МассивФайлов);
			
			Если НЕ ЭтоАдресВременногоХранилища(СсылкаНаФайл) Тогда   
				
				ПоказатьПредупреждение(Новый ОписаниеОповещения(), "Файл не найден", 0, "Ошибка при выгрузке");
				
				Возврат; 
				
			КонецЕсли;
			
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			ПараметрыДиалогаПолученияФайлов.Заголовок = "Выберите каталог сохранения файла";
			
			НачатьПолучениеФайлаССервера(СсылкаНаФайл, ДанныеФайла.ИмяФайла, ПараметрыДиалогаПолученияФайлов);
			
		Исключение	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать файл. Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.";
			Сообщение.Сообщить();  
			
		КонецПопытки;	
		
	ИначеЕсли ДопПараметры.УстановитьЕслиНеПодключено Тогда
		
		НачатьУстановкуРасширенияРаботыСФайлами(
            Новый ОписаниеОповещения(
                "ПодключитьРасширениеРаботыСФайламиНаКлиенте",
                ЭтотОбъект,
                Новый Структура("УстановитьЕслиНеПодключено, МассивФайлов", Ложь, ДопПараметры.МассивФайлов)));
		
	Иначе
		
		ПоказатьПредупреждение( , НСтр("ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'"));
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодключитьРасширениеРаботыСФайламиНаКлиенте(ДопПараметры) Экспорт
	
	ОповещениеОПодключенииРасширенияРаботыСФайлами = Новый ОписаниеОповещения("ПослеПодключенияРасширения", ЭтотОбъект, ДопПараметры);
	
	НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеОПодключенииРасширенияРаботыСФайлами);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФорму(Команда)

	ТекСтраница = Элементы.ГруппаСтраницаСписокСделок.ТекущаяСтраница.Имя;
	
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияИзмененияФормы",ЭтаФорма, ТекСтраница);
	
	Если ТекСтраница = "Сделки" Тогда
		ТекСписок = Элементы.Список;	
	ИначеЕсли ТекСтраница = "ФинансовыеДокументы" Тогда	
		ТекСписок = Элементы.СписокДокументов;	
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	
	КолонкиВидимость = Новый Соответствие;
	КолонкиПорядок = Новый Соответствие;
	
	Порядок = 1;
	
	Для Каждого Эл ИЗ ТекСписок.ПодчиненныеЭлементы Цикл
		
		КолонкиВидимость.Вставить(Эл.Имя, Эл.Видимость);
		КолонкиПорядок.Вставить(Эл.Имя, Порядок);	
		Порядок = Порядок + 1;
		
	КонецЦикла;
	
	ДопПараметры.Вставить("Колонки", КолонкиВидимость);
	ДопПараметры.Вставить("КолонкиПорядок", КолонкиПорядок);
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаИзменитьСоставИПорядокКолонок",ДопПараметры,ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияИзмененияФормы(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
				
		Индекс = 0;
		
		Пока Индекс <> Результат.Количество() - 1 Цикл
			
			ПереместитьНаСервере(Результат[Индекс].ИмяКолонки, ДопПараметры, Результат[Индекс+1].ИмяКолонки);	
			Элементы[Результат[Индекс].ИмяКолонки].Видимость = Результат[Индекс].Использовать;
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Функция ОпределитьТекСписок(ТекСтраница)

	Если ТекСтраница = "Сделки" Тогда
		ТекСписок = Список;	
	ИначеЕсли ТекСтраница = "ФинансовыеДокументы" Тогда	
		ТекСписок = СписокДокументов;	
	КонецЕсли;
	
	Возврат ТекСписок;
	
КонецФункции

&НаСервере
Процедура ПереместитьНаСервере(ЭлПереноса, ДопПараметры, ЭлПеред)
	
	Если ДопПараметры = "Сделки" Тогда
		ТекСписок = Элементы.Список;	
	ИначеЕсли ДопПараметры = "ФинансовыеДокументы" Тогда	
		ТекСписок = Элементы.СписокДокументов;	
	КонецЕсли;
	
	Элементы.Переместить(Элементы[ЭлПереноса], ТекСписок, Элементы[ЭлПеред]);		
	
КонецПроцедуры


&НаКлиенте
Процедура ИсторияСтатусов(Команда)
	ТекСделка = Элементы.Список.ТекущаяСтрока;
	Парам = Новый Структура("Ключ",ТекСделка);
	ОткрытьФорму("Документ.Сделка.Форма.ФормаИсторииСтатусов",Парам,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СписокПрисоединенныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 
	Если Элементы.СписокПрисоединенныеФайлы.РежимВыбора Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокПрисоединенныеФайлы.ТекущиеДанные;
	
	Если Элементы.СписокПрисоединенныеФайлы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Ссылка,
		Неопределено, УникальныйИдентификатор, Неопределено, "");
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ДанныеФайла", ДанныеФайла);
	Обработчик = Новый ОписаниеОповещения("СписокВыборПослеВыбораРежимаРедактирования", ЭтотОбъект, ПараметрыОбработчика);
	
	РаботаСФайламиСлужебныйКлиент.ВыбратьРежимИРедактироватьФайл(Обработчик, ДанныеФайла, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборПослеВыбораРежимаРедактирования(Результат, ПараметрыВыполнения) Экспорт
	
	Если Результат = "Редактировать" Тогда
		//Обработчик = Новый ОписаниеОповещения("СписокВыборПослеРедактированияФайла", ЭтотОбъект, ПараметрыВыполнения);
		//РаботаСФайламиСлужебныйКлиент.РедактироватьФайл(Обработчик, ПараметрыВыполнения.ДанныеФайла);
	ИначеЕсли Результат = "Открыть" Тогда
		РаботаСФайламиКлиент.ОткрытьФайл(ПараметрыВыполнения.ДанныеФайла, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСделку(Команда)
	
	ОткрытьФорму("Документ.Сделка.Форма.ФормаСозданияДокументаЛК",,ЭтаФорма,,,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура Список(Команда)
	ОТкрытьФорму("Документ.Сделка.Форма.ФормаСпискаЗаявокКлиентовЛК",,ЭтаФорма,,,,,);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокДокументовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// Вставить содержимое обработчика.
КонецПроцедуры



















