
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрКоманды);
	
	ОбъектыПечати = Новый СписокЗначений; 
	ИмяМакета = "НовоеПоручениеЭкспедитору"; 
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("НовоеПоручениеЭкспедитору");
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Новое поручение экспедитору"; 
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуПорученияЭкспедитору(МассивОбъектов, ОбъектыПечати, ИмяМакета); 
	
	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры   

&НаСервере
Функция СформироватьПечатнуюФормуПорученияЭкспедитору(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НовоеПоручениеЭкспедитору"; 
	ТабличныйДокумент.Защита = Истина;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ТабличныйДокумент = ЗаполнитьТабличныйДокументНовоеПоручениеЭкспедитору(ТабличныйДокумент, МассивОбъектов[0]); 	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЗаполнитьТабличныйДокументНовоеПоручениеЭкспедитору(ТабДок, Док)   
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_НовоеПоручениеЭкспедитору";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеЭкспедитору.Ссылка КАК Ссылка,
	|	ПоручениеЭкспедитору.Номер КАК Номер,
	|	ПоручениеЭкспедитору.Дата КАК Дата,
	|	ПоручениеЭкспедитору.Проведен КАК Проведен,
	|	ПоручениеЭкспедитору.Грузоотправитель КАК Грузоотправитель,
	|	ПоручениеЭкспедитору.Экспедитор КАК Экспедитор,
	|	ПоручениеЭкспедитору.Клиент КАК Клиент,
	|	ПоручениеЭкспедитору.Грузополучатель КАК Грузополучатель,
	|	ПоручениеЭкспедитору.Договор КАК Договор,
	|	ПоручениеЭкспедитору.УведомитьСторонуОПрибытииГруза КАК УведомитьСторонуОПрибытииГруза,
	|	ПоручениеЭкспедитору.СтранаПроисхожденияГруза КАК СтранаПроисхожденияГруза,
	|	ПоручениеЭкспедитору.ТоварыГотовыеКОтправкеМестоИДата КАК ТоварыГотовыеКОтправкеМестоИДата,
	|	ПоручениеЭкспедитору.ВидТранспорта КАК ВидТранспорта,
	|	ПоручениеЭкспедитору.ПунктНазначения КАК ПунктНазначения,
	|	ПоручениеЭкспедитору.Страхование КАК Страхование,
	|	ПоручениеЭкспедитору.ТоварныйКод КАК ТоварныйКод,
	|	ПоручениеЭкспедитору.Маркировка КАК Маркировка,
	|	ПоручениеЭкспедитору.КоличествоМестВидУпаковки КАК КоличествоМестВидУпаковки,
	|	ПоручениеЭкспедитору.ВесБруттоНетто КАК ВесБруттоНетто,
	|	ПоручениеЭкспедитору.Объем КАК Объем,
	|	ПоручениеЭкспедитору.СтоимостьГруза КАК СтоимостьГруза,
	|	ПоручениеЭкспедитору.РазмерУпаковки КАК РазмерУпаковки,
	|	ПоручениеЭкспедитору.ТребуемыеДокументы КАК ТребуемыеДокументы,
	|	ПоручениеЭкспедитору.Договор.Дата КАК ДатаДоговора,
	|	ПоручениеЭкспедитору.Договор.Номер КАК НомерДоговора,
	|	ПоручениеЭкспедитору.ДатаПриложения КАК ДатаПриложения,
	|	ПоручениеЭкспедитору.Клиент.ОсновноеКонтактноеЛицо.Представление КАК ФИОКлиента,
	|	ПоручениеЭкспедитору.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ПоручениеЭкспедитору.НеПечататьСтоимостьУслугВПоручении КАК НеПечататьСтоимостьУслугВПоручении,
	|	ПоручениеЭкспедитору.ДатаДо КАК ДатаДо,
	|	ПоручениеЭкспедитору.ПунктОтправления КАК ПунктОтправления,
	|	ПоручениеЭкспедитору.ДокументОснование.Ссылка КАК Документ
	|ИЗ
	|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	|ГДЕ
	|	ПоручениеЭкспедитору.Ссылка = &Док";
	
	Запрос.УстановитьПараметр("Док", Док);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоручениеЭкспедитору.НовоеПоручениеЭкспедитору");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		КонтИнформацияЭкспедитора = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Экспедитор,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,Выборка.ДатаПриложения,Истина);
		КонтИнформацияКлиента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Выборка.ДатаПриложения,Истина);
		
		КонтИнформацияКлиентаАдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.АдресСклада, Выборка.ДатаПриложения,Истина);
		КонтИнформацияКлиентаПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты, Выборка.ДатаПриложения,Истина);
		КонтИнформацияКлиентаТелефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Клиент,Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, Выборка.ДатаПриложения,Истина);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Страница");
		
		ОбластьМакета.Параметры.НомерДоговора = Выборка.НомерДоговора;     
		ДатаДоговора = Прав(Выборка.Договор,10); 
		ОбластьМакета.Параметры.ДатаДоговора = ДатаДоговора; 
		ОбластьМакета.Параметры.Дата = Формат(Выборка.Дата, "ДФ='dd.MM.yyyy""г.""'");
		ОбластьМакета.Параметры.Номер = Выборка.Номер;  
		ОбластьМакета.Параметры.Клиент = Строка(Выборка.Клиент);
		ОбластьМакета.Параметры.ЮридическийАдрес = Строка(КонтИнформацияКлиента);      		
		ОбластьМакета.Параметры.Телефон = КонтИнформацияКлиентаТелефон; 
		ОбластьМакета.Параметры.Почта = КонтИнформацияКлиентаПочта; 
		
		ОбластьМакета.Параметры.Грузоотправитель = Выборка.Грузоотправитель;  
		ОбластьМакета.Параметры.Грузополучатель = Выборка.Грузополучатель;
		ОбластьМакета.Параметры.ПунктОтправления = Выборка.ПунктОтправления; 
		ОбластьМакета.Параметры.ПунктНазначения = Выборка.ПунктНазначения;  
		//ОбластьМакета.Параметры.ТранспортноеСредство = Выборка.ВидТранспорта;    	
		//ОбластьМакета.Параметры.Дополнительно = Выборка.ОсобыеОтметки; 
		
		//ОбластьМакета.Параметры.НаименованиеГруза = Выборка.ТоварыГотовыеКОтправкеМестоИДата;
		//ОбластьМакета.Параметры.СтоимостьУслугТЭО =  Выборка.Сумма; восстановить 
		//ОбластьМакета.Параметры.СтоимостьДополнительныхУслуг = Выборка.СтоимостьГруза;
		ОбластьМакета.Параметры.ДиректорКлиента = Выборка.Клиент.ОсновноеКонтактноеЛицо;
		
		ФайлыПечатиИПодписи = Справочники.Организации.ПодписиИПечатиОрганизации(Выборка.Экспедитор, Выборка.ДатаПриложения);
		ОбластьМакета.Рисунки.Печать.Картинка = ФайлыПечатиИПодписи["ФаксимилеПечать"];
		ОбластьМакета.Рисунки.Подпись.Картинка = ФайлыПечатиИПодписи["ФаксимилеРуководитель"];
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;		
КонецФункции  
