
&НаСервере
Процедура ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВУслугах()
	
	Для Каждого Стр Из Объект.Услуги Цикл
		
		ПараметрыОтбора = Новый Структура("КлючСвязи", Стр.КлючСвязиРаспределения);
		
		НайденныеСтроки = Объект.РаспределениеСуммПоСделкамУслуги.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ТекстовоеПредставление = "";
			
			Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
				
				Если ТекстовоеПредставление = "" Тогда
					
					ТекстовоеПредставление = ПолучитьНомерДокумента(СтрНайденнаяСтрока.Сделка) + " - " + Формат(СтрНайденнаяСтрока.СуммаРаспределения,"ЧДЦ=2; ЧГ=");	
					
				Иначе
					
					ТекстовоеПредставление = ТекстовоеПредставление + Символы.ПС + ПолучитьНомерДокумента(СтрНайденнаяСтрока.Сделка) + " - " + Формат(СтрНайденнаяСтрока.СуммаРаспределения,"ЧДЦ=2; ЧГ=");
					
				КонецЕсли;
				
			КонецЦикла;
			
			Стр.Сделки = ТекстовоеПредставление;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Для Каждого Стр ИЗ Объект.Услуги Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Сделки) Тогда
			
			Стр.Сделки = "не распределено";
			
		КонецЕсли;
		
	КонецЦикла;  
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерДокумента(Док)
	
	Возврат Док.Номер;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияСделокВСтроки()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Объект.РаспределениеСуммПоСделкамУслуги.Очистить();
		
		Для Каждого Стр Из Объект.Услуги Цикл
			
			Если НЕ ЗначениеЗаполнено(Стр.КлючСвязиРаспределения) Тогда
				
				Стр.КлючСвязиРаспределения = Стр.ПолучитьИдентификатор();
				
			КонецЕсли;
			
			СтрРаспределение = Объект.РаспределениеСуммПоСделкамУслуги.Добавить();
			СтрРаспределение.КлючСвязи = Стр.КлючСвязиРаспределения;
			СтрРаспределение.Сделка = Объект.ДокументОснование;
			
			Если Объект.СуммаВключаетНДС Тогда
				
				СтрРаспределение.СуммаРаспределения = Стр.Сумма;
				
			Иначе
				
				СтрРаспределение.СуммаРаспределения = Стр.Сумма + Стр.СуммаНДС;
				
			КонецЕсли;
			
		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ДокументОснованиеПриИзмененииПосле(Элемент) 
	
	СтатусСделки = ЛогистикаСервер.ПолучитьСтатусыСделки(Объект.ДокументОснование);
	
	Если СтатусСделки = ПредопределенноеЗначение("Перечисление.СтатусыСделок.Закрыта") ИЛИ СтатусСделки = ПредопределенноеЗначение("Перечисление.СтатусыСделок.Отменена")
		ИЛИ СтатусСделки = ПредопределенноеЗначение("Перечисление.СтатусыСделок.Завершена") Тогда
		
		ПоказатьПредупреждение(,"Архивная сделка не может быть выбрана",,"ОШИБКА!!!" + Символы.ПС +"СДЕЛКА НАХОДИТСЯ В АРХИВЕ!!!");																				   
		
		Объект.ДокументОснование = ПредопределенноеЗначение("Документ.Сделка.ПустаяСсылка");
		
		Возврат;
		
	КонецЕсли;	
	
	УстановитьЗначенияСделокВСтроки();
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВУслугах();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_УслугиВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "УслугиСделки" Тогда
		
		Если НЕ ЗначениеЗаполнено(Элементы.Услуги.ТекущиеДанные.КлючСвязиРаспределения) Тогда
			
			Элементы.Услуги.ТекущиеДанные.КлючСвязиРаспределения = Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор();
			
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("Номенклатура", Элементы.Услуги.ТекущиеДанные.Номенклатура);
		ПараметрыФормы.Вставить("Сумма", ?(Объект.СуммаВключаетНДС, Элементы.Услуги.ТекущиеДанные.Сумма, Элементы.Услуги.ТекущиеДанные.Сумма + Элементы.Услуги.ТекущиеДанные.СуммаНДС));
		ПараметрыФормы.Вставить("КлючСвязи", Элементы.Услуги.ТекущиеДанные.КлючСвязиРаспределения); 
		ПараметрыФормы.Вставить("ВидТЧ", "Услуги");
		
		ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаРедактированияСуммПоСделкам", ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ЭтаФорма.Модифицированность = Истина;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВУслугах();

	НЗ = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Для Каждого Запись Из НЗ Цикл
		
		ЭтотОбъект.Проверено = Запись.Проверено;
		ЭтотОбъект.Проверил = Запись.Проверил;
		
	КонецЦикла;
	
	Если ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") тогда
		
		Элементы.Администратор.Видимость = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник) 
	
	Если Источник = ЭтаФорма.УникальныйИдентификатор Тогда
		
		Если ИмяСобытия = "ВыполненоРаспределениеСтрокиПоСделкамУслуги" Тогда
			
			Для Каждого Стр Из Объект.РаспределениеСуммПоСделкамУслуги Цикл
				
				ПараметрыОтбора = Новый Структура("КлючСвязи", Параметр.КлючСвязи);
				
				НайденныеСтроки = Объект.РаспределениеСуммПоСделкамУслуги.НайтиСтроки(ПараметрыОтбора);
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
						
						Объект.РаспределениеСуммПоСделкамУслуги.Удалить(СтрНайденнаяСтрока);
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла; 
			
			Для Каждого Стр Из Параметр.МассивДобавляемыхСтрокРаспределения Цикл
				
				СтрРаспределение = Объект.РаспределениеСуммПоСделкамУслуги.Добавить();
				СтрРаспределение.КлючСвязи = Параметр.КлючСвязи;
				СтрРаспределение.Сделка = Стр.Сделка;
				СтрРаспределение.СуммаРаспределения = Стр.Сумма;
				
			КонецЦикла;
			
			Для Каждого Стр Из Объект.Услуги Цикл
				
				Если Стр.КлючСвязиРаспределения = Параметр.КлючСвязи Тогда
					
					Стр.Сделки = Параметр.ТекстовоеПредставление;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЛГС_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВУслугах();
	
	НЗ = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.Проверено = ЭтотОбъект.Проверено;
			Запись.Проверил = ЭтотОбъект.Проверил;
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Если ЭтотОбъект.Проверено Тогда
			
			Запись = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьМенеджерЗаписи();
			Запись.Документ = Объект.Ссылка;
			Запись.Проверено = ЭтотОбъект.Проверено;
			Запись.Проверил = ЭтотОбъект.Проверил;
			Запись.Записать();  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_УслугиПередУдалениемПосле(Элемент, Отказ)
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Услуги.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамУслуги.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамУслуги.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_УслугиПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		МаксКлючСвязиРаспределения = -1;
		
		Для Каждого Стр Из Объект.Услуги Цикл
			
			Если Стр.КлючСвязиРаспределения = "" Тогда
				
				Элементы.Услуги.ТекущиеДанные.КлючСвязиРаспределения = Строка(МаксКлючСвязиРаспределения + 1);
				Элементы.Услуги.ТекущиеДанные.Сделки = "не распределено";
				
			ИначеЕсли МаксКлючСвязиРаспределения < Число(Стр.КлючСвязиРаспределения) Тогда
				
				МаксКлючСвязиРаспределения = Число(Стр.КлючСвязиРаспределения);	
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если Копирование Тогда
		
		Элементы.Услуги.ТекущиеДанные.КлючСвязиРаспределения = Строка(МаксКлючСвязиРаспределения + 1); 
		Элементы.Услуги.ТекущиеДанные.Сделки = "не распределено";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_УслугиКоличествоПриИзмененииПосле(Элемент)  
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Услуги.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамУслуги.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамУслуги.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВУслугах();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_УслугиЦенаПриИзмененииПосле(Элемент) 
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Услуги.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамУслуги.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамУслуги.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВУслугах();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_УслугиСуммаПриИзмененииПосле(Элемент)  
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Услуги.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамУслуги.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамУслуги.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВУслугах();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ПровереноПриИзмененииПосле(Элемент)
	
	Если ЭтотОбъект.Проверено Тогда
		
		ЭтотОбъект.Проверил = ПользователиКлиентСервер.ТекущийПользователь();
		
	Иначе
		
		ЭтотОбъект.Проверил = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЛГС_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	ЕстьНераспределенные =  РезультатПроверкиПозицийПоВидамСделок();
	
	Если ЕстьНераспределенные Тогда
		ПоказатьПредупреждение(,"Имеются нераспределенные позиции из Видов Расходов Сделки",,"Ошибка");
		Отказ = Истина;
	КонецЕсли; 
	
 КонецПроцедуры 
 
 &НаСервере
 Функция РезультатПроверкиПозицийПоВидамСделок()
	 
	 НаличиеНераспределено = Ложь;
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВидыРасходовСделки.Номенклатура КАК Номенклатура
	 |ИЗ
	 |	РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	 |"; 
	 ВидыРасходов = Запрос.Выполнить().Выгрузить();
	 ВидыРасходов.Свернуть("Номенклатура"); 
	 
	НаличиеНераспределено = ЛогистикаСервер.ПолучитьРезультатПроверкиРаспределенные(Объект.Услуги, Объект.РаспределениеСуммПоСделкамУслуги, ВидыРасходов); 
	 
	Возврат НаличиеНераспределено;
		 
КонецФункции 

