
&НаСервере
Процедура СохранитьНаСервере()
	
	НЗ = РегистрыСведений.ПоказателиДляКалькуляции.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Линия.Установить(Объект.Линия);
	НЗ.Отбор.АгентЛинии.Установить(Объект.АгентЛинии);
	
	НЗ.Записать();
	
	Для Каждого Стр Из ТарифыЛиний.ПолучитьЭлементы() Цикл
		
		МЗ = РегистрыСведений.ПоказателиДляКалькуляции.СоздатьМенеджерЗаписи();
		МЗ.Линия = Объект.Линия;
		МЗ.АгентЛинии = Объект.АгентЛинии;
		МЗ.Валюта = Стр.Валюта;
		МЗ.СодержаниеУслуги = Стр.СодержаниеУслуги;
		МЗ.Комментарий = Стр.Комментарий;
		МЗ.Порядок = Стр.Порядок;
		МЗ.Записать();
				
		Для Каждого СтрПодчиненная Из Стр.ПолучитьЭлементы() Цикл
			
			МЗ = РегистрыСведений.ПоказателиДляКалькуляции.СоздатьМенеджерЗаписи();
			МЗ.Линия = Объект.Линия;
			МЗ.АгентЛинии = Объект.АгентЛинии;
			МЗ.Валюта = СтрПодчиненная.Валюта;
			МЗ.СодержаниеУслуги = СтрПодчиненная.СодержаниеУслуги;
			МЗ.Комментарий = СтрПодчиненная.Комментарий;
			МЗ.Цена20 = СтрПодчиненная.Цена20;
			МЗ.Цена40 = СтрПодчиненная.Цена40;
			МЗ.Порядок = СтрПодчиненная.Порядок;
			МЗ.ПроцентКомиссии = СтрПодчиненная.ПроцентКомиссии;
			МЗ.НачалоДней = СтрПодчиненная.НачалоДней;
			МЗ.КонецДней = СтрПодчиненная.КонецДней; 
			МЗ.СодержаниеУслугиРодителя = Стр.СодержаниеУслуги; 
			МЗ.НДСТолькоДляКомиссии = СтрПодчиненная.НДСТолькоДляКомиссии;
			МЗ.НДС = СтрПодчиненная.НДС;
			
			МЗ.Записать();
						
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)  
	
	СохранитьНаСервере(); 
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛинияПриИзменении(Элемент)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("СформироватьПослеВопроса",
		ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,
		"Тарифы линий были изменены. Таблица будет очищена, вы хотите продолжить?",
		РежимДиалогаВопрос.ДаНет,
		0,
		КодВозвратаДиалога.Да,
		"Предупреждение"
		); 
		
	Иначе
		
		СформироватьНаСервере();
		
		РазвернутьДерево();
		
		СформироватьСписокВыбораАгентаЛинии();
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура РазвернутьДерево()
	
	Дерево = ТарифыЛиний.ПолучитьЭлементы();  
	
	Если Дерево.Количество() > 0 Тогда
		
		Для Каждого Стр Из Дерево Цикл 
			
			ИдСтр = Стр.ПолучитьИдентификатор();
			Элементы.ТарифыЛиний.Развернуть(ИдСтр);  
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПослеВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СформироватьНаСервере();
		
		РазвернутьДерево();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьКурсыВалют();
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Объект.Результат.Очистить();
	
	РассчитатьНаСервере();
	
КонецПроцедуры   

&НаСервере
Процедура РассчитатьНаСервере()
	
	Дерево = ТарифыЛиний.ПолучитьЭлементы();
	
	Если Дерево.Количество() > 0 Тогда
		
		//ПЕРЕБОР УСЛУГ
		
		Для Каждого СтрУслуга Из Дерево Цикл
			
			ПараметрыУслуги = СтрУслуга.ПолучитьЭлементы();
			
			//ПЕРЕБОР ПАРАМЕТРОВ УСЛУГ
			
			Если ПараметрыУслуги.Количество() > 0 Тогда
				
				СтрРезультат = Объект.Результат.Добавить();
				СтрРезультат.СодержаниеУслуги = СтрУслуга.СодержаниеУслуги;
				
				РезультатРасчетаУслуги20 = 0;
				РезультатРасчетаУслуги40 = 0;
				
				//РАСЧЕТ РЕЗУЛЬТАТА ПО ПАРАМЕТРАМ УСЛУГИ
				
				Для Каждого СтрПараметрыУслуги Из ПараметрыУслуги Цикл 
					
					ТекущийРезультатРасчетаУслуги20 = 0;
					ТекущийРезультатРасчетаУслуги40 = 0;
					
					//ПРОВЕРКА ВАЛЮТНОЙ СУММЫ
					
					ВалютнаяСумма = Ложь;
					
					Если СтрПараметрыУслуги.Валюта <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
						
						ВалютнаяСумма = Истина;	 
						
					КонецЕсли;
					
					//ПРОВЕРКА НА ПРИЗНАК РАСЧЕТА ПО ДНЯМ
					
					Если (ЗначениеЗаполнено(СтрПараметрыУслуги.НачалоДней) ИЛИ ЗначениеЗаполнено(СтрПараметрыУслуги.КонецДней)) Тогда
						
						//РАСЧЕТ ПО ДНЯМ 2 СЛУЧАЯМ, ПЕРВЫЙ ВАРИАНТ - ВЫХОДИТ ЗА РАМКИ ПЕРВОЙ СТРОКИ, ВТОРОЙ - В РАМКАХ ПЕРВОЙ СТРОКИ (ОБЫЧНО БЕСПЛАТНО)
						
						Если Объект.КоличествоДней >= СтрПараметрыУслуги.КонецДней И Объект.КоличествоДней >= СтрПараметрыУслуги.НачалоДней И Объект.КоличествоДней <> 0 Тогда
							
							Если ВалютнаяСумма Тогда
								
								Если СтрПараметрыУслуги.КонецДней = 0 Тогда
									
									ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 + (СтрПараметрыУслуги.Цена20 * (Объект.КоличествоДней - СтрПараметрыУслуги.НачалоДней + 1)) * СтрПараметрыУслуги.Курс;	
									
								Иначе
									
									ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 + (СтрПараметрыУслуги.Цена20 * (СтрПараметрыУслуги.КонецДней - СтрПараметрыУслуги.НачалоДней + 1)) * СтрПараметрыУслуги.Курс; 
									
								КонецЕсли;
								
							Иначе 
								
								Если СтрПараметрыУслуги.КонецДней = 0 Тогда
									
									ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 + (СтрПараметрыУслуги.Цена20 * (Объект.КоличествоДней - СтрПараметрыУслуги.НачалоДней + 1));	
									
								Иначе 
									
									ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 + (СтрПараметрыУслуги.Цена20 * (СтрПараметрыУслуги.КонецДней - СтрПараметрыУслуги.НачалоДней + 1));
									
								КонецЕсли;
								
							КонецЕсли;
							
							Если ВалютнаяСумма Тогда
								
								Если СтрПараметрыУслуги.КонецДней = 0 Тогда
									
									ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 + (СтрПараметрыУслуги.Цена40 * (Объект.КоличествоДней - СтрПараметрыУслуги.НачалоДней + 1)) * СтрПараметрыУслуги.Курс;	
									
								Иначе 
									
									ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 + (СтрПараметрыУслуги.Цена40 * (СтрПараметрыУслуги.КонецДней - СтрПараметрыУслуги.НачалоДней + 1)) * СтрПараметрыУслуги.Курс; 
									
								КонецЕсли;
								
							Иначе 
								
								Если СтрПараметрыУслуги.КонецДней = 0 Тогда
									
									ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 + (СтрПараметрыУслуги.Цена40 * (Объект.КоличествоДней - СтрПараметрыУслуги.НачалоДней + 1));	
									
								Иначе 
									
									ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 + (СтрПараметрыУслуги.Цена40 * (СтрПараметрыУслуги.КонецДней - СтрПараметрыУслуги.НачалоДней + 1));
									
								КонецЕсли;
								
							КонецЕсли;
							
						ИначеЕсли Объект.КоличествоДней < СтрПараметрыУслуги.КонецДней И Объект.КоличествоДней >= СтрПараметрыУслуги.НачалоДней И Объект.КоличествоДней <> 0 Тогда
							
							Если ВалютнаяСумма Тогда
								
								ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 + (СтрПараметрыУслуги.Цена20 * (Объект.КоличествоДней - СтрПараметрыУслуги.НачалоДней + 1)) * СтрПараметрыУслуги.Курс;	
								ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 + (СтрПараметрыУслуги.Цена40 * (Объект.КоличествоДней - СтрПараметрыУслуги.НачалоДней + 1)) * СтрПараметрыУслуги.Курс;	
								
							Иначе 
								
								ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 + (СтрПараметрыУслуги.Цена20 * (Объект.КоличествоДней - СтрПараметрыУслуги.НачалоДней + 1));	
								ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 + (СтрПараметрыУслуги.Цена40 * (Объект.КоличествоДней - СтрПараметрыУслуги.НачалоДней + 1));	
								
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						
						Если ЗначениеЗаполнено(СтрПараметрыУслуги.Цена20) Тогда
							
							Если ВалютнаяСумма Тогда
								
								ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 + СтрПараметрыУслуги.Цена20 * СтрПараметрыУслуги.Курс; 
								
							Иначе
								
								ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 + СтрПараметрыУслуги.Цена20;
								
							КонецЕсли;
							
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтрПараметрыУслуги.Цена40) Тогда
							
							Если ВалютнаяСумма Тогда
								
								ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 + СтрПараметрыУслуги.Цена40 * СтрПараметрыУслуги.Курс; 
								
							Иначе
								
								ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 + СтрПараметрыУслуги.Цена40;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли; 
					
					//ПРОВЕРКА НА КОМИССИЮ АГЕНТА
					
					Если ЗначениеЗаполнено(СтрПараметрыУслуги.ПроцентКомиссии) Тогда 
						
						НДСКомиссии20 = 0;
						НДСКомиссии40 = 0;
						
						Если ЗначениеЗаполнено(СтрПараметрыУслуги.НДС) И СтрПараметрыУслуги.НДСТолькоДляКомиссии Тогда
							
							НДСКомиссии20 = ТекущийРезультатРасчетаУслуги20 * (СтрПараметрыУслуги.ПроцентКомиссии / 100) * (СтрПараметрыУслуги.НДС/100);
							НДСКомиссии40 = ТекущийРезультатРасчетаУслуги40 * (СтрПараметрыУслуги.ПроцентКомиссии / 100) * (СтрПараметрыУслуги.НДС/100);
							
						Иначе
							
							ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 * (1 + (СтрПараметрыУслуги.ПроцентКомиссии / 100));
							
							ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 * (1 + (СтрПараметрыУслуги.ПроцентКомиссии / 100));
							
						КонецЕсли;

						Если НЕ НДСКомиссии20 = 0 ИЛИ НЕ НДСКомиссии40 = 0 Тогда
							
							ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 * (1 + (СтрПараметрыУслуги.ПроцентКомиссии / 100)) + НДСКомиссии40;
							
							ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 * (1 + (СтрПараметрыУслуги.ПроцентКомиссии / 100)) + НДСКомиссии20; 
							
						КонецЕсли;
						
					КонецЕсли; 
					
					//РАСЧЕТ НДС, НАЧИСЛЯЕТСЯ СВЕРХУ НА СУММУ РАСЧЕТА
					
					Если ЗначениеЗаполнено(СтрПараметрыУслуги.НДС) Тогда 
						
						Если НЕ СтрПараметрыУслуги.НДСТолькоДляКомиссии Тогда
														
							ТекущийРезультатРасчетаУслуги20 = ТекущийРезультатРасчетаУслуги20 * (1+СтрПараметрыУслуги.НДС/100); 
							
							ТекущийРезультатРасчетаУслуги40 = ТекущийРезультатРасчетаУслуги40 * (1+СтрПараметрыУслуги.НДС/100); 
							
						КонецЕсли;
						
					КонецЕсли;
					
					РезультатРасчетаУслуги20 = РезультатРасчетаУслуги20 + ТекущийРезультатРасчетаУслуги20;
					РезультатРасчетаУслуги40 = РезультатРасчетаУслуги40 + ТекущийРезультатРасчетаУслуги40;
					
				КонецЦикла; 
				
				СтрРезультат.Результат20 = РезультатРасчетаУслуги20;
				СтрРезультат.Результат40 = РезультатРасчетаУслуги40;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрыУслуги(Команда)
	
	СтрДерева = Элементы.ТарифыЛиний.ДанныеСтроки(Элементы.ТарифыЛиний.ТекущаяСтрока);
	
	Если СтрДерева.ПолучитьРодителя() <> Неопределено Тогда
		
		ЭлементыТекущейСтроки = СтрДерева.ПолучитьРодителя().ПолучитьЭлементы();
		
		Порядок = -1;
		
		Для Каждого ЭлементТекущейСтроки Из ЭлементыТекущейСтроки Цикл
			
			Если Порядок < ЭлементТекущейСтроки.Порядок Тогда
				
				Порядок = Порядок + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НоваяСтрокаПараметрыУслуги = ЭлементыТекущейСтроки.Добавить(); 		
		НоваяСтрокаПараметрыУслуги.Порядок = Порядок + 1;
		
	Иначе  
		
		ЭлементыТекущейСтроки = СтрДерева.ПолучитьЭлементы();
		
		Порядок = -1;
		
		Для Каждого ЭлементТекущейСтроки Из ЭлементыТекущейСтроки Цикл
			
			Если Порядок < ЭлементТекущейСтроки.Порядок Тогда
				
				Порядок = Порядок + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НоваяСтрокаПараметрыУслуги = ЭлементыТекущейСтроки.Добавить();
		НоваяСтрокаПараметрыУслуги.Порядок = Порядок + 1;
		
	КонецЕсли;
	
	РазвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУслугу(Команда)
	
	ЭлементыТекущейСтроки = ТарифыЛиний.ПолучитьЭлементы(); 
	
	Порядок = -1;
	
	Для Каждого ЭлементТекущейСтроки Из ЭлементыТекущейСтроки Цикл
		
		Если Порядок < ЭлементТекущейСтроки.Порядок Тогда
			
			Порядок = Порядок + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НоваяСтрокаУслуга = ЭлементыТекущейСтроки.Добавить();
	НоваяСтрокаУслуга.Порядок = Порядок + 1; 
	НоваяСтрокаУслуга.Услуга = Истина;
	
	РазвернутьДерево();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Дата = ТекущаяДата();
	
	ЗаполнитьКурсыВалют();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьКурсыВалют()
	
	Объект.КурсыВалют.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Валюты.Ссылка КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Курс
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
	|		ПО Валюты.Ссылка = КурсыВалютСрезПоследних.Валюта.Ссылка
	|ГДЕ
	|	Валюты.Ссылка <> &ВалютаРуб";
	
	Запрос.УстановитьПараметр("ВалютаРуб", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрКурсыВалют = Объект.КурсыВалют.Добавить();
		
		СтрКурсыВалют.Валюта = Выборка.Валюта;
		СтрКурсыВалют.Курс = Выборка.Курс;
		
		Для Каждого Стр Из ТарифыЛиний.ПолучитьЭлементы() Цикл
			
			Для Каждого СтрПодчиненная Из Стр.ПолучитьЭлементы() Цикл
				
				Если СтрПодчиненная.Валюта = СтрКурсыВалют.Валюта Тогда
					
					СтрПодчиненная.Курс = СтрКурсыВалют.Курс;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	НЗ = РегистрыСведений.ПоказателиДляКалькуляции.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Линия.Установить(Объект.Линия); 
	НЗ.Отбор.АгентЛинии.Установить(Объект.АгентЛинии);
	
	НЗ.Отбор.СодержаниеУслугиРодителя.Установить("");
	
	НЗ.Прочитать();
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СодержаниеУслуги");
	ТЗ.Колонки.Добавить("Комментарий");
	ТЗ.Колонки.Добавить("Порядок");
	
	Для Каждого СтрНЗ ИЗ НЗ Цикл
		
		СтрТЧТЗ = ТЗ.Добавить();
		СтрТЧТЗ.СодержаниеУслуги = СтрНЗ.СодержаниеУслуги;
		СтрТЧТЗ.Комментарий = СтрНЗ.Комментарий;
		СтрТЧТЗ.Порядок = СтрНЗ.Порядок;
		
	КонецЦикла;
	
	ТЗ.Сортировать("Порядок Возр");
	
	ТарифыЛиний.ПолучитьЭлементы().Очистить();
	
	Дерево = РеквизитФормыВЗначение("ТарифыЛиний");
	
	Для Каждого Стр Из ТЗ Цикл
		
		
		СтрокаУслуги = Дерево.Строки.Добавить();
		СтрокаУслуги.СодержаниеУслуги = Стр.СодержаниеУслуги;
		СтрокаУслуги.Комментарий = Стр.Комментарий;
		СтрокаУслуги.Услуга = Истина;
		СтрокаУслуги.Порядок = Стр.Порядок;
		
		НЗПодчиненная = РегистрыСведений.ПоказателиДляКалькуляции.СоздатьНаборЗаписей();
		
		НЗПодчиненная.Отбор.Линия.Установить(Объект.Линия);
		НЗПодчиненная.Отбор.АгентЛинии.Установить(Объект.АгентЛинии);
		НЗПодчиненная.Отбор.СодержаниеУслугиРодителя.Установить(Стр.СодержаниеУслуги);
		
		НЗПодчиненная.Прочитать();
		
		ТЗПодчиненная = Новый ТаблицаЗначений;
		ТЗПодчиненная.Колонки.Добавить("Валюта");
		ТЗПодчиненная.Колонки.Добавить("СодержаниеУслуги");
		ТЗПодчиненная.Колонки.Добавить("Комментарий");
		ТЗПодчиненная.Колонки.Добавить("Цена20");
		ТЗПодчиненная.Колонки.Добавить("Цена40");
		ТЗПодчиненная.Колонки.Добавить("Порядок");
		ТЗПодчиненная.Колонки.Добавить("ПроцентКомиссии");
		ТЗПодчиненная.Колонки.Добавить("НачалоДней");
		ТЗПодчиненная.Колонки.Добавить("КонецДней");
		ТЗПодчиненная.Колонки.Добавить("НДС");
		ТЗПодчиненная.Колонки.Добавить("НДСТолькоДляКомиссии");
		
		Для Каждого СтрНЗПодчиненная ИЗ НЗПодчиненная Цикл
			
			СтрТЧТЗПодчиненная = ТЗПодчиненная.Добавить();
			СтрТЧТЗПодчиненная.Валюта = СтрНЗПодчиненная.Валюта;
			СтрТЧТЗПодчиненная.СодержаниеУслуги = СтрНЗПодчиненная.СодержаниеУслуги;
			СтрТЧТЗПодчиненная.Комментарий = СтрНЗПодчиненная.Комментарий;
			СтрТЧТЗПодчиненная.Цена20 = СтрНЗПодчиненная.Цена20;
			СтрТЧТЗПодчиненная.Цена40 = СтрНЗПодчиненная.Цена40;
			СтрТЧТЗПодчиненная.Порядок = СтрНЗПодчиненная.Порядок;
			СтрТЧТЗПодчиненная.ПроцентКомиссии = СтрНЗПодчиненная.ПроцентКомиссии;
			СтрТЧТЗПодчиненная.НачалоДней = СтрНЗПодчиненная.НачалоДней;
			СтрТЧТЗПодчиненная.КонецДней = СтрНЗПодчиненная.КонецДней;
			СтрТЧТЗПодчиненная.НДС = СтрНЗПодчиненная.НДС;
			СтрТЧТЗПодчиненная.НДСТолькоДляКомиссии = СтрНЗПодчиненная.НДСТолькоДляКомиссии;
			
		КонецЦикла;
		
		ТЗПодчиненная.Сортировать("Порядок Возр");
		
		Для Каждого СтрПодчиненная Из ТЗПодчиненная Цикл
			
			СтрокаПараметрыУслуги = СтрокаУслуги.Строки.Добавить();
			СтрокаПараметрыУслуги.Валюта = СтрПодчиненная.Валюта;
			СтрокаПараметрыУслуги.СодержаниеУслуги = СтрПодчиненная.СодержаниеУслуги;
			СтрокаПараметрыУслуги.Комментарий = СтрПодчиненная.Комментарий;
			СтрокаПараметрыУслуги.Цена20 = СтрПодчиненная.Цена20;
			СтрокаПараметрыУслуги.Цена40 = СтрПодчиненная.Цена40;
			СтрокаПараметрыУслуги.Порядок = СтрПодчиненная.Порядок;
			СтрокаПараметрыУслуги.ПроцентКомиссии = СтрПодчиненная.ПроцентКомиссии;
			СтрокаПараметрыУслуги.НачалоДней = СтрПодчиненная.НачалоДней;
			СтрокаПараметрыУслуги.КонецДней = СтрПодчиненная.КонецДней;
			СтрокаПараметрыУслуги.НДС = СтрПодчиненная.НДС; 
			СтрокаПараметрыУслуги.НДСТолькоДляКомиссии = СтрПодчиненная.НДСТолькоДляКомиссии;
		
			Для Каждого СтрКурсВалюты Из Объект.КурсыВалют Цикл
				
				Если СтрКурсВалюты.Валюта = СтрокаПараметрыУслуги.Валюта Тогда
					
					СтрокаПараметрыУслуги.Курс = СтрКурсВалюты.Курс;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ТарифыЛиний");
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифыЛинийПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьНаДругуюЛинию(Команда)  
	
	Оповещение = Новый ОписаниеОповещения("СкопироватьНаДругуюЛиниюПослеВопроса",
		ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,
		"Все данные линии-назначения копирования будут очищены. Вы хотите продолжить?",
		РежимДиалогаВопрос.ДаНет,
		0,
		КодВозвратаДиалога.Да,
		"Предупреждение"
		); 

КонецПроцедуры   

&НаКлиенте
Процедура СкопироватьНаДругуюЛиниюПослеВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияЛинии", 
		ЭтотОбъект);	
		
		ПоказатьВводЗначения(
		Оповещение,
		, 
		"Укажите линию для копирования",
		Тип("СправочникСсылка.Линии")
		);
				
	КонецЕсли;	
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВводаЗначенияЛинии(Результат, Параметры) Экспорт	
	
	Если Не Результат = Неопределено Тогда
		
		ДопПараметры = Новый Структура("Линия", Результат);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияАгентЛинии",ЭтотОбъект,ДопПараметры);	
		
		ПоказатьВводЗначения(
		Оповещение,
		, 
		"Укажите агента линии для копирования",
		Тип("СправочникСсылка.АгентыЛиний")
		);

		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВводаЗначенияАгентЛинии(Результат, Параметры) Экспорт	
	
	Если Не Результат = Неопределено Тогда
		
		СкопироватьНаДругуюЛиниюНаСервере(Параметры.Линия, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНаДругуюЛиниюНаСервере(ЛинияНазначение, АгентЛинииНазначение)
	
	НЗ = РегистрыСведений.ПоказателиДляКалькуляции.СоздатьНаборЗаписей();	
	НЗ.Отбор.Линия.Установить(ЛинияНазначение);
	НЗ.Отбор.АгентЛинии.Установить(АгентЛинииНазначение);
	
	НЗ.Записать();
	
	НЗ = РегистрыСведений.ПоказателиДляКалькуляции.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Линия.Установить(Объект.Линия);
	НЗ.Отбор.АгентЛинии.Установить(Объект.АгентЛинии);
	
	НЗ.Прочитать();
	
	Для Каждого Запись Из НЗ Цикл
		
		МЗ = РегистрыСведений.ПоказателиДляКалькуляции.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МЗ, Запись);
		
		МЗ.Линия = ЛинияНазначение;
		МЗ.АгентЛинии = АгентЛинииНазначение;
		
		МЗ.Записать();
				
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыВалютКурсПриИзменении(Элемент)
	
	Для Каждого Стр Из ТарифыЛиний.ПолучитьЭлементы() Цикл
		
		Для Каждого СтрПодчиненная Из Стр.ПолучитьЭлементы() Цикл
			
			Если СтрПодчиненная.Валюта = Элементы.КурсыВалют.ТекущиеДанные.Валюта Тогда
				
				СтрПодчиненная.Курс = Элементы.КурсыВалют.ТекущиеДанные.Курс;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифыЛинийВалютаПриИзменении(Элемент)
	
	ПараметрыОтбора = Новый Структура("Валюта", Элементы.ТарифыЛиний.ТекущиеДанные.Валюта); 
	
	НайденныеСтроки = Объект.КурсыВалют.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Элементы.ТарифыЛиний.ТекущиеДанные.Курс = НайденныеСтроки[0].Курс; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгентЛинииПриИзменении(Элемент) 
	
	Если ЭтаФорма.Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("СформироватьПослеВопроса",
		ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,
		"Тарифы линий были изменены. Таблица будет очищена, вы хотите продолжить?",
		РежимДиалогаВопрос.ДаНет,
		0,
		КодВозвратаДиалога.Да,
		"Предупреждение"
		); 
		
	Иначе
		
		СформироватьНаСервере();
		
		РазвернутьДерево();
		
		СформироватьСписокВыбораЛинии();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокВыбораЛинии()

   Если ЗначениеЗаполнено(Объект.АгентЛинии) Тогда   
		
		СписокЛинийПоАгенту = ПолучитьСписокЛинийПоАгенту();
		
		Элементы.Линия.СписокВыбора.Очистить();
		
		Для Каждого Стр Из СписокЛинийПоАгенту Цикл
			
			Элементы.Линия.СписокВыбора.Добавить(Стр, Строка(Стр));	
			
		КонецЦикла;
		
	Иначе
		
		Элементы.Линия.СписокВыбора.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокВыбораАгентаЛинии()
	
	Если ЗначениеЗаполнено(Объект.Линия) Тогда   
		
		СписокАгентовПоЛинии = ПолучитьСписокАгентовПоЛинии();
		
		Элементы.АгентЛинии.СписокВыбора.Очистить();
		
		Для Каждого Стр Из СписокАгентовПоЛинии Цикл
			
			Элементы.АгентЛинии.СписокВыбора.Добавить(Стр, Строка(Стр));	
			
		КонецЦикла;
		
	Иначе
		
		Элементы.АгентЛинии.СписокВыбора.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгентЛинииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Линия) Тогда
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьСписокАгентовПоЛинии());
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.АгентЛинии.ПараметрыВыбора = НовыеПараметры;
		
	Иначе
		
		Элементы.АгентЛинии.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЛинияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	Если ЗначениеЗаполнено(Объект.АгентЛинии) Тогда
				
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьСписокЛинийПоАгенту());
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Линия.ПараметрыВыбора = НовыеПараметры; 
				
	Иначе
		
		Элементы.Линия.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокАгентовПоЛинии()

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоответствиеЛинийИАгентЛиний.АгентЛинии КАК АгентЛинии
	               |ИЗ
	               |	РегистрСведений.СоответствиеЛинийИАгентЛиний КАК СоответствиеЛинийИАгентЛиний
	               |ГДЕ
	               |	СоответствиеЛинийИАгентЛиний.Линия = &Линия";
	
	Запрос.УстановитьПараметр("Линия", Объект.Линия);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка.ВыгрузитьКолонку("АгентЛинии");
	
КонецФункции

&НаСервере
Функция ПолучитьСписокЛинийПоАгенту()

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоответствиеЛинийИАгентЛиний.Линия КАК Линия
	               |ИЗ
	               |	РегистрСведений.СоответствиеЛинийИАгентЛиний КАК СоответствиеЛинийИАгентЛиний
	               |ГДЕ
	               |	СоответствиеЛинийИАгентЛиний.АгентЛинии = &АгентЛинии";
	
	Запрос.УстановитьПараметр("АгентЛинии", Объект.АгентЛинии);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка.ВыгрузитьКолонку("Линия");
	
КонецФункции

