
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ЗагрузитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиента1ПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыВПортуПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыАвтотранспортаПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	НЗ = РегистрыСведений.ВидыРасходовСделки.СоздатьНаборЗаписей();
	НЗ.Отбор.ВидСделки.Установить(ВидСделки);
	НЗ.Записать();
		
	Для Каждого Стр Из РасходыКлиента Цикл
		
		МЗ = РегистрыСведений.ВидыРасходовСделки.СоздатьМенеджерЗаписи();
		МЗ.Номенклатура = Стр.Номенклатура;
		МЗ.ВидСделки = Стр.ВидСделки;
		МЗ.Перевыставляемый = Стр.Перевыставляемый;
		МЗ.Записать();
		
	КонецЦикла;
		
КонецПроцедуры     

&НаСервере
Процедура ЗагрузитьНастройки()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ВидыДопРасходовКонтейнераСделки.Номенклатура КАК Номенклатура
	//               |ИЗ
	//               |	РегистрСведений.ВидыДопРасходовКонтейнераСделки КАК ВидыДопРасходовКонтейнераСделки";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Стр = ДопРасходыКонтейнера.Добавить();
	//	Стр.Номенклатура = Выборка.Номенклатура;
	//	
	//КонецЦикла; 
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ВидыДопРасходовАвтотранспортаСделки.Номенклатура КАК Номенклатура
	//			   |ИЗ
	//               |	РегистрСведений.ВидыДопРасходовАвтотранспортаСделки КАК ВидыДопРасходовАвтотранспортаСделки";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Стр = ДопРасходыАвтотранспорта.Добавить();
	//	Стр.Номенклатура = Выборка.Номенклатура;
	//	
	//КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыРасходовСделки.Номенклатура КАК Номенклатура,
	               |	ВидыРасходовСделки.ВидСделки КАК ВидСделки,
	               |	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
	               |ИЗ
	               |	РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	               |ГДЕ
	               |	ВидыРасходовСделки.ВидСделки = &ВидСделки";
	Запрос.УстановитьПараметр("ВидСделки",ВидСделки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Стр = РасходыКлиента.Добавить();
		Стр.Номенклатура = Выборка.Номенклатура;
		Стр.Перевыставляемый = Выборка.Перевыставляемый;
		Стр.ВидСделки = Выборка.ВидСделки;
		
	КонецЦикла;


	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьКонстантуВычитатьНДССПрофита(ВычитатьНДССПрофита)

 Константы.ВычитатьПолнуюСуммуВходящихСНДСИзПрофитаБезНДС.Установить(ВычитатьНДССПрофита);	

КонецПроцедуры 

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНастройки(); 
	
	СохранитьКонстантуВычитатьНДССПрофита(ЭтотОбъект.ВычитатьНДСПеревыставляемый.ВычитатьПолнуюСуммуВходящихСНДСИзПрофитаБезНДС);
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	 Если Не ПодтвержденоЗакрытиеФормы И ЭтаФорма.Модифицированность Тогда
        
        Отказ = Истина;
                                
        ОписаниеОповещения    = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);                
        ТекстВопроса        = НСтр("ru = 'Настройки не сохранены. Закрыть?'");
                
        ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
                    
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
    
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
    
    ПодтвержденоЗакрытиеФормы = Истина;
               
    Закрыть();
    
КонецПроцедуры 

&НаКлиенте
Процедура ВидСделкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ВидСделки) Тогда
		Элементы.РасходыКлиента1Добавить.Доступность = Истина;
	Иначе
		Элементы.РасходыКлиента1Добавить.Доступность = Ложь;
	КонецЕсли;
	
		РасходыКлиента.Очистить();
		ЗагрузитьНастройки(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКлиента1НоменклатураПриИзменении(Элемент)

	//Если ЗначениеЗаполнено(ВидСделки) Тогда
	//	Элементы.ДопРасходыКонтейнера1Добавить = Ложь;	
	//Иначе
	//	РасходыКлиента.Очистить(); 
	//	ПоказатьПредупреждение(,"Необходимо задать вид сделки",,"ОШИБКА"); 
	//	ЭтаФорма.ТекущийЭлемент = Элементы.ВидСделки; 
	//	Модифицированность = Ложь;
	//КонецЕсли;
	
КонецПроцедуры    


&НаКлиенте
Процедура СлужебноеПолеПриИзменении(Элемент)
	
	Если СлужебноеПоле Тогда
		Элементы.РасходыКлиента1ВидСделки.Видимость = Истина;
	Иначе
		Элементы.РасходыКлиента1ВидСделки.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.РасходыКлиента1Добавить.Доступность = Ложь;
	
	ПрочитатьКонстанту(ЭтотОбъект.ВычитатьНДСПеревыставляемый.ВычитатьПолнуюСуммуВходящихСНДСИзПрофитаБезНДС);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьКонстанту(ВычитатьНДС)

 	ВычитатьНДС = Константы.ВычитатьПолнуюСуммуВходящихСНДСИзПрофитаБезНДС.Получить();      
		  

КонецПроцедуры





