
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	//
	//СписокСтатусов = Новый СписокЗначений;
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Новая); 
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВРаботе);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.НаПодходе); 
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Выгружен);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ГотовКВывозу);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Вывезен);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Доставлен);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.СданПорожний);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВПорту);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыходИзПорта);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.SWBОформлен);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ВыставленыВсеРасходы);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.Закрыта);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.ДокументыПодготовлены);
	//СписокСтатусов.Добавить(Перечисления.СтатусыСделок.);
	//
	//
	//
	//ЭлементОтбора.ПравоеЗначение = СписокСтатусов;  
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодстатусБухгалтерия"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.ПодстатусыБухгалтерияСделок.Выставить;
	
	//ЭлементОтбора = СписокВыполненные.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
	//
	//ЭлементОтбора.ПравоеЗначение = СписокСтатусов;  
	
	ЭлементОтбора = СписокВыполненные.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодстатусБухгалтерия"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	ЭлементОтбора.ПравоеЗначение = Перечисления.ПодстатусыБухгалтерияСделок.Выполнено;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыполненныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПутьКПапке" Тогда
		
		ФайловаяСистемаКлиент.ОткрытьПроводник(ПолучитьПуть(ВыбраннаяСтрока)); 
		
	Иначе
		
		ПоказатьЗначение(Неопределено, ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПуть(Ссыл)
	
	Возврат Ссыл.ПутьКПапке;
	
КонецФункции
