Перем ПервоеПроведение;

&После("ПередЗаписью")
Процедура ЛГС_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	ГрупповоеПерепроведение = ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект);
	
	Если ГрупповоеПерепроведение Тогда
		Возврат;
	КонецЕсли;
	
	//Ошибка = "Не удалось провести документ, т.к. в составе сделок есть архивные:"  +Символы.ПС; 
	//Ошибка1 = "";
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СтатусыСделок.Сделка КАК Сделка,
	//|	СтатусыСделок.Статус КАК Статус
	//|ИЗ
	//|	РегистрСведений.СтатусыСделок КАК СтатусыСделок
	//|ГДЕ
	//|	СтатусыСделок.Сделка = &Сделка";
	//
	//Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.ДокументОснование.Сделка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();                                                        
	//
	//
	//Пока Выборка.Следующий() Цикл  
	//	
	//	Если Выборка.Статус = Перечисления.СтатусыСделок.Завершена ИЛИ  Выборка.Статус = Перечисления.СтатусыСделок.Закрыта Тогда
	//		Ошибка1 = Ошибка1+  ЭтотОбъект.ДокументОснование.Сделка +  Символы.ПС;
	//	КонецЕсли;   
	//	
	//КонецЦикла; 
	//
	//
	//
	//Если Ошибка1  <>  "" Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = Ошибка+Ошибка1;
	//	Сообщение.Сообщить();
	//	Отказ = Истина;
	//	
	//КонецЕсли;
	
	ПервоеПроведение = НЕ Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура ЛГС_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ++ Хаунд Устинин С.А. 16.09.2026 ID 9244     
	// Если закрытие месяца, то пропускаем проверку реквизита
	ГрупповаяОбработка = Неопределено;
	РеквизитыПроверены = Неопределено;	
	ДополнительныеСвойства.Свойство("ГрупповоеПерепроведение", ГрупповаяОбработка);
	ДополнительныеСвойства.Свойство("СчитатьРеквизитыПроверенными", РеквизитыПроверены); 
	ГрупповаяОбработка = ?(ГрупповаяОбработка = Неопределено, Ложь, ГрупповаяОбработка); 
	СчитатьРеквизитыПроверенными = ?(СчитатьРеквизитыПроверенными = Неопределено, Ложь, СчитатьРеквизитыПроверенными);
	
	Если НЕ (ГрупповаяОбработка И РеквизитыПроверены) Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда
			Сообщить("Запрещено проведение отчета комитенту без указанного счета на оплату покупателю");
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли  
	// -- Хаунд Устинин С.А. 16.09.2026 ID 9244
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ЛГС_ОбработкаПроведения1(Отказ, РежимПроведения)
	
	Движения.ПеревыставляемыеТоварыУслуги.Записывать = Истина;
	
	
	Для Каждого Стр Из ЭтотОбъект.Товары Цикл    
		
		Движение = Движения.ПеревыставляемыеТоварыУслуги.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Сделка = ЭтотОбъект.ДокументОснование.Сделка;
		Движение.Контрагент = ЭтотОбъект.Контрагент;
		Движение.Сумма = Стр.Сумма + ?(ЭтотОбъект.СуммаВключаетНДС, 0, Стр.СуммаНДС);
		
	КонецЦикла;
	
	
	ЗаписиОтправленияПисьма = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьНаборЗаписей();
	ЗаписиОтправленияПисьма.Отбор.Документ.Установить(Ссылка);	
	
	ЗаписиОтправленияПисьма.Прочитать();
	
	Если ЗаписиОтправленияПисьма.Количество() = 0 И Дата > Дата('20250225') Тогда
		
		НоваяЗаписьПисьма = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьМенеджерЗаписи();
		НоваяЗаписьПисьма.Документ = Ссылка;
		НоваяЗаписьПисьма.Записать();
		
	КонецЕсли;  
		
		НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ЭтотОбъект.ДокументОснование);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 И ЭтотОбъект.ДокументОснование <> Документы.СчетНаОплатуПокупателю.ПустаяСсылка() Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Организация = ЭтотОбъект.ДокументОснование.Организация;
			НоваяЗапись.Документ = ЭтотОбъект.ДокументОснование;
			НоваяЗапись.ДополнительныйСтатус = Перечисления.СтатусыОтгрузки.Отгружен;
			НоваяЗапись.Статус = Перечисления.СтатусОплатыСчета.НеОплачен;
		    НаборЗаписей.Записать();
		Иначе
			Для Каждого ЗаписьРегистра Из НаборЗаписей Цикл
				ЗаписьРегистра.ДополнительныйСтатус = Перечисления.СтатусыОтгрузки.Отгружен;
			КонецЦикла; 
		НаборЗаписей.Записать();
		КонецЕсли;

		
КонецПроцедуры

Функция ОтправитьНаПочтуПриПервомПроведении() Экспорт
	
	Если КонтрольОтправкиНаПочту() Тогда
		
		СтруктураВозврата = ЗаполнитьТабличныйДокументОтчетКомитенту();
		
		ТабДокОтчетКомитенту = СтруктураВозврата.ТабДокОтчетКомитенту;
		ТабДокСФВыдан = СтруктураВозврата.ТабДокСФВыдан;
		
		Если СтруктураВозврата.Флаг Тогда
			
			Вложения = Новый Массив;
			ПочтаОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
			
			ПрикрепитьВложение(ТабДокОтчетКомитенту, Вложения, СтруктураВозврата.ВидПечатнойФормы + " " 
			+ ЭтотОбъект.Контрагент + " №" + ЭтотОбъект.Номер 
			+ " от " + Формат(ЭтотОбъект.Дата, "ДФ='dd.MM.yyyy""г.""'") 
			+ ".pdf");
			
			ПрикрепитьВложение(ТабДокСФВыдан, Вложения, СтруктураВозврата.ВидПечатнойФормыСФ + " " 
			+ ЭтотОбъект.Контрагент + " №" + ЭтотОбъект.Номер 
			+ " от " + Формат(ЭтотОбъект.Дата, "ДФ='dd.MM.yyyy""г.""'") 
			+ ".pdf");												
			
			ЗапросКАдресам = Новый Запрос;
			ЗапросКАдресам.Текст = "ВЫБРАТЬ
			|	КонтрагентыКонтактнаяИнформация.Представление КАК АдресПочты
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|ГДЕ
			|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
			|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид";
			
			ЗапросКАдресам.УстановитьПараметр("Контрагент", Контрагент);
			ЗапросКАдресам.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Email для отправки счетов"));
			
			РезультатЗапросаКАдресам = ЗапросКАдресам.Выполнить();
			
			ВыборкаАдресов = РезультатЗапросаКАдресам.Выбрать();   
			
			ФлагОтправки = Ложь;
			Пока ВыборкаАдресов.Следующий() Цикл
				
				АдресПолучателя = ВыборкаАдресов.АдресПочты;
				
				Если ЗначениеЗаполнено(АдресПолучателя) Тогда
					
					Если НЕ СтрНайти(АдресПолучателя, "@") = 0 Тогда
						
						//АдресПолучателя = "notfmail@gmail.com";
						
						ПараметрыПисьма = СформироватьПараметрыПисьма(АдресПолучателя, ПочтаОтправителя, 
						СтруктураВозврата.ВидПечатнойФормы + " " + ЭтотОбъект.Контрагент + " №" + ЭтотОбъект.Номер + " от " + 
						Формат(ЭтотОбъект.Дата, "ДФ='dd.MM.yyyy""г.""'") + " от " + ЭтотОбъект.Организация.Наименование,
						"Добрый день! Данное письмо сформировано автоматически. Отвечать на него не требуется.
						|Документы во вложении.", Вложения);
						
						РезультатОтправки = ЗначениеЗаполнено(РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтаОтправителя, ПараметрыПисьма));   
						
						Если РезультатОтправки Тогда
							ФлагОтправки = Истина;
						КонецЕсли;
						
					Иначе
						
						ФлагОтправки = Истина;
						
					КонецЕсли;
					
				Иначе
					
					ФлагОтправки = Истина;
					
				КонецЕсли;   
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ФлагОтправки;
	
КонецФункции

Функция ЗаполнитьТабличныйДокументОтчетКомитенту() Экспорт 
	
	ТабДокОтчетКомитенту = Новый ТабличныйДокумент;
	ТабДокСФВыдан = Новый ТабличныйДокумент;
	
	МассивДляСсылки = Новый Массив;
	МассивДляСсылки.Добавить(Ссылка);
	ВидПечатнойФормы = "Отчет комитенту";
	ВидПечатнойФормыСФ = "Счет фактура";
	
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыПечати = Новый Структура;	
	ОбъектыПечати = Новый СписокЗначений;
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	КоллекцияПФОтчет = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ОтчетКомитентуОПродажах");
	
	ИмяМакета = ?(Дата >= Дата(2026,1,1),"СчетФактура2026","СчетФактура1096");
	ИмяМакета = ?(Дата >= Дата(2026,4,1),"СчетФактура26",ИмяМакета);
	
	КоллекцияПФСФ = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ИмяМакета);
	
	Документы.ОтчетКомитентуОПродажах.Печать(МассивДляСсылки, ПараметрыПечати, КоллекцияПФОтчет, ОбъектыПечати, ПараметрыВывода); 
	
	ТабДокОтчетКомитенту = КоллекцияПФОтчет[0].ТабличныйДокумент;
	
	СчетаФактуры = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &Ссылка
	|	И СчетФактураВыданный.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СчетаФактуры.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Документы.СчетФактураВыданный.Печать(СчетаФактуры, ПараметрыПечати, КоллекцияПФСФ, ОбъектыПечати, ПараметрыВывода);
	
	ТабДокСФВыдан = КоллекцияПФСФ[0].ТабличныйДокумент;
	
	Флаг = Товары.Количество() > 0;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТабДокОтчетКомитенту", ТабДокОтчетКомитенту);
	СтруктураВозврата.Вставить("ТабДокСФВыдан", ТабДокСФВыдан);
	СтруктураВозврата.Вставить("Флаг", Флаг);
	СтруктураВозврата.Вставить("ВидПечатнойФормы", ВидПечатнойФормы);
	СтруктураВозврата.Вставить("ВидПечатнойФормыСФ", ВидПечатнойФормыСФ);
	
	Возврат СтруктураВозврата;	
	
КонецФункции

Процедура ПрикрепитьВложение(ТабличныйДокумент, Вложения, Представление)
	
	Попытка   
		
		ПотокФайла = Новый ПотокВПамяти();
		ТабличныйДокумент.Записать(ПотокФайла, ТипФайлаТабличногоДокумента.PDF, );
		
		ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
		ВременноеХранилищеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор); 
		
		ОписаниеВложения = Неопределено;
		
		ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", Представление, ВременноеХранилищеФайла);
		
		Вложения.Добавить(ОписаниеВложения);
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка прикрепления файла", 
		УровеньЖурналаРегистрации.Ошибка, 
		ЭтотОбъект, 
		Ссылка, 
		"Не удалось прикрепить к письму файл " + Представление);		
	КонецПопытки;
	
КонецПроцедуры

Функция КонтрольОтправкиНаПочту() 
	
	НЗОтчетКомит = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьНаборЗаписей();	
	НЗОтчетКомит.Отбор.Документ.Установить(ЭтотОбъект.Ссылка);
	
	НЗОтчетКомит.Прочитать();
	
	Если НЗОтчетКомит.Количество() > 0 Тогда
		
		Возврат НЕ НЗОтчетКомит[0].Отправлен;	
		
	Иначе		
		
		МЗОтчетКомит = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьМенеджерЗаписи();
		
		МЗОтчетКомит.Документ = ЭтотОбъект.Ссылка;
		
		МЗОтчетКомит.Записать();
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьПараметрыПисьма(Получатели, ПочтаОтправителя, ТемаПисьма, ТекстПисьма, Вложения)
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", Получатели);
	ПараметрыПисьма.Вставить("УчетнаяЗапись", ПочтаОтправителя);                                                               
	ПараметрыПисьма.Вставить("АдресОтвета", Получатели);
	ПараметрыПисьма.Вставить("Тема", ТемаПисьма);	
	ПараметрыПисьма.Вставить("Тело", ТекстПисьма);
	ПараметрыПисьма.Вставить("ТипТекста", "ПростойТекст");
	ПараметрыПисьма.Вставить("Вложения", Вложения);
	
	Возврат ПараметрыПисьма;
	
КонецФункции