Перем ПервоеПроведение;
&После("ОбработкаЗаполнения")
Процедура ЛГС_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		ЭтотОбъект.Товары.Очистить();
		
		ЭтотОбъект.СуммаВключаетНДС = Истина;
		ЭтотОбъект.ДокументБезНДС = Ложь;
		
		Для Каждого Стр Из ДанныеЗаполнения.Товары Цикл
			
			СтрТЧ = ЭтотОбъект.Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрТЧ, Стр);
			
		КонецЦикла; 
		
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения; 
		
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ЛГС_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.РеестрОплатыСчетов.Записывать = Истина; 
	
	// Движение по РН РеестрОплатыСчетов
	Стр = Движения.РеестрОплатыСчетов.ДобавитьПриход();
	
	Стр.СчетНаОплату = ЭтотОбъект.Ссылка;
	
	Стр.Сумма = ЭтотОбъект.СуммаДокумента; 
	
	Стр.Период = ЭтотОбъект.Дата; 
	
	Движения.РеестрОплатыСчетов.Записать(); 
	
	ЗаписиОтправленияПисьма = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьНаборЗаписей();
	ЗаписиОтправленияПисьма.Отбор.Документ.Установить(Ссылка);	
	
	ЗаписиОтправленияПисьма.Прочитать();
	
	Если ЗаписиОтправленияПисьма.Количество() = 0 И Дата > Дата('20250225') Тогда
		
		НоваяЗаписьПисьма = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьМенеджерЗаписи();
		НоваяЗаписьПисьма.Документ = Ссылка;
		
		НоваяЗаписьПисьма.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры 

&После("ОбработкаУдаленияПроведения")
Процедура ЛГС_ОбработкаУдаленияПроведения(Отказ)
	
	Движения.РеестрОплатыСчетов.Очистить();
	
	Движения.РеестрОплатыСчетов.Записать();  
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура ЛГС_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//ОтменаВыставленияСчета = Ложь;
	//
	//Если ЗначениеЗаполнено(Сделка) Тогда   
	//	
	//	Если НЕ ЭтотОбъект.ПометкаУдаления Тогда
	//		
	//		Для Каждого Стр Из ЭтотОбъект.Товары Цикл
	//			
	//			Если Стр.Перевыставляемый Тогда  
	//				
	//				Запрос = Новый Запрос;                                                 
	//				Запрос.Текст = 
	//				"ВЫБРАТЬ
	//				|	СУММА(ЕСТЬNULL(ПеревыставляемыеТоварыУслугиОстатки.СуммаОстаток, 0)) КАК СуммаОстаток
	//				|ИЗ
	//				|	РегистрНакопления.ПеревыставляемыеТоварыУслуги.Остатки(
	//				|			,
	//				|			Контрагент = &Контрагент
	//				|				И Номенклатура = &Номенклатура
	//				|				И Сделка = &Сделка) КАК ПеревыставляемыеТоварыУслугиОстатки";
	//				
	//				Запрос.УстановитьПараметр("Сделка", Сделка);
	//				Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
	//				Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
	//				
	//				Выборка = Запрос.Выполнить().Выбрать();
	//				
	//				Если Выборка.Следующий() Тогда
	//					
	//					Если Выборка.СуммаОстаток < Стр.Сумма Тогда
	//						
	//						Сообщение = Новый СообщениеПользователю;
	//						Сообщение.Текст = "По позиции " + Стр.Номенклатура + " недостаточно суммы остатка для перевыставления. Счет не может быть оформлен.";
	//						Сообщение.Сообщить();
	//						
	//						ОтменаВыставленияСчета = Истина;
	//						
	//					КонецЕсли;
	//					
	//				Иначе
	//					
	//					Сообщение = Новый СообщениеПользователю;
	//					Сообщение.Текст = "По позиции " + Стр.Номенклатура + " нет остатков для перевыставления. Счет не может быть оформлен.";
	//					Сообщение.Сообщить();
	//					
	//					ОтменаВыставленияСчета = Истина;
	//					
	//				КонецЕсли;
	//				
	//			КонецЕсли; 
	//			
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли; 
	//
	//Если ОтменаВыставленияСчета Тогда
	//	
	//	Отказ = Истина;
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	
	
	ГрупповоеПерепроведение = ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект);
	
	Если ГрупповоеПерепроведение Тогда
		Возврат;
	КонецЕсли;
	
	//Если  Не ЭтотОбъект.Администратор тогда  
	//	
	//	Ошибка = "Не удалось провести документ, т.к. в составе сделок есть архивные:"  + Символы.ПС; 
	//	Ошибка1 = "";
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СтатусыСделок.Сделка КАК Сделка,
	//	|	СтатусыСделок.Статус КАК Статус
	//	|ИЗ
	//	|	РегистрСведений.СтатусыСделок КАК СтатусыСделок
	//	|ГДЕ
	//	|	СтатусыСделок.Сделка = &Сделка";
	//	
	//	Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.Сделка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	
	//	
	//	Пока Выборка.Следующий() Цикл  
	//		
	//		Если Выборка.Статус = Перечисления.СтатусыСделок.Завершена ИЛИ  Выборка.Статус = Перечисления.СтатусыСделок.Закрыта Тогда
	//			Ошибка1 = Ошибка1+ ЭтотОбъект.Сделка +  Символы.ПС;
	//		КонецЕсли;   
	//		
	//	КонецЦикла; 
	//	
	//	
	//	
	//	Если Ошибка1  <>  "" Тогда
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = Ошибка+Ошибка1;
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;    
	
	//Доработка 13.02   
	
	//Если НЕ ПервоеПроведение И Проведен Тогда
	//	
	//	ОплаченнаяСумма = Документы.СчетНаОплатуПокупателю.ОплаченнаяСуммаСчета(
	//		ЭтотОбъект.Организация, 
	//		ЭтотОбъект.Ссылка);
	//	
	//	Если ОплаченнаяСумма >= ЭтотОбъект.СуммаДокумента Тогда
	//		
	
	//		Если НЕ ЭтотОбъект.ПометкаУдаления Тогда
	//			
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = "Счет полностью оплачен. Изменение документа запрещено! " + 
	//				"Сумма счета: " + Формат(ЭтотОбъект.СуммаДокумента, "ЧДЦ=2") + ", " +
	//				"Оплачено: " + Формат(ОплаченнаяСумма, "ЧДЦ=2");
	//			Сообщение.Сообщить();
	//			
	//			Отказ = Истина;
	//			Возврат;
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;  
	
	//Доработка 13.02 
	
	УстановитьНомер();
	
	ПервоеПроведение = НЕ Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
КонецПроцедуры

Процедура УстановитьНомер()
	
	Если ЗначениеЗаполнено(Номер) Тогда
		Возврат;		
	КонецЕсли;
	
	ИмяФункциональнойОпции = "ПрефиксыОрганизаций";
	ИмяПараметраФункциональнойОпции = "Организация";
	
	Префикс = "00-";
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Организация.Префикс) Тогда
		
		Префикс = Организация.Префикс + "-";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Номер КАК Номер
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	СчетНаОплатуПокупателю.Дата >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И СчетНаОплатуПокупателю.Дата <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьВыборка = Ложь;
	
	ЧислоНомера = 1;
	
	Пока Выборка.Следующий() Цикл
		
		Если (Число(Прав(СокрЛП(Выборка.Номер), 2)) + 1) > ЧислоНомера Тогда
			
			ЧислоНомера = Число(Прав(СокрЛП(Выборка.Номер), 2)) + 1; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Номер = СтрШаблон("%1%2%3", Префикс, Формат(Дата, "ДФ=ddMM"), Формат(ЧислоНомера, "ЧЦ=2; ЧН=0; ЧВН=; ЧГ=0"));
	
КонецПроцедуры

Функция ОтправитьНаПочтуПриПервомПроведении() Экспорт
	
	Если КонтрольОтправкиНаПочту() Тогда                                          
		
		СтруктураВозврата = ЗаполнитьТабличныйДокументСчетаНаОплату(); 
		
		ТабДок = СтруктураВозврата.ТабДок;
		
		Если СтруктураВозврата.Флаг Тогда
			
			Вложения = Новый Массив;
			ПочтаОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;  
				
				ПотокФайла = Новый ПотокВПамяти();
				ТабДок.Записать(ПотокФайла, ТипФайлаТабличногоДокумента.pdf);
				
				ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
				ВременноеХранилищеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор); 
				
				ОписаниеВложения = Неопределено;
				
				ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", "Счет на оплату " + ЭтотОбъект.Контрагент + " №" + ЭтотОбъект.Номер + " от " + Формат(ЭтотОбъект.Дата, "ДФ='dd.MM.yyyy""г.""'") + ".pdf", ВременноеХранилищеФайла);
				
				Вложения.Добавить(ОписаниеВложения);
				
				//Запрос = Новый Запрос;
				//Запрос.Текст = "ВЫБРАТЬ
				//               |	СчетНаОплатуПокупателюПрисоединенныеФайлы.Ссылка КАК Ссылка
				//               |ИЗ
				//               |	Справочник.СчетНаОплатуПокупателюПрисоединенныеФайлы КАК СчетНаОплатуПокупателюПрисоединенныеФайлы
				//               |ГДЕ
				//               |	СчетНаОплатуПокупателюПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
				//               |	И СчетНаОплатуПокупателюПрисоединенныеФайлы.ВладелецФайла = &СчетНаОплату";
				//
				//Запрос.УстановитьПараметр("СчетНаОплату", Ссылка);
				//
				//Выборка = Запрос.Выполнить().Выбрать();
				//
				//Пока Выборка.Следующий() Цикл
				//	
				//	ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Ссылка); 
				//	
				//	ВременноеХранилищеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор); 
				//	
				//	ОписаниеВложения = Неопределено;
				//	
				//	ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", Выборка.Ссылка.Наименование + "." + Выборка.Ссылка.Расширение, ВременноеХранилищеФайла);
				//	
				//	Вложения.Добавить(ОписаниеВложения);
				//	
				//КонецЦикла;
							
			ЗапросКАдресам = Новый Запрос;
			ЗапросКАдресам.Текст = "ВЫБРАТЬ
			|	КонтрагентыКонтактнаяИнформация.Представление КАК АдресПочты
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|ГДЕ
			|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
			|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид";
			
			ЗапросКАдресам.УстановитьПараметр("Контрагент", Контрагент);
			ЗапросКАдресам.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Email для отправки счетов"));
			
			РезультатЗапросаКАдресам = ЗапросКАдресам.Выполнить();
			
			ВыборкаАдресов = РезультатЗапросаКАдресам.Выбрать();  
			
			ФлагОтправки = Ложь;
			Пока ВыборкаАдресов.Следующий() Цикл
				
				АдресПолучателя = ВыборкаАдресов.АдресПочты;
				
				Если ЗначениеЗаполнено(АдресПолучателя) Тогда   
					
					Если НЕ СтрНайти(АдресПолучателя, "@") = 0 Тогда
						
						ПараметрыПисьма = СформироватьПараметрыПисьма(АдресПолучателя, ПочтаОтправителя, "Счет на оплату " + ЭтотОбъект.Контрагент + " №" + ЭтотОбъект.Номер + " от " + 
						Формат(ЭтотОбъект.Дата, "ДФ='dd.MM.yyyy""г.""'") + " от " + ЭтотОбъект.Организация.Наименование,
						"Добрый день! Данное письмо сформировано автоматически. Отвечать на него не требуется.
						|Документы во вложении.", Вложения);
						
						РезультатОтправки = ЗначениеЗаполнено(РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтаОтправителя, ПараметрыПисьма));   
						
						Если РезультатОтправки Тогда
							ФлагОтправки = Истина;
						КонецЕсли;
						
					Иначе
						
						ФлагОтправки = Истина;
						
					КонецЕсли;
					
				Иначе
					
					ФлагОтправки = Истина;	
					
				КонецЕсли;   
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ФлагОтправки;
	
КонецФункции  

Функция ЗаполнитьТабличныйДокументСчетаНаОплату() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	МассивДляСсылки = Новый Массив;
	МассивДляСсылки.Добавить(Ссылка);
	
	ТипыОбъектов = ОбщегоНазначенияБП.РазложитьСписокПоТипамОбъектов(МассивДляСсылки);
	
	Для каждого ОбъектыТипа из ТипыОбъектов Цикл
		
		Сведения = Документы.СчетНаОплатуПокупателю.ПолучитьТаблицуСведенийСчетаНаОплату(ОбъектыТипа.Значение, Неопределено, Неопределено);
		ОбъектыПечатиВрем = Новый СписокЗначений;
		ПараметрыПечати = Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
		ПараметрыПечати.Вставить("ВыводитьКоносамент", Истина);
		ПараметрыПечати.Вставить("ВыводитьФаксимиле", Истина);
		
		ТабДок.Вывести(ПечатьТорговыхДокументов.ПечатьСчетаНаОплату(Сведения, ОбъектыПечатиВрем, ПараметрыПечати));
		
	КонецЦикла;
	
	Флаг = Товары.Количество() > 0;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТабДок", ТабДок);
	СтруктураВозврата.Вставить("Флаг", Флаг);
	
	Возврат СтруктураВозврата;	
	
КонецФункции 

Функция КонтрольОтправкиНаПочту() 
	
	НЗРеализаций = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьНаборЗаписей();	
	НЗРеализаций.Отбор.Документ.Установить(ЭтотОбъект.Ссылка);
	
	НЗРеализаций.Прочитать();
	
	Если НЗРеализаций.Количество() > 0 Тогда
		
		Возврат НЕ НЗРеализаций[0].Отправлен;	
		
	Иначе		
		
		МЗРеализаций = РегистрыСведений.ЛГС_КонтрольОтправкиПисемКонтрагентам.СоздатьМенеджерЗаписи();
		
		МЗРеализаций.Документ = ЭтотОбъект.Ссылка;
		
		МЗРеализаций.Записать();
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьПараметрыПисьма(Получатели, ПочтаОтправителя, ТемаПисьма, ТекстПисьма, Вложения)
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", Получатели);
	ПараметрыПисьма.Вставить("УчетнаяЗапись", ПочтаОтправителя);                                                               
	ПараметрыПисьма.Вставить("АдресОтвета", Получатели);
	ПараметрыПисьма.Вставить("Тема", ТемаПисьма);	
	ПараметрыПисьма.Вставить("Тело", ТекстПисьма);
	ПараметрыПисьма.Вставить("ТипТекста", "ПростойТекст");
	ПараметрыПисьма.Вставить("Вложения", Вложения);
	
	Возврат ПараметрыПисьма;
	
КонецФункции

&После("ПриЗаписи")
Процедура ЛГС_ПриЗаписи(Отказ)
	
	
	
КонецПроцедуры
