
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФормаДок = ПолучитьФорму("Документ.ПоручениеЭкспедитору.Форма.ФормаДокумента");
		
	ФормаДок.Объект.Дата = ТекущаяДата();
	ФормаДок.Объект.ДокументОснование = ПараметрКоманды;
	ФормаДок.Объект.Экспедитор = ПолучитьОрганизацию(ПараметрКоманды);
	ФормаДок.Объект.Клиент = ПолучитьКонтрагента(ПараметрКоманды);
	ФормаДок.Объект.Договор = ПолучитьОсновнойДоговорКонтрагента(ПараметрКоманды);
	ФормаДок.Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	ФормаДок.Объект.Номер = ПолучитьНомер(ПараметрКоманды);
	ФормаДок.Объект.ОсобыеОтметки = ПолучитьНомер(ПараметрКоманды) + ", " + ПолучитьНомерКоносамента(ПараметрКоманды);
	ФормаДок.Объект.ВесБруттоНетто = ПолучитьВес(ПараметрКоманды);
	ФормаДок.Объект.КоличествоМестВидУпаковки = ПолучитьКоличествоГрузовыхМест(ПараметрКоманды);
	ФормаДок.Объект.ТоварыГотовыеКОтправкеМестоИДата = ПолучитьГруз(ПараметрКоманды);
	ФормаДок.Объект.ПунктОтправления = ПолучитьПортОтгрузки(ПараметрКоманды);
	ФормаДок.Объект.ПунктНазначения = ПолучитьНаправления(ПараметрКоманды);
	ФормаДок.Объект.ВидТранспорта = ПолучитьВидТранспорта(ПараметрКоманды);
	ФормаДок.Объект.ТребуемыеДокументы = "коносамент"; 
	
	СписокРеализацийИОтчетовКомитенту = ПолучитьСписокРеализацийИОтчетовКомитентуПоСделке(ПараметрКоманды);
	
	Для Каждого Стр Из СписокРеализацийИОтчетовКомитенту Цикл
		
		Если ТипЗнч(Стр) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			СтрТЧ = ФормаДок.Объект.РеализацииТоваровИУслуг.Добавить();
			СтрТЧ.Реализация = Стр; 
			
			СоставНоменклатуры = ПолучитьСоставНоменклатуры(Стр);
			
			Для Каждого СтрНом Из СоставНоменклатуры Цикл
				
				СтрТЧНом = ФормаДок.Объект.СоставНоменклатуры.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрТЧНом, СтрНом);
				
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(Стр) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			
			СтрТЧ = ФормаДок.Объект.ОтчетыКомитентам.Добавить();
			СтрТЧ.ОтчетКомитенту = Стр; 
			
			СоставНоменклатуры = ПолучитьСоставНоменклатурыОтчетаКомитенту(Стр);
			
			Для Каждого СтрНом Из СоставНоменклатуры Цикл
				
				СтрТЧНом = ФормаДок.Объект.СоставНоменклатуры.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрТЧНом, СтрНом);
				
			КонецЦикла;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПолучитьГрузополучателя(ПараметрКоманды)) Тогда
		
		ФормаДок.Объект.Грузополучатель	= ПолучитьГрузополучателя(ПараметрКоманды);
		
	Иначе
		
		ФормаДок.Объект.Грузополучатель = ПолучитьКонтрагента(ПараметрКоманды);
		
	КонецЕсли;
	
	ФормаДок.Элементы.ДокументОснование.Видимость = Истина;  
	
	ФормаДок.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидТранспорта(ПараметрКоманды)

	Возврат ПараметрКоманды.ВидТранспорта;	

КонецФункции


&НаСервере
Функция ПолучитьСоставНоменклатуры(Док) 
	
	МассивНоменклатуры = Новый Массив;
	
	ДобавляемыйДокумент = Док.ПолучитьОбъект();
	
	Для Каждого Стр ИЗ ДобавляемыйДокумент.Услуги Цикл 
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Содержание", Стр.Содержание);
		НоваяСтрока.Вставить("Количество", Стр.Количество);
		НоваяСтрока.Вставить("Цена", Стр.Цена);
		НоваяСтрока.Вставить("Сумма", Стр.Сумма);
		НоваяСтрока.Вставить("СуммаНДС", Стр.СуммаНДС);
		НоваяСтрока.Вставить("Документ", ДобавляемыйДокумент.Ссылка);
		НоваяСтрока.Вставить("Валюта", ДобавляемыйДокумент.ВалютаДокумента);
		НоваяСтрока.Вставить("СтавкаНДС", Стр.СтавкаНДС); 
		
		МассивНоменклатуры.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

&НаСервере
Функция ПолучитьСоставНоменклатурыОтчетаКомитенту(Док) 
	
	МассивНоменклатуры = Новый Массив;
	
	ДобавляемыйДокумент = Док.ПолучитьОбъект();
	
	Для Каждого Стр ИЗ ДобавляемыйДокумент.Товары Цикл 
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Содержание", Стр.Содержание);
		НоваяСтрока.Вставить("Количество", Стр.Количество);
		НоваяСтрока.Вставить("Цена", Стр.Цена);
		НоваяСтрока.Вставить("Сумма", Стр.Сумма);
		НоваяСтрока.Вставить("СуммаНДС", Стр.СуммаНДС);
		НоваяСтрока.Вставить("Документ", ДобавляемыйДокумент.Ссылка);
		НоваяСтрока.Вставить("Валюта", ДобавляемыйДокумент.ВалютаДокумента);
		НоваяСтрока.Вставить("СтавкаНДС", Стр.СтавкаНДС); 
		
		МассивНоменклатуры.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

&НаСервере
Функция ПолучитьВес(ПараметрКоманды)
	
	Возврат Формат(ПараметрКоманды.Контейнеры.Итог("Вес"),"ЧГ=");	
	
КонецФункции 

&НаСервере
Функция ПолучитьПортОтгрузки(ПараметрКоманды)
	
	Возврат ПараметрКоманды.ПортОтгрузки;	
	
КонецФункции 

&НаСервере
Функция ПолучитьНаправления(ПараметрКоманды)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Направление");
	
	Для Каждого Стр Из ПараметрКоманды.ИнформацияОПеревозчиках Цикл
		
		СтрТЗ = ТЗ.Добавить();
		СтрТЗ.Направление = Стр.Направление;
		
	КонецЦикла; 
	
	ТЗ.Свернуть("Направление"); 
	
	Направления = "";
	
	Для Каждого СтрТЗ Из ТЗ Цикл
		
		Если Направления = "" Тогда
			
			Направления = Строка(СтрТЗ.Направление);
			
		Иначе
			
			Направления = Направления + ", " + Строка(СтрТЗ.Направление);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Направления;	
	
КонецФункции 

&НаСервере
Функция ПолучитьСписокРеализацийИОтчетовКомитентуПоСделке(ПараметрКоманды)
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Сделка = &Сделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслуг.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажах.Ссылка
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	               |ГДЕ
	               |	ОтчетКомитентуОПродажах.ДокументОснование.Сделка = &Сделка
	               |	И ОтчетКомитентуОПродажах.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомитентуОПродажах.Ссылка";
	
	Запрос.УстановитьПараметр("Сделка", ПараметрКоманды.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Массив.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции	

&НаСервере
Функция ПолучитьКоличествоГрузовыхМест(ПараметрКоманды)
	
	Возврат ПараметрКоманды.КоличествоГрузовыхМест;	
	
КонецФункции

&НаСервере
Функция ПолучитьГруз(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Груз;	
	
КонецФункции

&НаСервере
Функция ПолучитьОрганизацию(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Организация;	
	
КонецФункции

&НаСервере
Функция ПолучитьНомерКоносамента(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Коносамент.Наименование;	
	
КонецФункции

&НаСервере
Функция ПолучитьНомер(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Номер;	
	
КонецФункции

&НаСервере
Функция ПолучитьКонтрагента(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Контрагент;	
	
КонецФункции   

&НаСервере
Функция ПолучитьГрузополучателя(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Грузополучатель;	
	
КонецФункции 

&НаСервере
Функция ПолучитьОсновнойДоговорКонтрагента(ПараметрКоманды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("Контрагент", ПараметрКоманды.Контрагент);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции
