
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Стр Из Параметры.Контейнеры Цикл
		
		СтрТЧ = ЭтотОбъект.СписокКонтейнеров.Добавить();
		СтрТЧ.Контейнер = Стр.Контейнер;
		СтрТЧ.Выбран = Стр.Выбран;
		
	КонецЦикла;  
	
	ЭтотОбъект.ИмяСобытия = Параметры.ИмяСобытия;
		
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	
	СтрокаКонтейнеры = "";
	
	Для Каждого Стр ИЗ ЭтотОбъект.СписокКонтейнеров Цикл
		
		Если Стр.Выбран Тогда
			
			Если СтрокаКонтейнеры = "" Тогда
				
				СтрокаКонтейнеры = Строка(Стр.Контейнер);
				
			Иначе
				
				СтрокаКонтейнеры = СтрокаКонтейнеры + ", " + Строка(Стр.Контейнер);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Оповестить(ЭтотОбъект.ИмяСобытия, СтрокаКонтейнеры, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокКонтейнеровВыбранПриИзменении(Элемент)
	
	Если Элементы.СписокКонтейнеров.ТекущиеДанные.Выбран = Ложь Тогда
		
		ЕстьВыбранныеКонтейнеры = Ложь;
		
		Для Каждого Стр Из ЭтотОбъект.СписокКонтейнеров Цикл
			
			Если Стр.Выбран Тогда
				
				ЕстьВыбранныеКонтейнеры = Истина;	
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ЕстьВыбранныеКонтейнеры Тогда
			
			Элементы.СписокКонтейнеров.ТекущиеДанные.Выбран = Истина;
			
			ОписаниеОповещения = Новый ОписаниеОповещения();
			
			ПоказатьПредупреждение(ОписаниеОповещения, "Необходимо выбрать хотя бы один контейнер" , 60, "Ошибка");
			
		КонецЕсли;  
		
	КонецЕсли;
	
КонецПроцедуры

