
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбъектыПечати = Новый СписокЗначений; 
	ИмяМакета = "Профит сделки"; 
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Профит сделки");
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Профит сделки"; 
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = СформироватьПечатнуюФормуПрофитаСделки(ПараметрКоманды, ОбъектыПечати, ИмяМакета); 
	
	Если НЕ КоллекцияПечатныхФорм[0].ТабличныйДокумент = Неопределено Тогда
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуПрофитаСделки(МассивОбъектов, ОбъектыПечати, ИмяМакета) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПрофитСделки"; 
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	
	Если МассивОбъектов.Количество() > 1 Тогда
		
		ТабличныйДокумент = ЗаполнитьТабличныйДокументПрофитовСделок(ТабличныйДокумент, МассивОбъектов);	
		
	Иначе
		
		ТабличныйДокумент = ЗаполнитьТабличныйДокументПрофитСделки(ТабличныйДокумент, МассивОбъектов[0]); 
		
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТабличныйДокументПрофитСделки(ТабДок, Док)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Сделка.ПрофитСделки");	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Номер = Док.Номер;		
	
	ТабДок.Вывести(ОбластьШапка);
	
	// Суммы БезНДС Итоговые
	СуммаБезНДСИтогоИсходящиеСчета = 0;
	СуммаБезНДСИтогоВходящиеСчета = 0; 
	
	СуммаБезНДСИтогоИсходящиеАкты = 0;	
	СуммаБезНДСИтогоВходящиеАкты = 0;
	
	// Суммы НДС Итоговые
	СуммаНДСИтогоИсходящиеСчета = 0;
	СуммаНДСИтогоВходящиеСчета = 0; 
	//СуммаНДСИтогоВходящиеСчетаПеревыставляемый = 0;
	
	СуммаНДСИтогоИсходящиеАкты = 0;	
	СуммаНДСИтогоВходящиеАкты = 0;
	//СуммаНДСИтогоВходящиеАктыПеревыставляемый = 0;
	
	// Суммы СНДС Итоговые
	СуммаСНДСИтогоИсходящиеСчета = 0;
	СуммаСНДСИтогоВходящиеСчета = 0; 
	
	СуммаСНДСИтогоИсходящиеАкты = 0;	
	СуммаСНДСИтогоВходящиеАкты = 0;  
	
	
	
	// Структура НДС по входящим документам
	СтруктураНДСВходящие = Новый Структура;
	СтруктураНДСВходящие.Вставить("АктВходящийВсегоНДС",0);
	СтруктураНДСВходящие.Вставить("АктВходящийНеПеревыставляемыйНДС",0);
	СтруктураНДСВходящие.Вставить("АктВходящийПеревыставляемыйНДС",0);
	СтруктураНДСВходящие.Вставить("СчетВходящийВсегоНДС",0);
	СтруктураНДСВходящие.Вставить("СчетВходящийНеПеревыставляемыйНДС",0);
	СтруктураНДСВходящие.Вставить("СчетВходящийПеревыставляемыйНДС",0); 
	
	// Структура НДС по исходящим документам
	СтруктураНДСИсходящие = Новый Структура;
	СтруктураНДСИсходящие.Вставить("АктИсходящийВсегоНДС",0);
	СтруктураНДСИсходящие.Вставить("АктИсходящийНеПеревыставляемыйНДС",0);
	СтруктураНДСИсходящие.Вставить("АктИсходящийПеревыставляемыйНДС",0);
	СтруктураНДСИсходящие.Вставить("СчетИсходящийВсегоНДС",0);
	СтруктураНДСИсходящие.Вставить("СчетИсходящийНеПеревыставляемыйНДС",0);
	СтруктураНДСИсходящие.Вставить("СчетИсходящийПеревыставляемыйНДС",0); 
	
	
	// ++ ХАУНД Устинин 01.06.2026 ID: 3196
	//Если Док.Организация.ИНН = "5074080761" Тогда // Декларант
	//	
	//	Номенклатура1 = Справочники.Номенклатура.ПустаяСсылка();  
	//	НоменклатураВозмещаемыеРасходы = Справочники.Номенклатура.ПустаяСсылка();
	//	
	//	
	//ИначеЕсли Док.Организация.ИНН = "2315213101" Тогда // Логист 
	//	
	//	Номенклатура1 = Справочники.Номенклатура.НайтиПоКоду("00-00000389"); // Таможенные платежи
	//	
	//КонецЕсли; 
	// -- ХАУНД Устинин 01.06.2026 ID: 3196
	
	
	ЗапросИсходящиеСчета = Новый Запрос;
	ЗапросИсходящиеСчета.Текст = РасчетПрофитаСделокСервер.ТекстЗапросаИсходящиеСчета(); 	
	ЗапросИсходящиеСчета.УстановитьПараметр("Сделка", Док); 
	
	ВыборкаИсходящиеСчета = ЗапросИсходящиеСчета.Выполнить().Выгрузить();
	
	ЗапросВходящиеСчета = Новый Запрос;
	ЗапросВходящиеСчета.Текст = РасчетПрофитаСделокСервер.ТекстЗапросаВходящиеСчета(); 	
	ЗапросВходящиеСчета.УстановитьПараметр("Сделка", Док);
	
	
	ВыборкаВходящиеСчета = ЗапросВходящиеСчета.Выполнить().Выгрузить();
	
	Индекс = 0;
	
	Если ВыборкаИсходящиеСчета.Количество() > ВыборкаВходящиеСчета.Количество() Тогда
		
		Пока Индекс < ВыборкаИсходящиеСчета.Количество() Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.ДокументИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Ссылка;
			ОбластьСтрока.Параметры.СчетИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Счет;
			
			Если ТипЗнч(ВыборкаИсходящиеСчета[Индекс].Ссылка) = Тип("Строка") Тогда
				
				ОбластьСтрока.Параметры.ДокументИсходящиеСчетаПредставление = "Наличный доход (" + ВыборкаИсходящиеСчета[Индекс].Ссылка + ")";
				ОбластьСтрока.Параметры.СчетИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Ссылка;
				
			Иначе
				
				Если ТипЗнч(ВыборкаИсходящиеСчета[Индекс].Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					
					ОбластьСтрока.Параметры.ДокументИсходящиеСчетаПредставление = "Акт покупателю №" + ВыборкаИсходящиеСчета[Индекс].Ссылка.Номер + " от " + Формат(ВыборкаИсходящиеСчета[Индекс].Ссылка.Дата,"ДФ=dd.MM.yy");
					
				ИначеЕсли ТипЗнч(ВыборкаИсходящиеСчета[Индекс].Ссылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
					
					ОбластьСтрока.Параметры.ДокументИсходящиеСчетаПредставление = "Отчет комитенту №" + ВыборкаИсходящиеСчета[Индекс].Ссылка.Номер + " от " + Формат(ВыборкаИсходящиеСчета[Индекс].Ссылка.Дата,"ДФ=dd.MM.yy");
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаИсходящиеСчета[Индекс].Счет) Тогда
					
					ОбластьСтрока.Параметры.СчетИсходящиеСчетаПредставление = "Счет покупателю №" + ВыборкаИсходящиеСчета[Индекс].Счет.Номер + " от " + Формат(ВыборкаИсходящиеСчета[Индекс].Счет.Дата,"ДФ=dd.MM.yy");
					ОбластьСтрока.Параметры.СчетИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Счет;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОбластьСтрока.Параметры.СуммаБезНДСИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].СуммаБезНДССчета;
			ОбластьСтрока.Параметры.СуммаБезНДСИсходящиеАкты = ВыборкаИсходящиеСчета[Индекс].СуммаБезНДСАкта;
			
			ОбластьСтрока.Параметры.СуммаНДСИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].СуммаНДССчета;
			ОбластьСтрока.Параметры.СуммаНДСИсходящиеАкты = ВыборкаИсходящиеСчета[Индекс].СуммаНДСАкта;
			
			ОбластьСтрока.Параметры.СуммаСНДСИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].СуммаСНДССчета;
			ОбластьСтрока.Параметры.СуммаСНДСИсходящиеАкты = ВыборкаИсходящиеСчета[Индекс].СуммаСНДСАкта;
			
			Если ВыборкаИсходящиеСчета[Индекс].Статус = Null Тогда
				
				ОбластьСтрока.Параметры.ОплатаИсходящиеСчета = Перечисления.СтатусОплатыСчета.НеОплачен;
				
			Иначе
				
				ОбластьСтрока.Параметры.ОплатаИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Статус;
				
			КонецЕсли;
			
			Если Индекс < ВыборкаВходящиеСчета.Количество() Тогда
				
				Если ТипЗнч(ВыборкаВходящиеСчета[Индекс].Ссылка) = Тип("Строка") Тогда
					
					ОбластьСтрока.Параметры.ДокументВходящиеСчета = Док.Ссылка;
					ОбластьСтрока.Параметры.ДокументВходящиеСчетаПредставление = "Наличный расход (" + ВыборкаВходящиеСчета[Индекс].Ссылка + ")";
					
				Иначе
					
					Если ЗначениеЗаполнено(ВыборкаВходящиеСчета[Индекс].Ссылка) Тогда
						
						Если ТипЗнч(ВыборкаВходящиеСчета[Индекс].Ссылка) = Тип("ДокументСсылка.ОперацияБух") Тогда
							
							ОбластьСтрока.Параметры.ДокументВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Ссылка;
							ОбластьСтрока.Параметры.ДокументВходящиеСчетаПредставление = "Операция №" + ВыборкаВходящиеСчета[Индекс].Ссылка.Номер + " от " + Формат(ВыборкаВходящиеСчета[Индекс].Ссылка.Дата,"ДФ=dd.MM.yy");
							
						Иначе
							
							ОбластьСтрока.Параметры.ДокументВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Ссылка;
							ОбластьСтрока.Параметры.ДокументВходящиеСчетаПредставление = "Акт от поставщика №" + ВыборкаВходящиеСчета[Индекс].Ссылка.НомерВходящегоДокумента + " от " + Формат(ВыборкаВходящиеСчета[Индекс].Ссылка.ДатаВходящегоДокумента,"ДФ=dd.MM.yy");	
						
						КонецЕсли;
						
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВыборкаВходящиеСчета[Индекс].Счет) Тогда
						
						ОбластьСтрока.Параметры.СчетВходящиеСчетаПредставление = "Счет от поставщика №" + ВыборкаВходящиеСчета[Индекс].Счет.НомерВходящегоДокумента + " от " + Формат(ВыборкаВходящиеСчета[Индекс].Счет.ДатаВходящегоДокумента,"ДФ=dd.MM.yy");
						ОбластьСтрока.Параметры.СчетВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Счет;
						
					КонецЕсли;
					
				КонецЕсли;
				
				ОбластьСтрока.Параметры.СуммаБезНДСВходящиеСчета = ВыборкаВходящиеСчета[Индекс].СуммаБезНДССчета;
				ОбластьСтрока.Параметры.СуммаБезНДСВходящиеАкты = ВыборкаВходящиеСчета[Индекс].СуммаБезНДСАкта;
				
				ОбластьСтрока.Параметры.СуммаНДСВходящиеСчета = ВыборкаВходящиеСчета[Индекс].СуммаНДССчета;
				ОбластьСтрока.Параметры.СуммаНДСВходящиеАкты = ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта; 
				
				//Если ВыборкаВходящиеСчета[Индекс].СчетПеревыставляемый <> Null Тогда 
				//	
				//	Если ВыборкаВходящиеСчета[Индекс].СчетПеревыставляемый Тогда  
				//		
				//		СуммаНДСИтогоВходящиеСчетаПеревыставляемый = СуммаНДСИтогоВходящиеСчетаПеревыставляемый + ВыборкаВходящиеСчета[Индекс].СуммаНДССчета;
				//		
				//	Иначе
				//		
				//	КонецЕсли;  
				//	
				//КонецЕсли;
				//
				//Если ВыборкаВходящиеСчета[Индекс].АктПеревыставляемый <> Null Тогда  
				//	
				//	Если ВыборкаВходящиеСчета[Индекс].АктПеревыставляемый Тогда  
				//		
				//		СуммаНДСИтогоВходящиеАктыПеревыставляемый = СуммаНДСИтогоВходящиеАктыПеревыставляемый + ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта;
				//		
				//	Иначе
				//		
				//	КонецЕсли;
				//	
				//КонецЕсли;
				
				ОбластьСтрока.Параметры.СуммаСНДСВходящиеСчета = ВыборкаВходящиеСчета[Индекс].СуммаСНДССчета;
				ОбластьСтрока.Параметры.СуммаСНДСВходящиеАкты = ВыборкаВходящиеСчета[Индекс].СуммаСНДСАкта;
				
				СуммаБезНДСИтогоВходящиеСчета = СуммаБезНДСИтогоВходящиеСчета + ВыборкаВходящиеСчета[Индекс].СуммаБезНДССчета;
				СуммаБезНДСИтогоВходящиеАкты = СуммаБезНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаБезНДСАкта;
				
				СуммаНДСИтогоВходящиеСчета = СуммаНДСИтогоВходящиеСчета + ВыборкаВходящиеСчета[Индекс].СуммаНДССчета;
				СуммаНДСИтогоВходящиеАкты = СуммаНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта; 
				
				
				
				СуммаСНДСИтогоВходящиеСчета = СуммаСНДСИтогоВходящиеСчета + ВыборкаВходящиеСчета[Индекс].СуммаСНДССчета;
				СуммаСНДСИтогоВходящиеАкты = СуммаСНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаСНДСАкта;
				
				Если ВыборкаВходящиеСчета[Индекс].Статус = Null Тогда
					
					ОбластьСтрока.Параметры.ОплатаВходящиеСчета = Перечисления.СтатусОплатыСчета.НеОплачен;
					
				Иначе
					
					ОбластьСтрока.Параметры.ОплатаВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Статус;
					
				КонецЕсли;
				
			КонецЕсли;
			
			СуммаБезНДСИтогоИсходящиеСчета = СуммаБезНДСИтогоИсходящиеСчета + ВыборкаИсходящиеСчета[Индекс].СуммаБезНДССчета;
			СуммаБезНДСИтогоИсходящиеАкты = СуммаБезНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаБезНДСАкта;
			
			СуммаНДСИтогоИсходящиеСчета = СуммаНДСИтогоИсходящиеСчета + ВыборкаИсходящиеСчета[Индекс].СуммаНДССчета;
			СуммаНДСИтогоИсходящиеАкты = СуммаНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаНДСАкта;
			
			СуммаСНДСИтогоИсходящиеСчета = СуммаСНДСИтогоИсходящиеСчета + ВыборкаИсходящиеСчета[Индекс].СуммаСНДССчета;
			СуммаСНДСИтогоИсходящиеАкты = СуммаСНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаСНДСАкта;
			
			ТабДок.Вывести(ОбластьСтрока);
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	ИначеЕсли ВыборкаИсходящиеСчета.Количество() = ВыборкаВходящиеСчета.Количество() Тогда
		
		Пока Индекс < ВыборкаИсходящиеСчета.Количество() Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.ДокументИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Ссылка;
			ОбластьСтрока.Параметры.СчетИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Счет;
			
			Если ТипЗнч(ВыборкаИсходящиеСчета[Индекс].Ссылка) = Тип("Строка") Тогда
				
				ОбластьСтрока.Параметры.ДокументИсходящиеСчетаПредставление = "Наличный доход (" + ВыборкаИсходящиеСчета[Индекс].Ссылка + ")";
				ОбластьСтрока.Параметры.СчетИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Ссылка;
				
			Иначе
				
				Если ТипЗнч(ВыборкаИсходящиеСчета[Индекс].Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					
					ОбластьСтрока.Параметры.ДокументИсходящиеСчетаПредставление = "Акт покупателю №" + ВыборкаИсходящиеСчета[Индекс].Ссылка.Номер + " от " + Формат(ВыборкаИсходящиеСчета[Индекс].Ссылка.Дата,"ДФ=dd.MM.yy");
					
				ИначеЕсли ТипЗнч(ВыборкаИсходящиеСчета[Индекс].Ссылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
					
					ОбластьСтрока.Параметры.ДокументИсходящиеСчетаПредставление = "Отчет комитенту №" + ВыборкаИсходящиеСчета[Индекс].Ссылка.Номер + " от " + Формат(ВыборкаИсходящиеСчета[Индекс].Ссылка.Дата,"ДФ=dd.MM.yy");
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаИсходящиеСчета[Индекс].Счет) Тогда
					
					ОбластьСтрока.Параметры.СчетИсходящиеСчетаПредставление = "Счет покупателю №" + ВыборкаИсходящиеСчета[Индекс].Счет.Номер + " от " + Формат(ВыборкаИсходящиеСчета[Индекс].Счет.Дата,"ДФ=dd.MM.yy");
					ОбластьСтрока.Параметры.СчетИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Счет;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОбластьСтрока.Параметры.СуммаБезНДСИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].СуммаБезНДССчета;
			ОбластьСтрока.Параметры.СуммаБезНДСИсходящиеАкты = ВыборкаИсходящиеСчета[Индекс].СуммаБезНДСАкта;
			
			ОбластьСтрока.Параметры.СуммаНДСИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].СуммаНДССчета;
			ОбластьСтрока.Параметры.СуммаНДСИсходящиеАкты = ВыборкаИсходящиеСчета[Индекс].СуммаНДСАкта;
			
			ОбластьСтрока.Параметры.СуммаСНДСИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].СуммаСНДССчета;
			ОбластьСтрока.Параметры.СуммаСНДСИсходящиеАкты = ВыборкаИсходящиеСчета[Индекс].СуммаСНДСАкта;
			
			Если ВыборкаИсходящиеСчета[Индекс].Статус = Null Тогда
				
				ОбластьСтрока.Параметры.ОплатаИсходящиеСчета = Перечисления.СтатусОплатыСчета.НеОплачен;
				
			Иначе
				
				ОбластьСтрока.Параметры.ОплатаИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Статус;
				
			КонецЕсли;
			
			Если ВыборкаВходящиеСчета[Индекс].Статус = Null Тогда
				
				ОбластьСтрока.Параметры.ОплатаВходящиеСчета = Перечисления.СтатусОплатыСчета.НеОплачен;
				
			Иначе
				
				ОбластьСтрока.Параметры.ОплатаВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Статус;
				
			КонецЕсли;
			
			Если ТипЗнч(ВыборкаВходящиеСчета[Индекс].Ссылка) = Тип("Строка") Тогда
				
				ОбластьСтрока.Параметры.ДокументВходящиеСчета = Док.Ссылка;
				ОбластьСтрока.Параметры.ДокументВходящиеСчетаПредставление = "Наличный расход (" + ВыборкаВходящиеСчета[Индекс].Ссылка + ")";
				
			Иначе
				
				Если ЗначениеЗаполнено(ВыборкаВходящиеСчета[Индекс].Ссылка) Тогда
					
					Если ТипЗнч(ВыборкаВходящиеСчета[Индекс].Ссылка) = Тип("ДокументСсылка.ОперацияБух") Тогда

						ОбластьСтрока.Параметры.ДокументВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Ссылка;
						ОбластьСтрока.Параметры.ДокументВходящиеСчетаПредставление = "Операция №" + ВыборкаВходящиеСчета[Индекс].Ссылка.Номер + " от " + Формат(ВыборкаВходящиеСчета[Индекс].Ссылка.Дата,"ДФ=dd.MM.yy");

					Иначе

						ОбластьСтрока.Параметры.ДокументВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Ссылка;
						ОбластьСтрока.Параметры.ДокументВходящиеСчетаПредставление = "Акт от поставщика №" + ВыборкаВходящиеСчета[Индекс].Ссылка.НомерВходящегоДокумента + " от " + Формат(ВыборкаВходящиеСчета[Индекс].Ссылка.ДатаВходящегоДокумента,"ДФ=dd.MM.yy");

					КонецЕсли;

				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаВходящиеСчета[Индекс].Счет) Тогда
					
					ОбластьСтрока.Параметры.СчетВходящиеСчетаПредставление = "Счет от поставщика №" + ВыборкаВходящиеСчета[Индекс].Счет.НомерВходящегоДокумента + " от " + Формат(ВыборкаВходящиеСчета[Индекс].Счет.ДатаВходящегоДокумента,"ДФ=dd.MM.yy");
					ОбластьСтрока.Параметры.СчетВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Счет;
					
				КонецЕсли;
				
			КонецЕсли; 
			
			ОбластьСтрока.Параметры.СуммаБезНДСВходящиеСчета = ВыборкаВходящиеСчета[Индекс].СуммаБезНДССчета;
			ОбластьСтрока.Параметры.СуммаБезНДСВходящиеАкты = ВыборкаВходящиеСчета[Индекс].СуммаБезНДСАкта;
			
			ОбластьСтрока.Параметры.СуммаНДСВходящиеСчета = ВыборкаВходящиеСчета[Индекс].СуммаНДССчета;
			ОбластьСтрока.Параметры.СуммаНДСВходящиеАкты = ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта;
			
			ОбластьСтрока.Параметры.СуммаСНДСВходящиеСчета = ВыборкаВходящиеСчета[Индекс].СуммаСНДССчета;
			ОбластьСтрока.Параметры.СуммаСНДСВходящиеАкты = ВыборкаВходящиеСчета[Индекс].СуммаСНДСАкта;
			
			СуммаБезНДСИтогоВходящиеСчета = СуммаБезНДСИтогоВходящиеСчета + ВыборкаВходящиеСчета[Индекс].СуммаБезНДССчета;
			СуммаБезНДСИтогоВходящиеАкты = СуммаБезНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаБезНДСАкта;
			
			СуммаНДСИтогоВходящиеСчета = СуммаНДСИтогоВходящиеСчета + ВыборкаВходящиеСчета[Индекс].СуммаНДССчета;
			СуммаНДСИтогоВходящиеАкты = СуммаНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта;  
			
			//Если ВыборкаВходящиеСчета[Индекс].СчетПеревыставляемый <> Null Тогда 
			//	
			//	Если ВыборкаВходящиеСчета[Индекс].СчетПеревыставляемый Тогда  
			//		
			//		СуммаНДСИтогоВходящиеСчетаПеревыставляемый = СуммаНДСИтогоВходящиеСчетаПеревыставляемый + ВыборкаВходящиеСчета[Индекс].СуммаНДССчета;
			//		
			//	Иначе
			//		
			//	КонецЕсли;  
			//	
			//КонецЕсли;
			//
			//Если ВыборкаВходящиеСчета[Индекс].АктПеревыставляемый <> Null Тогда  
			//	
			//	Если ВыборкаВходящиеСчета[Индекс].АктПеревыставляемый Тогда  
			//		
			//		СуммаНДСИтогоВходящиеАктыПеревыставляемый = СуммаНДСИтогоВходящиеАктыПеревыставляемый + ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта;
			//		
			//	Иначе
			//		
			//	КонецЕсли;
			//	
			//КонецЕсли;
			
			СуммаСНДСИтогоВходящиеСчета = СуммаСНДСИтогоВходящиеСчета + ВыборкаВходящиеСчета[Индекс].СуммаСНДССчета;
			СуммаСНДСИтогоВходящиеАкты = СуммаСНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаСНДСАкта;
			
			СуммаБезНДСИтогоИсходящиеСчета = СуммаБезНДСИтогоИсходящиеСчета + ВыборкаИсходящиеСчета[Индекс].СуммаБезНДССчета;
			СуммаБезНДСИтогоИсходящиеАкты = СуммаБезНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаБезНДСАкта;
			
			СуммаНДСИтогоИсходящиеСчета = СуммаНДСИтогоИсходящиеСчета + ВыборкаИсходящиеСчета[Индекс].СуммаНДССчета;
			СуммаНДСИтогоИсходящиеАкты = СуммаНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаНДСАкта;
			
			СуммаСНДСИтогоИсходящиеСчета = СуммаСНДСИтогоИсходящиеСчета + ВыборкаИсходящиеСчета[Индекс].СуммаСНДССчета;
			СуммаСНДСИтогоИсходящиеАкты = СуммаСНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаСНДСАкта;
			
			ТабДок.Вывести(ОбластьСтрока);
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	ИначеЕсли ВыборкаИсходящиеСчета.Количество() < ВыборкаВходящиеСчета.Количество() Тогда
		
		Пока Индекс < ВыборкаВходящиеСчета.Количество() Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка"); 
			
			Если ТипЗнч(ВыборкаВходящиеСчета[Индекс].Ссылка) = Тип("Строка") Тогда
				
				ОбластьСтрока.Параметры.ДокументВходящиеСчета = Док.Ссылка;
				ОбластьСтрока.Параметры.ДокументВходящиеСчетаПредставление = "Наличный расход (" + ВыборкаВходящиеСчета[Индекс].Ссылка + ")";
				
			Иначе
				
				Если ЗначениеЗаполнено(ВыборкаВходящиеСчета[Индекс].Ссылка) Тогда
					
					Если ТипЗнч(ВыборкаВходящиеСчета[Индекс].Ссылка) = Тип("ДокументСсылка.ОперацияБух") Тогда
						
						ОбластьСтрока.Параметры.ДокументВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Ссылка;
						ОбластьСтрока.Параметры.ДокументВходящиеСчетаПредставление = "Операция №" + ВыборкаВходящиеСчета[Индекс].Ссылка.Номер + " от " + Формат(ВыборкаВходящиеСчета[Индекс].Ссылка.Дата,"ДФ=dd.MM.yy");
						
					Иначе
					
						ОбластьСтрока.Параметры.ДокументВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Ссылка;
						ОбластьСтрока.Параметры.ДокументВходящиеСчетаПредставление = "Акт от поставщика №" + ВыборкаВходящиеСчета[Индекс].Ссылка.НомерВходящегоДокумента + " от " + Формат(ВыборкаВходящиеСчета[Индекс].Ссылка.ДатаВходящегоДокумента,"ДФ=dd.MM.yy");
					
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаВходящиеСчета[Индекс].Счет) Тогда
					
					ОбластьСтрока.Параметры.СчетВходящиеСчетаПредставление = "Счет от поставщика №" + ВыборкаВходящиеСчета[Индекс].Счет.НомерВходящегоДокумента + " от " + Формат(ВыборкаВходящиеСчета[Индекс].Счет.ДатаВходящегоДокумента,"ДФ=dd.MM.yy");
					ОбластьСтрока.Параметры.СчетВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Счет;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОбластьСтрока.Параметры.СуммаБезНДСВходящиеСчета = ВыборкаВходящиеСчета[Индекс].СуммаБезНДССчета;
			ОбластьСтрока.Параметры.СуммаБезНДСВходящиеАкты = ВыборкаВходящиеСчета[Индекс].СуммаБезНДСАкта;
			
			ОбластьСтрока.Параметры.СуммаНДСВходящиеСчета = ВыборкаВходящиеСчета[Индекс].СуммаНДССчета;
			ОбластьСтрока.Параметры.СуммаНДСВходящиеАкты = ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта;
			
			ОбластьСтрока.Параметры.СуммаСНДСВходящиеСчета = ВыборкаВходящиеСчета[Индекс].СуммаСНДССчета;
			ОбластьСтрока.Параметры.СуммаСНДСВходящиеАкты = ВыборкаВходящиеСчета[Индекс].СуммаСНДСАкта;
			
			Если Индекс < ВыборкаИсходящиеСчета.Количество() Тогда
				
				ОбластьСтрока.Параметры.ДокументИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Ссылка;
				ОбластьСтрока.Параметры.СчетИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Счет;
				
				Если ТипЗнч(ВыборкаИсходящиеСчета[Индекс].Ссылка) = Тип("Строка") Тогда
					
					ОбластьСтрока.Параметры.ДокументИсходящиеСчетаПредставление = "Наличный доход (" + ВыборкаИсходящиеСчета[Индекс].Ссылка + ")"; 
					ОбластьСтрока.Параметры.СчетИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Ссылка;
					
				Иначе
					
					Если ТипЗнч(ВыборкаИсходящиеСчета[Индекс].Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
						
						ОбластьСтрока.Параметры.ДокументИсходящиеСчетаПредставление = "Акт покупателю №" + ВыборкаИсходящиеСчета[Индекс].Ссылка.Номер + " от " + Формат(ВыборкаИсходящиеСчета[Индекс].Ссылка.Дата,"ДФ=dd.MM.yy");
						
					ИначеЕсли ТипЗнч(ВыборкаИсходящиеСчета[Индекс].Ссылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
						
						ОбластьСтрока.Параметры.ДокументИсходящиеСчетаПредставление = "Отчет комитенту №" + ВыборкаИсходящиеСчета[Индекс].Ссылка.Номер + " от " + Формат(ВыборкаИсходящиеСчета[Индекс].Ссылка.Дата,"ДФ=dd.MM.yy");
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВыборкаИсходящиеСчета[Индекс].Счет) Тогда
						
						ОбластьСтрока.Параметры.СчетИсходящиеСчетаПредставление = "Счет покупателю №" + ВыборкаИсходящиеСчета[Индекс].Счет.Номер + " от " + Формат(ВыборкаИсходящиеСчета[Индекс].Счет.Дата,"ДФ=dd.MM.yy");
						ОбластьСтрока.Параметры.СчетИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Счет;
						
					КонецЕсли;
					
				КонецЕсли;
				
				ОбластьСтрока.Параметры.СуммаБезНДСИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].СуммаБезНДССчета;
				ОбластьСтрока.Параметры.СуммаБезНДСИсходящиеАкты = ВыборкаИсходящиеСчета[Индекс].СуммаБезНДСАкта;
				
				ОбластьСтрока.Параметры.СуммаНДСИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].СуммаНДССчета;
				ОбластьСтрока.Параметры.СуммаНДСИсходящиеАкты = ВыборкаИсходящиеСчета[Индекс].СуммаНДСАкта;
				
				ОбластьСтрока.Параметры.СуммаСНДСИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].СуммаСНДССчета;
				ОбластьСтрока.Параметры.СуммаСНДСИсходящиеАкты = ВыборкаИсходящиеСчета[Индекс].СуммаСНДСАкта;
				
				Если ВыборкаИсходящиеСчета[Индекс].Статус = Null Тогда
					
					ОбластьСтрока.Параметры.ОплатаИсходящиеСчета = Перечисления.СтатусОплатыСчета.НеОплачен;
					
				Иначе
					
					ОбластьСтрока.Параметры.ОплатаИсходящиеСчета = ВыборкаИсходящиеСчета[Индекс].Статус;
					
				КонецЕсли;
				
				СуммаБезНДСИтогоИсходящиеСчета = СуммаБезНДСИтогоИсходящиеСчета + ВыборкаИсходящиеСчета[Индекс].СуммаБезНДССчета;
				СуммаБезНДСИтогоИсходящиеАкты = СуммаБезНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаБезНДСАкта;
				
				СуммаНДСИтогоИсходящиеСчета = СуммаНДСИтогоИсходящиеСчета + ВыборкаИсходящиеСчета[Индекс].СуммаНДССчета;
				СуммаНДСИтогоИсходящиеАкты = СуммаНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаНДСАкта;
				
				СуммаСНДСИтогоИсходящиеСчета = СуммаСНДСИтогоИсходящиеСчета + ВыборкаИсходящиеСчета[Индекс].СуммаСНДССчета;
				СуммаСНДСИтогоИсходящиеАкты = СуммаСНДСИтогоИсходящиеАкты + ВыборкаИсходящиеСчета[Индекс].СуммаСНДСАкта;
				
			КонецЕсли;
			
			Если ВыборкаВходящиеСчета[Индекс].Статус = Null Тогда
				
				ОбластьСтрока.Параметры.ОплатаВходящиеСчета = Перечисления.СтатусОплатыСчета.НеОплачен;
				
			Иначе
				
				ОбластьСтрока.Параметры.ОплатаВходящиеСчета = ВыборкаВходящиеСчета[Индекс].Статус;
				
			КонецЕсли;
			
			СуммаБезНДСИтогоВходящиеСчета = СуммаБезНДСИтогоВходящиеСчета + ВыборкаВходящиеСчета[Индекс].СуммаБезНДССчета;
			СуммаБезНДСИтогоВходящиеАкты = СуммаБезНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаБезНДСАкта;
			
			СуммаНДСИтогоВходящиеСчета = СуммаНДСИтогоВходящиеСчета + ВыборкаВходящиеСчета[Индекс].СуммаНДССчета;
			СуммаНДСИтогоВходящиеАкты = СуммаНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта; 
			
			
			//Если ВыборкаВходящиеСчета[Индекс].СчетПеревыставляемый <> Null Тогда 
			//	
			//	Если ВыборкаВходящиеСчета[Индекс].СчетПеревыставляемый Тогда  
			//		
			//		СуммаНДСИтогоВходящиеСчетаПеревыставляемый = СуммаНДСИтогоВходящиеСчетаПеревыставляемый + ВыборкаВходящиеСчета[Индекс].СуммаНДССчета;
			//		
			//	Иначе
			//		
			//	КонецЕсли;  
			//	
			//КонецЕсли;
			//
			//Если ВыборкаВходящиеСчета[Индекс].АктПеревыставляемый <> Null Тогда  
			//	
			//	Если ВыборкаВходящиеСчета[Индекс].АктПеревыставляемый Тогда  
			//		
			//		СуммаНДСИтогоВходящиеАктыПеревыставляемый = СуммаНДСИтогоВходящиеАктыПеревыставляемый + ВыборкаВходящиеСчета[Индекс].СуммаНДСАкта;
			//		
			//	Иначе
			//		
			//	КонецЕсли;
			//	
			//КонецЕсли;
			
			
			СуммаСНДСИтогоВходящиеСчета = СуммаСНДСИтогоВходящиеСчета + ВыборкаВходящиеСчета[Индекс].СуммаСНДССчета;
			СуммаСНДСИтогоВходящиеАкты = СуммаСНДСИтогоВходящиеАкты + ВыборкаВходящиеСчета[Индекс].СуммаСНДСАкта;
			
			ТабДок.Вывести(ОбластьСтрока);
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбластьИтогиТаблицы = Макет.ПолучитьОбласть("ИтогиТаблицы");
	
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаБезНДСИсходящиеСчета = СуммаБезНДСИтогоИсходящиеСчета;
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаБезНДСВходящиеСчета = СуммаБезНДСИтогоВходящиеСчета;
	
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаНДСИсходящиеСчета = СуммаНДСИтогоИсходящиеСчета;
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаНДСВходящиеСчета = СуммаНДСИтогоВходящиеСчета;
	
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаСНДСИсходящиеСчета = СуммаСНДСИтогоИсходящиеСчета;
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаСНДСВходящиеСчета = СуммаСНДСИтогоВходящиеСчета;
	
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаБезНДСИсходящиеАкты = СуммаБезНДСИтогоИсходящиеАкты;
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаБезНДСВходящиеАкты = СуммаБезНДСИтогоВходящиеАкты; 
	
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаНДСИсходящиеАкты = СуммаНДСИтогоИсходящиеАкты;
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаНДСВходящиеАкты = СуммаНДСИтогоВходящиеАкты; 
	
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаСНДСИсходящиеАкты = СуммаСНДСИтогоИсходящиеАкты;
	ОбластьИтогиТаблицы.Параметры.ИтогоСуммаСНДСВходящиеАкты = СуммаСНДСИтогоВходящиеАкты;
	
	
	ТабДок.Вывести(ОбластьИтогиТаблицы);
	
	ПониженнаяСтавка = УчетНДС.ПрименяетсяПониженнаяСтавкаНДС(Док.Организация, ТекущаяДата());
	
	Если ПониженнаяСтавка Тогда
		ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалУпрощенка");  
	Иначе	
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");  
	КонецЕсли;
	
	ВычитатьНДСВходящийПеревыставляемый = Константы.ВычитатьПолнуюСуммуВходящихСНДСИзПрофитаБезНДС.Получить();
	
	//+ Получение Исходящих НДС 
	
	РасчетПрофитаСделокСервер.ПолучитьНДСИсходящие(СтруктураНДСИсходящие, Док);
	
	//+ Получение Входящего НДС по перевыставляемым позициям
	СуммаНДСИтогоВходящиеСчетаПеревыставляемый = 0;
	СуммаНДСИтогоВходящиеАктыПеревыставляемый = 0;
	
	ТЗ = ВыборкаВходящиеСчета.Скопировать(,"Ссылка");
	АктыВходящие = ТЗ.СкопироватьКолонки("Ссылка");
	
	Для каждого стрТЗ из ТЗ Цикл
		
		Если ТипЗнч(стрТЗ.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			
			стрАктыВходящие = АктыВходящие.Добавить();
			стрАктыВходящие.Ссылка = стрТЗ.Ссылка;
			
			
		КонецЕсли;
		
	КонецЦикла;	 
	
	АктыВходящие.Свернуть("Ссылка");
	
	
	ТЗ.Очистить();
	ТЗ = ВыборкаВходящиеСчета.Скопировать(,"Счет");
	СчетаВходящие = ТЗ.СкопироватьКолонки("Счет");
	
	Для каждого стрТЗ из ТЗ Цикл
		
		Если ТипЗнч(стрТЗ.Счет) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			
			стрСчетаВходящие = СчетаВходящие.Добавить();
			стрСчетаВходящие.Счет = стрТЗ.Счет;
			
			
		КонецЕсли;
		
	КонецЦикла;	 
	
	СчетаВходящие.Свернуть("Счет");
	
	ТЗ.Очистить();
	
	//- Получение Входящего НДС по перевыставляемым позициям
	РасчетПрофитаСделокСервер.ПолучитьНДСВходящиеПеревыставляемые(АктыВходящие,СчетаВходящие,СуммаНДСИтогоВходящиеАктыПеревыставляемый,СуммаНДСИтогоВходящиеСчетаПеревыставляемый,СтруктураНДСВходящие);
	
	//ОбщаяСитемаНалогообложения = УчетНДС.ПрименяетсяОбщаяСтавкаНДС(Док.Организация, ТекущаяДата());
	
	//Если СуммаНДСИтогоИсходящиеАкты = 0 Тогда
	//	
	//	ОбластьПодвал.Параметры.ПрофитБезНДСПоСчетам = СуммаБезНДСИтогоИсходящиеСчета - СуммаСНДСИтогоВходящиеСчета;
	//	ОбластьПодвал.Параметры.ПрофитСНДСПоСчетам =  СуммаСНДСИтогоИсходящиеСчета - СуммаСНДСИтогоВходящиеСчета + СруктураНДСВходящие.СчетВходящийНеПеревыставляемыйНДС;// СуммаНДСИтогоВходящиеСчета;
	//	
	//	ОбластьПодвал.Параметры.ПрофитБезНДСПоАктам = СуммаБезНДСИтогоИсходящиеАкты - СуммаСНДСИтогоВходящиеАкты;  // Разница в расчетах
	//	ОбластьПодвал.Параметры.ПрофитСНДСПоАктам = СуммаСНДСИтогоИсходящиеАкты - СуммаСНДСИтогоВходящиеАкты + СруктураНДСВходящие.АктВходящийНеПеревыставляемыйНДС; //СуммаНДСИтогоВходящиеАкты;
	//	
	//	
	//Иначе   
	//	
	//	ОбластьПодвал.Параметры.ПрофитБезНДСПоСчетам = СуммаБезНДСИтогоИсходящиеСчета - СуммаБезНДСИтогоВходящиеСчета;
	//	ОбластьПодвал.Параметры.ПрофитСНДСПоСчетам =  СуммаСНДСИтогоИсходящиеСчета - СуммаСНДСИтогоВходящиеСчета;
	//	
	//	ОбластьПодвал.Параметры.ПрофитБезНДСПоАктам = СуммаБезНДСИтогоИсходящиеАкты - СуммаБезНДСИтогоВходящиеАкты;  // Разница в расчетах
	//	ОбластьПодвал.Параметры.ПрофитСНДСПоАктам = СуммаСНДСИтогоИсходящиеАкты - СуммаСНДСИтогоВходящиеАкты;
	//	
	//КонецЕсли;
	
	Если ПониженнаяСтавка Тогда  // для пониженной ставки НДС (5 и 7%)
		
		ОбластьПодвал.Параметры.ПрофитБезНДСПоАктам = СуммаСНДСИтогоИсходящиеАкты - СтруктураНДСИсходящие.АктИсходящийНеПеревыставляемыйНДС - СуммаСНДСИтогоВходящиеАкты;
		
		ОбластьПодвал.Параметры.ПрофитБезНДСПоСчетам = СуммаСНДСИтогоИсходящиеСчета - СтруктураНДСИсходящие.СчетИсходящийНеПеревыставляемыйНДС - СуммаСНДСИтогоВходящиеСчета;
		
	Иначе  // Если общая система налогообложения (20%)
		
		ОбластьПодвал.Параметры.ПрофитБезНДСПоАктам = СуммаБезНДСИтогоИсходящиеАкты - СуммаБезНДСИтогоВходящиеАкты;
		ОбластьПодвал.Параметры.ПрофитСНДСПоАктам = СуммаСНДСИтогоИсходящиеАкты - СуммаСНДСИтогоВходящиеАкты;
		
		ОбластьПодвал.Параметры.ПрофитБезНДСПоСчетам = СуммаБезНДСИтогоИсходящиеСчета - СуммаБезНДСИтогоВходящиеСчета;
		ОбластьПодвал.Параметры.ПрофитСНДСПоСчетам =  СуммаСНДСИтогоИсходящиеСчета - СуммаСНДСИтогоВходящиеСчета;
		
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции 

&НаСервере
Функция ЗаполнитьТабличныйДокументПрофитовСделок(ТабДок, МассивОбъектов)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Сделка.ПрофитыСделок");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	
	
	ТабДок.Вывести(ОбластьШапка);
	
	СуммаИтогоИсходящиеСчета = 0;
	СуммаИтогоВходящиеСчета = 0; 
	СуммаИтогоПрофит = 0;
	
	Для Каждого Док Из МассивОбъектов Цикл
		
		ЗапросИсходящиеСчета = Новый Запрос;
		ЗапросИсходящиеСчета.Текст = РасчетПрофитаСделокСервер.ТекстЗапросаИсходящиеСчета(); 	
		ЗапросИсходящиеСчета.УстановитьПараметр("Сделка", Док);
		
		ВыборкаИсходящиеСчета = ЗапросИсходящиеСчета.Выполнить().Выгрузить();
		
		ЗапросВходящиеСчета = Новый Запрос;
		ЗапросВходящиеСчета.Текст = РасчетПрофитаСделокСервер.ТекстЗапросаВходящиеСчета(); 	
		ЗапросВходящиеСчета.УстановитьПараметр("Сделка", Док);
		
		ВыборкаВходящиеСчета = ЗапросВходящиеСчета.Выполнить().Выгрузить();
		
		СуммаИсходящихСчетов = 0;
		
		Для Каждого СтрИсходящиеСчета Из ВыборкаИсходящиеСчета Цикл
			
			СуммаИсходящихСчетов = СуммаИсходящихСчетов + СтрИсходящиеСчета.Сумма;
			
		КонецЦикла; 
		
		СуммаВходящихСчетов = 0;
		
		Для Каждого СтрВходящиеСчета Из ВыборкаВходящиеСчета Цикл
			
			СуммаВходящихСчетов = СуммаВходящихСчетов + СтрВходящиеСчета.Сумма;
			
		КонецЦикла;
		
		Для Каждого СтрВнутренниеРасходы Из Док.ВнутренниеРасходы Цикл
			
			СуммаВходящихСчетов = СуммаВходящихСчетов + СтрВнутренниеРасходы.Сумма;
			
		КонецЦикла;
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		ОбластьСтрока.Параметры.Сделка = Док.Номер;
		ОбластьСтрока.Параметры.СделкаСсылка = Док.Ссылка;
		ОбластьСтрока.Параметры.ИсходящиеСчета = СуммаИсходящихСчетов;
		ОбластьСтрока.Параметры.ВходящиеСчета = СуммаВходящихСчетов;
		ОбластьСтрока.Параметры.Профит = СуммаИсходящихСчетов - СуммаВходящихСчетов;
		
		ТабДок.Вывести(ОбластьСтрока);
		
		СуммаИтогоИсходящиеСчета = СуммаИтогоИсходящиеСчета + СуммаИсходящихСчетов;
		СуммаИтогоВходящиеСчета = СуммаИтогоВходящиеСчета + СуммаВходящихСчетов; 
		СуммаИтогоПрофит = СуммаИтогоПрофит + СуммаИсходящихСчетов - СуммаВходящихСчетов;
		
	КонецЦикла;
	
	ОбластьИтогиТаблицы = Макет.ПолучитьОбласть("ИтогиТаблицы");
	
	ОбластьИтогиТаблицы.Параметры.ИтогоИсходящиеСчета = СуммаИтогоИсходящиеСчета;
	ОбластьИтогиТаблицы.Параметры.ИтогоВходящиеСчета = СуммаИтогоВходящиеСчета;
	ОбластьИтогиТаблицы.Параметры.ИтогоПрофит = СуммаИтогоПрофит;
	
	ТабДок.Вывести(ОбластьИтогиТаблицы);
	
	Возврат ТабДок;
	
КонецФункции  

//&НаСервере
//Функция ТекстЗапросаИсходящиеСчета()
//	
//	ТекстЗапроса = 
//	
//	"ВЫБРАТЬ
//	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки
//	|ПОМЕСТИТЬ Вт_ОтборВидСделки
//	|ИЗ
//	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки,
//	|	ДанныеДляРасчетаПрофитаСделки.Номенклатура КАК Номенклатура
//	|ПОМЕСТИТЬ Вт_ОтборНоменклатура
//	|ИЗ
//	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
//	|	СУММА(ВЫБОР
//	|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|						ТОГДА СчетНаОплатуПокупателюТовары.Сумма
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|								ТОГДА 0
//	|							ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ) КАК СуммаБезНДССчета,
//	|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
//	|	СУММА(ВЫБОР
//	|			КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|				ТОГДА СчетНаОплатуПокупателюТовары.СуммаНДС
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|						ТОГДА 0
//	|					ИНАЧЕ СчетНаОплатуПокупателюТовары.СуммаНДС
//	|				КОНЕЦ
//	|		КОНЕЦ) КАК СуммаНДССчета,
//	|	СУММА(ВЫБОР
//	|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА СчетНаОплатуПокупателюТовары.Сумма
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|						ТОГДА СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|								ТОГДА 0
//	|							ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ) КАК СуммаСНДССчета
//	|ПОМЕСТИТЬ ВТ_СчетаПокупателям
//	|ИЗ
//	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
//	|		ПО СчетНаОплатуПокупателюТовары.Ссылка.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
//	|		ПО СчетНаОплатуПокупателюТовары.Ссылка.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
//	|			И СчетНаОплатуПокупателюТовары.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
//	|ГДЕ
//	|	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
//	|	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	СчетНаОплатуПокупателюТовары.Ссылка,
//	|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВложенныйЗапрос.Акт КАК Акт,
//	|	СУММА(ВЫБОР
//	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА ВложенныйЗапрос.СуммаБезНДСАкта
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
//	|		КОНЕЦ) КАК СуммаБезНДСАкта,
//	|	ВложенныйЗапрос.Сделка КАК Сделка,
//	|	ВложенныйЗапрос.Счет КАК Счет,
//	|	СУММА(ВЫБОР
//	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА ВложенныйЗапрос.СуммаНДСАкта
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
//	|		КОНЕЦ) КАК СуммаНДСАкта,
//	|	СУММА(ВЫБОР
//	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА ВложенныйЗапрос.СуммаСНДСАкта
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
//	|		КОНЕЦ) КАК СуммаСНДСАкта
//	|ПОМЕСТИТЬ ВТ_Реализации
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		РеализацияТоваровУслугТовары.Ссылка КАК Акт,
//	|		СУММА(ВЫБОР
//	|				КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
//	|				ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
//	|			КОНЕЦ) КАК СуммаБезНДСАкта,
//	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
//	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
//	|		СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
//	|		СУММА(ВЫБОР
//	|				КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА РеализацияТоваровУслугТовары.Сумма
//	|				ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
//	|			КОНЕЦ) КАК СуммаСНДСАкта,
//	|		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
//	|		ИСТИНА КАК ОтборПоВидуСделки
//	|	ИЗ
//	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
//	|	ГДЕ
//	|		РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
//	|		И РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		РеализацияТоваровУслугТовары.Ссылка,
//	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|		РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|		РеализацияТоваровУслугТовары.Номенклатура
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		РеализацияТоваровУслугУслуги.Ссылка,
//	|		СУММА(ВЫБОР
//	|				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
//	|				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
//	|			КОНЕЦ),
//	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|		СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
//	|		СУММА(ВЫБОР
//	|				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА РеализацияТоваровУслугУслуги.Сумма
//	|				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
//	|			КОНЕЦ),
//	|		РеализацияТоваровУслугУслуги.Номенклатура,
//	|		ИСТИНА
//	|	ИЗ
//	|		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
//	|	ГДЕ
//	|		РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
//	|		И РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		РеализацияТоваровУслугУслуги.Ссылка,
//	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|		РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|		РеализацияТоваровУслугУслуги.Номенклатура
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
//	|		СУММА(ВЫБОР
//	|				КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
//	|				ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
//	|			КОНЕЦ),
//	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|		СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
//	|		СУММА(ВЫБОР
//	|				КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
//	|				ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
//	|			КОНЕЦ),
//	|		РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
//	|		ИСТИНА
//	|	ИЗ
//	|		Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
//	|	ГДЕ
//	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
//	|		И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
//	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|		РеализацияТоваровУслугАгентскиеУслуги.Номенклатура
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		СделкаВнутренниеДоходы.НаименованиеДохода,
//	|		СУММА(СделкаВнутренниеДоходы.Сумма),
//	|		СделкаВнутренниеДоходы.Ссылка,
//	|		СделкаВнутренниеДоходы.Ссылка,
//	|		0,
//	|		СделкаВнутренниеДоходы.Сумма,
//	|		NULL,
//	|		ЛОЖЬ
//	|	ИЗ
//	|		Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
//	|	ГДЕ
//	|		СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
//	|		И СделкаВнутренниеДоходы.Ссылка = &Сделка
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		СделкаВнутренниеДоходы.НаименованиеДохода,
//	|		СделкаВнутренниеДоходы.Сумма,
//	|		СделкаВнутренниеДоходы.Ссылка,
//	|		СделкаВнутренниеДоходы.Ссылка
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ОтчетКомитентуОПродажахТовары.Ссылка,
//	|		СУММА(ВЫБОР
//	|				КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
//	|				ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
//	|			КОНЕЦ),
//	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
//	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
//	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
//	|		СУММА(ВЫБОР
//	|				КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
//	|				ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
//	|			КОНЕЦ),
//	|		ОтчетКомитентуОПродажахТовары.Номенклатура,
//	|		ИСТИНА
//	|	ИЗ
//	|		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
//	|	ГДЕ
//	|		ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
//	|		И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка = &Сделка
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
//	|		ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
//	|		ОтчетКомитентуОПродажахТовары.Ссылка,
//	|		ОтчетКомитентуОПродажахТовары.Номенклатура) КАК ВложенныйЗапрос
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
//	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
//	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
//	|			И ВложенныйЗапрос.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВложенныйЗапрос.Акт,
//	|	ВложенныйЗапрос.Сделка,
//	|	ВложенныйЗапрос.Счет
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет) КАК Счет,
//	|	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка) КАК Сделка,
//	|	ВТ_Реализации.Акт КАК Акт,
//	|	СУММА(ВТ_Реализации.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
//	|	СУММА(ВТ_Реализации.СуммаНДСАкта) КАК СуммаНДСАкта,
//	|	СУММА(ВТ_Реализации.СуммаСНДСАкта) КАК СуммаСНДСАкта,
//	|	СУММА(ВТ_СчетаПокупателям.СуммаБезНДССчета) КАК СуммаБезНДССчета,
//	|	СУММА(ВТ_СчетаПокупателям.СуммаНДССчета) КАК СуммаНДССчета,
//	|	СУММА(ВТ_СчетаПокупателям.СуммаСНДССчета) КАК СуммаСНДССчета
//	|ПОМЕСТИТЬ ВТ_Исходящие
//	|ИЗ
//	|	ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
//	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
//	|		ПО ВТ_СчетаПокупателям.Сделка = ВТ_Реализации.Сделка
//	|			И ВТ_СчетаПокупателям.Счет = ВТ_Реализации.Счет
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет),
//	|	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка),
//	|	ВТ_Реализации.Акт
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Исходящие.Счет КАК Счет,
//	|	ВТ_Исходящие.Акт КАК Ссылка,
//	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
//	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
//	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
//	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
//	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
//	|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
//	|	СтатусыДокументов.Статус КАК Статус,
//	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО
//	|ИЗ
//	|	ВТ_Исходящие КАК ВТ_Исходящие
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
//	|		ПО ВТ_Исходящие.Счет = СтатусыДокументов.Документ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
//	|		ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВТ_Исходящие.Акт.Ссылка)
//	|ГДЕ
//	|	(СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО ЕСТЬ NULL
//	|			ИЛИ СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован))
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_Исходящие.Счет,
//	|	ВТ_Исходящие.Акт,
//	|	СтатусыДокументов.Статус,
//	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Счет";
//		
////	"ВЫБРАТЬ
////|	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
////|	СУММА(ВЫБОР
////|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
////|			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
////|		КОНЕЦ) КАК СуммаБезНДССчета,
////|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
////|	СУММА(СчетНаОплатуПокупателюТовары.СуммаНДС) КАК СуммаНДССчета,
////|	СУММА(ВЫБОР
////|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма
////|			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
////|		КОНЕЦ) КАК СуммаСНДССчета
////|ПОМЕСТИТЬ ВТ_СчетаПокупателям
////|ИЗ
////|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
////|ГДЕ
////|	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
////|	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
////|	И СчетНаОплатуПокупателюТовары.Номенклатура <> &Номенклатура
////|	И НЕ(СчетНаОплатуПокупателюТовары.Ссылка.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
////|				И СчетНаОплатуПокупателюТовары.Номенклатура.Наименование = ""Таможенные платежи"")
////|
////|СГРУППИРОВАТЬ ПО
////|	СчетНаОплатуПокупателюТовары.Ссылка,
////|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка
////|;
////|
////|////////////////////////////////////////////////////////////////////////////////
////|ВЫБРАТЬ
////|	РеализацияТоваровУслугТовары.Ссылка КАК Акт,
////|	СУММА(ВЫБОР
////|			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
////|			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
////|		КОНЕЦ) КАК СуммаБезНДСАкта,
////|	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
////|	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
////|	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
////|	СУММА(ВЫБОР
////|			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА РеализацияТоваровУслугТовары.Сумма
////|			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
////|		КОНЕЦ) КАК СуммаСНДСАкта 
////|		ПОМЕСТИТЬ ВТ_Реализации
////|ИЗ
////|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
////|ГДЕ
////|	РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
////|	И РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
////|	И РеализацияТоваровУслугТовары.Номенклатура <> &Номенклатура
////|	И НЕ(РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
////|				И РеализацияТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи"")
////|
////|СГРУППИРОВАТЬ ПО
////|	РеализацияТоваровУслугТовары.Ссылка,
////|	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
////|	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка
////|
////|ОБЪЕДИНИТЬ ВСЕ
////|
////|ВЫБРАТЬ
////|	РеализацияТоваровУслугУслуги.Ссылка,
////|	СУММА(ВЫБОР
////|			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
////|			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
////|		КОНЕЦ),
////|	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
////|	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
////|	СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
////|	СУММА(ВЫБОР
////|			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА РеализацияТоваровУслугУслуги.Сумма
////|			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
////|		КОНЕЦ)
////|ИЗ
////|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
////|ГДЕ
////|	РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
////|	И РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
////|	И РеализацияТоваровУслугУслуги.Номенклатура <> &Номенклатура 
////|	И НЕ (РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование) 
////|    И РеализацияТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи"")
////|    
////|СГРУППИРОВАТЬ ПО
////|	РеализацияТоваровУслугУслуги.Ссылка,
////|	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
////|	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
////|
////|ОБЪЕДИНИТЬ ВСЕ
////|
////|ВЫБРАТЬ
////|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
////|	СУММА(ВЫБОР
////|			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
////|			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
////|		КОНЕЦ),
////|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
////|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
////|	СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
////|	СУММА(ВЫБОР
////|			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
////|			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
////|		КОНЕЦ)
////|ИЗ
////|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
////|ГДЕ
////|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
////|	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
////|	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура <> &Номенклатура
////|	И НЕ (РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование) 
////|	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи"")
////|
////|СГРУППИРОВАТЬ ПО
////|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
////|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
////|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка
////|
////|ОБЪЕДИНИТЬ ВСЕ
////|
////|ВЫБРАТЬ
////|	СделкаВнутренниеДоходы.НаименованиеДохода,
////|	СУММА(СделкаВнутренниеДоходы.Сумма),
////|	СделкаВнутренниеДоходы.Ссылка,
////|	СделкаВнутренниеДоходы.Ссылка,
////|	0,
////|	СделкаВнутренниеДоходы.Сумма
////|ИЗ
////|	Документ.Сделка.ВнутренниеДоходы КАК СделкаВнутренниеДоходы
////|ГДЕ
////|	СделкаВнутренниеДоходы.Ссылка.Проведен = ИСТИНА
////|	И СделкаВнутренниеДоходы.Ссылка = &Сделка
////|
////|СГРУППИРОВАТЬ ПО
////|	СделкаВнутренниеДоходы.НаименованиеДохода,
////|	СделкаВнутренниеДоходы.Сумма,
////|	СделкаВнутренниеДоходы.Ссылка,
////|	СделкаВнутренниеДоходы.Ссылка
////|
////|ОБЪЕДИНИТЬ ВСЕ
////|
////|ВЫБРАТЬ
////|	ОтчетКомитентуОПродажахТовары.Ссылка,
////|	СУММА(ВЫБОР
////|			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
////|			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
////|		КОНЕЦ),
////|	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
////|	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
////|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
////|	СУММА(ВЫБОР
////|			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
////|			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
////|		КОНЕЦ)
////|ИЗ
////|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
////|ГДЕ
////|	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
////|	И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка = &Сделка
////|	И ОтчетКомитентуОПродажахТовары.Номенклатура <> &Номенклатура     
////|	И НЕ (ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование) 
////|	И ОтчетКомитентуОПродажахТовары.Номенклатура.Наименование = ""Таможенные платежи"")
////|
////|СГРУППИРОВАТЬ ПО
////|	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
////|	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
////|	ОтчетКомитентуОПродажахТовары.Ссылка   
////|	;
////|
////|////////////////////////////////////////////////////////////////////////////////
////|ВЫБРАТЬ
////|	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет) КАК Счет,
////|	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка) КАК Сделка,
////|	ВТ_Реализации.Акт КАК Акт,
////|	СУММА(ВТ_Реализации.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
////|	СУММА(ВТ_Реализации.СуммаНДСАкта) КАК СуммаНДСАкта,
////|	СУММА(ВТ_Реализации.СуммаСНДСАкта) КАК СуммаСНДСАкта,
////|	СУММА(ВТ_СчетаПокупателям.СуммаБезНДССчета) КАК СуммаБезНДССчета,
////|	СУММА(ВТ_СчетаПокупателям.СуммаНДССчета) КАК СуммаНДССчета,
////|	СУММА(ВТ_СчетаПокупателям.СуммаСНДССчета) КАК СуммаСНДССчета
////|ПОМЕСТИТЬ ВТ_Исходящие
////|ИЗ
////|	ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
////|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
////|		ПО ВТ_СчетаПокупателям.Сделка = ВТ_Реализации.Сделка
////|			И ВТ_СчетаПокупателям.Счет = ВТ_Реализации.Счет
////|
////|СГРУППИРОВАТЬ ПО
////|	ЕСТЬNULL(ВТ_СчетаПокупателям.Счет, ВТ_Реализации.Счет),
////|	ЕСТЬNULL(ВТ_СчетаПокупателям.Сделка, ВТ_Реализации.Сделка),
////|	ВТ_Реализации.Акт
////|;
////|
////|////////////////////////////////////////////////////////////////////////////////
////|ВЫБРАТЬ
////|	ВТ_Исходящие.Счет КАК Счет,
////|	ВТ_Исходящие.Акт КАК Ссылка,
////|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
////|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
////|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
////|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
////|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
////|	СУММА(ЕСТЬNULL(ВТ_Исходящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
////|	СтатусыДокументов.Статус КАК Статус,
////|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО,
////|	ВТ_Исходящие.Сделка.Вид КАК СделкаВид
////|ИЗ
////|	ВТ_Исходящие КАК ВТ_Исходящие
////|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
////|		ПО ВТ_Исходящие.Счет = СтатусыДокументов.Документ
////|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
////|		ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВТ_Исходящие.Акт.Ссылка)
////|ГДЕ
////|	(СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО ЕСТЬ NULL
////|			ИЛИ СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован))
////|
////|СГРУППИРОВАТЬ ПО
////|	ВТ_Исходящие.Счет,
////|	ВТ_Исходящие.Акт,
////|	СтатусыДокументов.Статус,
////|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО,
////|	ВТ_Исходящие.Сделка.Вид
////|
////|УПОРЯДОЧИТЬ ПО
////|	Счет";
//	
//	Возврат ТекстЗапроса;	
//	
//КонецФункции   

//&НаСервере
//Функция ТекстЗапросаВходящиеСчета()

//	ТекстЗапроса =  	
//	"ВЫБРАТЬ
//	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки
//	|ПОМЕСТИТЬ Вт_ОтборВидСделки
//	|ИЗ
//	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ДанныеДляРасчетаПрофитаСделки.ВидСделки КАК ВидСделки,
//	|	ДанныеДляРасчетаПрофитаСделки.Номенклатура КАК Номенклатура
//	|ПОМЕСТИТЬ Вт_ОтборНоменклатура
//	|ИЗ
//	|	РегистрСведений.ДанныеДляРасчетаПрофитаСделки КАК ДанныеДляРасчетаПрофитаСделки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Счет,
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК Сделка,
//	|	СУММА(ВЫБОР
//	|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|						ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|								ТОГДА 0
//	|							ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ) КАК СуммаБезНДССчета,
//	|	СУММА(ВЫБОР
//	|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|						ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|								ТОГДА 0
//	|							ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ) КАК СуммаНДССчета,
//	|	СУММА(ВЫБОР
//	|			КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|				ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|						ТОГДА 0
//	|					ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения
//	|				КОНЕЦ
//	|		КОНЕЦ) КАК СуммаСНДССчета,
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка.Вид КАК СделкаВид
//	|ПОМЕСТИТЬ ВТ_СчетаПоставщиков
//	|ИЗ
//	|	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
//	|			ПО СчетНаОплатуПоставщикаТовары.Ссылка.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
//	|			ПО СчетНаОплатуПоставщикаТовары.Ссылка.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
//	|				И СчетНаОплатуПоставщикаТовары.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
//	|		ПО СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения
//	|			И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка
//	|ГДЕ
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
//	|	И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
//	|	И СчетНаОплатуПоставщикаТовары.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка,
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка,
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка.Вид
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВложенныйЗапрос.Акт КАК Акт,
//	|	СУММА(ВЫБОР
//	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА ВложенныйЗапрос.СуммаБезНДСАкта
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВложенныйЗапрос.СуммаБезНДСАкта
//	|		КОНЕЦ) КАК СуммаБезНДСАкта,
//	|	ВложенныйЗапрос.Счет КАК Счет,
//	|	ВложенныйЗапрос.Сделка КАК Сделка,
//	|	СУММА(ВЫБОР
//	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА ВложенныйЗапрос.СуммаНДСАкта
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВложенныйЗапрос.СуммаНДСАкта
//	|		КОНЕЦ) КАК СуммаНДСАкта,
//	|	СУММА(ВЫБОР
//	|			КОГДА ВложенныйЗапрос.ОтборПоВидуСделки
//	|				ТОГДА ВЫБОР
//	|						КОГДА Вт_ОтборВидСделки.ВидСделки ЕСТЬ NULL
//	|							ТОГДА ВложенныйЗапрос.СуммаСНДСАкта
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА Вт_ОтборНоменклатура.Номенклатура ЕСТЬ NULL
//	|									ТОГДА 0
//	|								ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВложенныйЗапрос.СуммаСНДСАкта
//	|		КОНЕЦ) КАК СуммаСНДСАкта
//	|ПОМЕСТИТЬ ВТ_Поступления
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Акт,
//	|		СУММА(ВЫБОР
//	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА ВЫБОР
//	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
//	|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
//	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
//	|							ИНАЧЕ ВЫБОР
//	|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
//	|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
//	|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
//	|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
//	|								КОНЕЦ
//	|						КОНЕЦ
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
//	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
//	|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
//	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
//	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			КОНЕЦ) КАК СуммаБезНДСАкта,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика КАК Счет,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
//	|		СУММА(ВЫБОР
//	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
//	|				ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
//	|			КОНЕЦ) КАК СуммаНДСАкта,
//	|		СУММА(ВЫБОР
//	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
//	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
//	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
//	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
//	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
//	|					КОНЕЦ
//	|			КОНЕЦ) КАК СуммаСНДСАкта,
//	|		ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
//	|		ИСТИНА КАК ОтборПоВидуСделки
//	|	ИЗ
//	|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
//	|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
//	|				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
//	|	ГДЕ
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
//	|		И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка = &Сделка
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика,
//	|		ПоступлениеТоваровУслугУслуги.Номенклатура
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		СделкаВнутренниеРасходы.НаименованиеРасхода,
//	|		СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
//	|		NULL,
//	|		СделкаВнутренниеРасходы.Ссылка,
//	|		0,
//	|		СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
//	|		NULL,
//	|		ЛОЖЬ
//	|	ИЗ
//	|		Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
//	|	ГДЕ
//	|		СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
//	|		И СделкаВнутренниеРасходы.Ссылка = &Сделка
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		СделкаВнутренниеРасходы.НаименованиеРасхода,
//	|		СделкаВнутренниеРасходы.Ссылка
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
//	|		СУММА(ВЫБОР
//	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА ВЫБОР
//	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
//	|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
//	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
//	|							ИНАЧЕ ВЫБОР
//	|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
//	|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
//	|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
//	|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
//	|								КОНЕЦ
//	|						КОНЕЦ
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
//	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
//	|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
//	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
//	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			КОНЕЦ),
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
//	|		СУММА(ВЫБОР
//	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
//	|				ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
//	|			КОНЕЦ),
//	|		СУММА(ВЫБОР
//	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
//	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
//	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
//	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
//	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
//	|					КОНЕЦ
//	|			КОНЕЦ),
//	|		ПоступлениеТоваровУслугТовары.Номенклатура,
//	|		ИСТИНА
//	|	ИЗ
//	|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
//	|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
//	|				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
//	|	ГДЕ
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
//	|		И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
//	|		ПоступлениеТоваровУслугТовары.Номенклатура
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
//	|		СУММА(ВЫБОР
//	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА ВЫБОР
//	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
//	|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
//	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
//	|							ИНАЧЕ ВЫБОР
//	|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
//	|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
//	|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
//	|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
//	|								КОНЕЦ
//	|						КОНЕЦ
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
//	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
//	|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
//	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
//	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			КОНЕЦ),
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
//	|		СУММА(ВЫБОР
//	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|					ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
//	|				ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
//	|			КОНЕЦ),
//	|		СУММА(ВЫБОР
//	|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
//	|						ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
//	|					ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
//	|				ИНАЧЕ ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
//	|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
//	|						ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
//	|					КОНЕЦ
//	|			КОНЕЦ),
//	|		ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура,
//	|		ИСТИНА
//	|	ИЗ
//	|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
//	|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
//	|				И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
//	|	ГДЕ
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
//	|		И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка = &Сделка
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
//	|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
//	|		ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ОперацияБух.Ссылка,
//	|		ХозрасчетныйДвиженияССубконто.Сумма,
//	|		NULL,
//	|		ОперацияБух.Сделка.Ссылка,
//	|		ХозрасчетныйДвиженияССубконто.Сумма,
//	|		ХозрасчетныйДвиженияССубконто.Сумма,
//	|		NULL,
//	|		ИСТИНА
//	|	ИЗ
//	|		РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК ХозрасчетныйДвиженияССубконто
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияБух КАК ОперацияБух
//	|			ПО ХозрасчетныйДвиженияССубконто.Регистратор = ОперацияБух.Ссылка
//	|	ГДЕ
//	|		ОперацияБух.Сделка = &Сделка) КАК ВложенныйЗапрос
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборВидСделки КАК Вт_ОтборВидСделки
//	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборВидСделки.ВидСделки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОтборНоменклатура КАК Вт_ОтборНоменклатура
//	|		ПО ВложенныйЗапрос.Сделка.Вид = Вт_ОтборНоменклатура.ВидСделки
//	|			И ВложенныйЗапрос.Номенклатура = Вт_ОтборНоменклатура.Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВложенныйЗапрос.Акт,
//	|	ВложенныйЗапрос.Счет,
//	|	ВложенныйЗапрос.Сделка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_СчетаПоставщиков.Счет КАК Счет,
//	|	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка) КАК Сделка,
//	|	ВТ_Поступления.Акт КАК Акт,
//	|	СУММА(ВТ_Поступления.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
//	|	СУММА(ВТ_Поступления.СуммаНДСАкта) КАК СуммаНДСАкта,
//	|	СУММА(ВТ_Поступления.СуммаСНДСАкта) КАК СуммаСНДСАкта,
//	|	СУММА(ВТ_СчетаПоставщиков.СуммаБезНДССчета) КАК СуммаБезНДССчета,
//	|	СУММА(ВТ_СчетаПоставщиков.СуммаНДССчета) КАК СуммаНДССчета,
//	|	СУММА(ВТ_СчетаПоставщиков.СуммаСНДССчета) КАК СуммаСНДССчета
//	|ПОМЕСТИТЬ ВТ_Входящие
//	|ИЗ
//	|	ВТ_Поступления КАК ВТ_Поступления
//	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
//	|		ПО ВТ_Поступления.Счет = ВТ_СчетаПоставщиков.Счет
//	|			И ВТ_Поступления.Сделка = ВТ_СчетаПоставщиков.Сделка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_СчетаПоставщиков.Счет,
//	|	ВТ_Поступления.Акт,
//	|	ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Входящие.Счет КАК Счет,
//	|	ВТ_Входящие.Акт КАК Ссылка,
//	|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
//	|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
//	|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
//	|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
//	|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
//	|	СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
//	|	СтатусыДокументов.Статус КАК Статус,
//	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО,
//	|	ВТ_Входящие.Сделка.Вид.Ссылка КАК СделкаВидСсылка,
//	|	ВТ_Входящие.Акт.Представление КАК Представление
//	|ИЗ
//	|	ВТ_Входящие КАК ВТ_Входящие
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
//	|		ПО ВТ_Входящие.Счет = СтатусыДокументов.Документ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
//	|		ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВТ_Входящие.Акт.Ссылка)
//	|ГДЕ
//	|	(СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО ЕСТЬ NULL
//	|			ИЛИ СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован))
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_Входящие.Счет,
//	|	ВТ_Входящие.Акт,
//	|	СтатусыДокументов.Статус,
//	|	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО,
//	|	ВТ_Входящие.Сделка.Вид.Ссылка,
//	|	ВТ_Входящие.Акт.Представление";
//	
////	"ВЫБРАТЬ
////|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Счет,
////|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК Сделка,
////|	СУММА(ВЫБОР
////|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
////|			ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
////|		КОНЕЦ) КАК СуммаБезНДССчета,
////|	СУММА(ВЫБОР
////|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|				ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
////|			ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
////|		КОНЕЦ) КАК СуммаНДССчета,
////|	СУММА(СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения) КАК СуммаСНДССчета    	
////|	ПОМЕСТИТЬ ВТ_СчетаПоставщиков 	
////|ИЗ
////|	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
////|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
////|		ПО (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения)
////|			И (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка)
////|ГДЕ
////|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
////|	И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
////|	И СчетНаОплатуПоставщикаТовары.Номенклатура <> &Номенклатура   	
////|	И НЕ(СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование) 
////|	И СчетНаОплатуПоставщикаТовары.Номенклатура.Наименование = ""Таможенные платежи"")
////|СГРУППИРОВАТЬ ПО
////|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка,
////|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка    
////|	;                                                               
////|	
////|	////////////////////////////////////////////////////////////////////////////////
////|	ВЫБРАТЬ
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Акт,
////|		СУММА(ВЫБОР
////|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
////|					ТОГДА ВЫБОР
////|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
////|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
////|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
////|							ИНАЧЕ ВЫБОР
////|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
////|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
////|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
////|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
////|								КОНЕЦ
////|						КОНЕЦ
////|				ИНАЧЕ ВЫБОР
////|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
////|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
////|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
////|						ИНАЧЕ ВЫБОР
////|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
////|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
////|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
////|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
////|							КОНЕЦ
////|					КОНЕЦ
////|			КОНЕЦ) КАК СуммаБезНДСАкта,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика КАК Счет,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка,
////|		СУММА(ВЫБОР
////|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
////|					ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
////|				ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
////|			КОНЕЦ) КАК СуммаНДСАкта,
////|		СУММА(ВЫБОР
////|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
////|					ТОГДА ВЫБОР
////|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
////|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
////|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
////|							ИНАЧЕ ВЫБОР
////|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
////|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
////|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
////|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
////|								КОНЕЦ
////|						КОНЕЦ
////|				ИНАЧЕ ВЫБОР
////|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
////|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
////|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
////|						ИНАЧЕ ВЫБОР
////|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
////|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
////|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
////|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
////|							КОНЕЦ
////|					КОНЕЦ
////|			КОНЕЦ) КАК СуммаСНДСАкта 						
////|	ПОМЕСТИТЬ ВТ_Поступления   		
////|	ИЗ
////|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
////|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
////|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
////|				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
////|	ГДЕ
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.Проведен = ИСТИНА
////|		И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка = &Сделка
////|		И ПоступлениеТоваровУслугУслуги.Номенклатура <> &Номенклатура
////|		И НЕ(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование) 
////|		И ПоступлениеТоваровУслугУслуги.Номенклатура.Наименование = ""Таможенные платежи"") 	
////|	СГРУППИРОВАТЬ ПО
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СчетНаОплатуПоставщика
////|	
////|	ОБЪЕДИНИТЬ ВСЕ
////|	
////|	ВЫБРАТЬ
////|		СделкаВнутренниеРасходы.НаименованиеРасхода,
////|		СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0)),
////|		NULL,
////|		СделкаВнутренниеРасходы.Ссылка,
////|		0,
////|		СУММА(ЕСТЬNULL(СделкаВнутренниеРасходы.Сумма, 0))
////|	ИЗ
////|		Документ.Сделка.ВнутренниеРасходы КАК СделкаВнутренниеРасходы
////|	ГДЕ
////|		СделкаВнутренниеРасходы.Ссылка.Проведен = ИСТИНА
////|		И СделкаВнутренниеРасходы.Ссылка = &Сделка
////|	
////|	СГРУППИРОВАТЬ ПО
////|		СделкаВнутренниеРасходы.НаименованиеРасхода,
////|		СделкаВнутренниеРасходы.Ссылка
////|	
////|	ОБЪЕДИНИТЬ ВСЕ
////|	
////|	ВЫБРАТЬ
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
////|		СУММА(ВЫБОР
////|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|					ТОГДА ВЫБОР
////|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
////|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
////|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
////|							ИНАЧЕ ВЫБОР
////|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
////|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
////|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
////|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
////|								КОНЕЦ
////|						КОНЕЦ
////|				ИНАЧЕ ВЫБОР
////|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
////|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
////|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
////|						ИНАЧЕ ВЫБОР
////|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
////|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
////|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
////|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
////|							КОНЕЦ
////|					КОНЕЦ
////|			КОНЕЦ),
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
////|		СУММА(ВЫБОР
////|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|					ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
////|				ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
////|			КОНЕЦ),
////|		СУММА(ВЫБОР
////|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
////|					ТОГДА ВЫБОР
////|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
////|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
////|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
////|							ИНАЧЕ ВЫБОР
////|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
////|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
////|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
////|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
////|								КОНЕЦ
////|						КОНЕЦ
////|				ИНАЧЕ ВЫБОР
////|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
////|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
////|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
////|						ИНАЧЕ ВЫБОР
////|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
////|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
////|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
////|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
////|							КОНЕЦ
////|					КОНЕЦ
////|			КОНЕЦ)
////|	ИЗ
////|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
////|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
////|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
////|				И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
////|	ГДЕ
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.Проведен = ИСТИНА
////|		И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка = &Сделка
////|		И ПоступлениеТоваровУслугТовары.Номенклатура <> &Номенклатура    
////|		И НЕ(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
////|			И ПоступлениеТоваровУслугТовары.Номенклатура.Наименование = ""Таможенные платежи"")
////|	
////|	СГРУППИРОВАТЬ ПО
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СчетНаОплатуПоставщика
////|	
////|	ОБЪЕДИНИТЬ ВСЕ
////|	
////|	ВЫБРАТЬ
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
////|		СУММА(ВЫБОР
////|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
////|					ТОГДА ВЫБОР
////|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
////|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
////|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
////|							ИНАЧЕ ВЫБОР
////|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
////|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
////|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
////|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
////|								КОНЕЦ
////|						КОНЕЦ
////|				ИНАЧЕ ВЫБОР
////|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
////|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
////|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
////|						ИНАЧЕ ВЫБОР
////|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
////|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
////|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
////|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
////|							КОНЕЦ
////|					КОНЕЦ
////|			КОНЕЦ),
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
////|		СУММА(ВЫБОР
////|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
////|					ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
////|				ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
////|			КОНЕЦ),
////|		СУММА(ВЫБОР
////|				КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
////|					ТОГДА ВЫБОР
////|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
////|									ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
////|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
////|							ИНАЧЕ ВЫБОР
////|									КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
////|											ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
////|										ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
////|									ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
////|								КОНЕЦ
////|						КОНЕЦ
////|				ИНАЧЕ ВЫБОР
////|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
////|								ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
////|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
////|						ИНАЧЕ ВЫБОР
////|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
////|										ИЛИ ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
////|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
////|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
////|							КОНЕЦ
////|					КОНЕЦ
////|			КОНЕЦ)
////|	ИЗ
////|		Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
////|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
////|			ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
////|				И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
////|	ГДЕ
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
////|		И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка = &Сделка
////|		И ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура <> &Номенклатура  
////|		И НЕ(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Декларирование)
////|		И ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура.Наименование = ""Таможенные платежи"")
////|	
////|	СГРУППИРОВАТЬ ПО
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка,
////|		ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СчетНаОплатуПоставщика 
////|			;
////|	
////|	////////////////////////////////////////////////////////////////////////////////
////|	ВЫБРАТЬ
////|		ВТ_СчетаПоставщиков.Счет КАК Счет,
////|		ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка) КАК Сделка,
////|		ВТ_Поступления.Акт КАК Акт,
////|		СУММА(ВТ_Поступления.СуммаБезНДСАкта) КАК СуммаБезНДСАкта,
////|		СУММА(ВТ_Поступления.СуммаНДСАкта) КАК СуммаНДСАкта,
////|		СУММА(ВТ_Поступления.СуммаСНДСАкта) КАК СуммаСНДСАкта,
////|		СУММА(ВТ_СчетаПоставщиков.СуммаБезНДССчета) КАК СуммаБезНДССчета,
////|		СУММА(ВТ_СчетаПоставщиков.СуммаНДССчета) КАК СуммаНДССчета,
////|		СУММА(ВТ_СчетаПоставщиков.СуммаСНДССчета) КАК СуммаСНДССчета
////|	ПОМЕСТИТЬ ВТ_Входящие
////|	ИЗ
////|		ВТ_Поступления КАК ВТ_Поступления
////|			ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
////|			ПО ВТ_Поступления.Счет = ВТ_СчетаПоставщиков.Счет
////|				И ВТ_Поступления.Сделка = ВТ_СчетаПоставщиков.Сделка
////|	
////|	СГРУППИРОВАТЬ ПО
////|		ВТ_СчетаПоставщиков.Счет,
////|		ВТ_Поступления.Акт,
////|		ЕСТЬNULL(ВТ_СчетаПоставщиков.Сделка, ВТ_Поступления.Сделка)
////|	;
////|	
////|	////////////////////////////////////////////////////////////////////////////////
////|	ВЫБРАТЬ
////|		ВТ_Входящие.Счет КАК Счет,
////|		ВТ_Входящие.Акт КАК Ссылка,
////|		СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДСАкта, 0)) КАК СуммаБезНДСАкта,
////|		СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДСАкта, 0)) КАК СуммаНДСАкта,
////|		СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДСАкта, 0)) КАК СуммаСНДСАкта,
////|		СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаБезНДССчета, 0)) КАК СуммаБезНДССчета,
////|		СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаНДССчета, 0)) КАК СуммаНДССчета,
////|		СУММА(ЕСТЬNULL(ВТ_Входящие.СуммаСНДССчета, 0)) КАК СуммаСНДССчета,
////|		СтатусыДокументов.Статус КАК Статус,
////|		СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО
////|	ИЗ
////|		ВТ_Входящие КАК ВТ_Входящие
////|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
////|			ПО (ВТ_Входящие.Счет = СтатусыДокументов.Документ)
////|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
////|			ПО (СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = ВТ_Входящие.Акт.Ссылка)
////|	ГДЕ
////|		(СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО ЕСТЬ NULL
////|				ИЛИ СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован))
////|	
////|	СГРУППИРОВАТЬ ПО
////|		ВТ_Входящие.Счет,
////|		ВТ_Входящие.Акт,
////|		СтатусыДокументов.Статус,
////|		СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО";
//	
//	Возврат ТекстЗапроса;	
//	
//КонецФункции

//&НаСервере
//Процедура ПолучитьНДСИсходящие(СтруктураНДСИсходящие,Сделка, Номенклатура1)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	СчетНаОплатуПокупателюТовары.Ссылка КАК Счет,
//	|	СУММА(ВЫБОР
//	|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаНДС
//	|			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма
//	|		КОНЕЦ) КАК СуммаБезНДССчета,
//	|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка КАК Сделка,
//	|	СУММА(СчетНаОплатуПокупателюТовары.СуммаНДС) КАК СуммаНДССчета,
//	|	СУММА(ВЫБОР
//	|			КОГДА СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма
//	|			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
//	|		КОНЕЦ) КАК СуммаСНДССчета,
//	|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура
//	|ПОМЕСТИТЬ ВТ_СчетаПокупателям
//	|ИЗ
//	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
//	|ГДЕ
//	|	СчетНаОплатуПокупателюТовары.Ссылка.Проведен = ИСТИНА
//	|	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
//	|	И СчетНаОплатуПокупателюТовары.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	СчетНаОплатуПокупателюТовары.Ссылка,
//	|	СчетНаОплатуПокупателюТовары.Ссылка.Сделка,
//	|	СчетНаОплатуПокупателюТовары.Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РеализацияТоваровУслугТовары.Ссылка КАК Акт,
//	|	СУММА(ВЫБОР
//	|			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
//	|			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
//	|		КОНЕЦ) КАК СуммаБезНДСАкта,
//	|	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка КАК Сделка,
//	|	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка КАК Счет,
//	|	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДСАкта,
//	|	СУММА(ВЫБОР
//	|			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА РеализацияТоваровУслугТовары.Сумма
//	|			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
//	|		КОНЕЦ) КАК СуммаСНДСАкта,
//	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
//	|ПОМЕСТИТЬ ВТ_Реализации
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
//	|ГДЕ
//	|	РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
//	|	И РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
//	|	И РеализацияТоваровУслугТовары.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РеализацияТоваровУслугТовары.Ссылка,
//	|	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|	РеализацияТоваровУслугТовары.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|	РеализацияТоваровУслугТовары.Номенклатура
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	РеализацияТоваровУслугУслуги.Ссылка,
//	|	СУММА(ВЫБОР
//	|			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
//	|			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
//	|		КОНЕЦ),
//	|	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|	СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
//	|	СУММА(ВЫБОР
//	|			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА РеализацияТоваровУслугУслуги.Сумма
//	|			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
//	|		КОНЕЦ),
//	|	РеализацияТоваровУслугУслуги.Номенклатура
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
//	|ГДЕ
//	|	РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
//	|	И РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
//	|	И РеализацияТоваровУслугУслуги.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РеализацияТоваровУслугУслуги.Ссылка,
//	|	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|	РеализацияТоваровУслугУслуги.Номенклатура
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
//	|	СУММА(ВЫБОР
//	|			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
//	|			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
//	|		КОНЕЦ),
//	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|	СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
//	|	СУММА(ВЫБОР
//	|			КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
//	|			ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
//	|		КОНЕЦ),
//	|	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
//	|ГДЕ
//	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
//	|	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка = &Сделка
//	|	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
//	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Сделка,
//	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю.Ссылка,
//	|	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ОтчетКомитентуОПродажахТовары.Ссылка,
//	|	СУММА(ВЫБОР
//	|			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
//	|			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
//	|		КОНЕЦ),
//	|	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
//	|	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
//	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС),
//	|	СУММА(ВЫБОР
//	|			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
//	|			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
//	|		КОНЕЦ),
//	|	ОтчетКомитентуОПродажахТовары.Номенклатура
//	|ИЗ
//	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
//	|ГДЕ
//	|	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
//	|	И ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка = &Сделка
//	|	И ОтчетКомитентуОПродажахТовары.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование.Сделка,
//	|	ОтчетКомитентуОПродажахТовары.Ссылка.ДокументОснование,
//	|	ОтчетКомитентуОПродажахТовары.Ссылка,
//	|	ОтчетКомитентуОПродажахТовары.Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_СчетаПокупателям.Счет КАК Счет,
//	|	ВТ_СчетаПокупателям.Сделка КАК Сделка,
//	|	ВТ_СчетаПокупателям.Номенклатура КАК Номенклатура,
//	|	ВТ_СчетаПокупателям.СуммаБезНДССчета КАК СуммаБезНДССчета,
//	|	ВТ_СчетаПокупателям.СуммаНДССчета КАК СуммаНДССчета,
//	|	ВТ_СчетаПокупателям.СуммаСНДССчета КАК СуммаСНДССчета,
//	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
//	|ПОМЕСТИТЬ ВТ_СчетаПокупателямПеревыставляемый
//	|ИЗ
//	|	ВТ_СчетаПокупателям КАК ВТ_СчетаПокупателям
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
//	|		ПО (ВидыРасходовСделки.Номенклатура = ВТ_СчетаПокупателям.Номенклатура)
//	|			И (ВидыРасходовСделки.ВидСделки = ВТ_СчетаПокупателям.Сделка.Вид)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Реализации.Акт КАК Акт,
//	|	ВТ_Реализации.Сделка КАК Сделка,
//	|	ВТ_Реализации.Счет КАК Счет,
//	|	ВТ_Реализации.Номенклатура КАК Номенклатура,
//	|	ВТ_Реализации.СуммаБезНДСАкта КАК СуммаБезНДСАкта,
//	|	ВТ_Реализации.СуммаНДСАкта КАК СуммаНДСАкта,
//	|	ВТ_Реализации.СуммаСНДСАкта КАК СуммаСНДСАкта,
//	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
//	|ПОМЕСТИТЬ ВТ_АктыПеревыставляемый
//	|ИЗ
//	|	ВТ_Реализации КАК ВТ_Реализации
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
//	|		ПО (ВТ_Реализации.Номенклатура = ВидыРасходовСделки.Номенклатура)
//	|			И (ВТ_Реализации.Сделка.Вид = ВидыРасходовСделки.ВидСделки)
//	|";
//	
//	Запрос.УстановитьПараметр("Сделка", Сделка);
//	Запрос.УстановитьПараметр("Номенклатура",Номенклатура1); 
//	
//	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
//	
//	ТЗ_СчетаИсходящие = Результат[2].Выгрузить();
//	ТЗ_АктыИсходящие =  Результат[3].Выгрузить();   
//	
//	Если ТЗ_СчетаИсходящие.Количество() > 0 Тогда
//		
//		Для каждого стрТЗ_СчетаИсходящие из ТЗ_СчетаИсходящие Цикл  
//			
//			Если стрТЗ_СчетаИсходящие.Перевыставляемый Тогда
//				
//				СтруктураНДСИсходящие.СчетИсходящийПеревыставляемыйНДС = СтруктураНДСИсходящие.СчетИсходящийПеревыставляемыйНДС + стрТЗ_СчетаИсходящие.СуммаНДССчета;
//				
//			Иначе
//				
//				СтруктураНДСИсходящие.СчетИсходящийНеПеревыставляемыйНДС = СтруктураНДСИсходящие.СчетИсходящийНеПеревыставляемыйНДС + стрТЗ_СчетаИсходящие.СуммаНДССчета;	
//				
//			КонецЕсли; 
//			
//			СтруктураНДСИсходящие.СчетИсходящийВсегоНДС   = СтруктураНДСИсходящие.СчетИсходящийВсегоНДС + стрТЗ_СчетаИсходящие.СуммаНДССчета;
//			
//		КонецЦикла;	
//		
//	КонецЕсли;	
//	
//	Если ТЗ_АктыИсходящие.Количество() > 0 Тогда
//		
//		Для каждого стрТЗ_АктыИсходящие из ТЗ_АктыИсходящие Цикл
//			
//			Если  стрТЗ_АктыИсходящие.Перевыставляемый Тогда
//				
//				СтруктураНДСИсходящие.АктИсходящийПеревыставляемыйНДС = СтруктураНДСИсходящие.АктИсходящийПеревыставляемыйНДС + стрТЗ_АктыИсходящие.СуммаНДСАкта;
//				
//			Иначе	
//				
//				СтруктураНДСИсходящие.АктИсходящийНеПеревыставляемыйНДС = СтруктураНДСИсходящие.АктИсходящийНеПеревыставляемыйНДС + стрТЗ_АктыИсходящие.СуммаНДСАкта;
//				
//			КонецЕсли; 
//			
//			СтруктураНДСИсходящие.АктИсходящийВсегоНДС = СтруктураНДСИсходящие.АктИсходящийВсегоНДС + стрТЗ_АктыИсходящие.СуммаНДСАкта;
//			
//			
//		КонецЦикла;	
//		
//	КонецЕсли;
//	
//	а="";
//	
//	
//	
//КонецПроцедуры 

//&НаСервере
//Процедура ПолучитьНДСВходящиеПеревыставляемые(АктыВходящие,СчетаВходящие,СуммаНДСИтогоВходящиеАктыПеревыставляемый,СуммаНДСИтогоВходящиеСчетаПеревыставляемый,
//	Номенклатура1,НоменклатураВозмещаемыеРасходы,СтруктураНДСВходящие)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка КАК Счет,
//	|	СУММА(ВЫБОР
//	|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
//	|			ИНАЧЕ СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения - СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
//	|		КОНЕЦ) КАК СуммаБезНДССчета,
//	|	СУММА(ВЫБОР
//	|			КОГДА СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / СчетНаОплатуПоставщикаТовары.Сумма)
//	|			ИНАЧЕ СчетНаОплатуПоставщикаТовары.СуммаНДС * (СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (СчетНаОплатуПоставщикаТовары.Сумма + СчетНаОплатуПоставщикаТовары.СуммаНДС))
//	|		КОНЕЦ) КАК СуммаНДССчета,
//	|	СчетНаОплатуПоставщикаТовары.Номенклатура КАК Номенклатура,
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка КАК Сделка
//	|ПОМЕСТИТЬ ВТ_СчетаПоставщиков
//	|ИЗ
//	|	Документ.СчетНаОплатуПоставщика.РаспределениеСуммПоСделкамТовары КАК СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
//	|		ПО СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.КлючСвязи = СчетНаОплатуПоставщикаТовары.КлючСвязиРаспределения
//	|			И СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка
//	|ГДЕ
//	|	СчетНаОплатуПоставщикаТовары.Ссылка В(&СчетаВходящие)
//	|	И СчетНаОплатуПоставщикаТовары.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Ссылка,
//	|	СчетНаОплатуПоставщикаТовары.Номенклатура,
//	|	СчетНаОплатуПоставщикаРаспределениеСуммПоСделкамТовары.Сделка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка КАК Акт,
//	|	СУММА(ВЫБОР
//	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
//	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
//	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
//	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
//	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
//	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
//	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
//	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
//	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
//	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0) - ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ) КАК СуммаБезНДСАкта,
//	|	СУММА(ВЫБОР
//	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / ПоступлениеТоваровУслугУслуги.Сумма)
//	|			ИНАЧЕ ПоступлениеТоваровУслугУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения / (ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС))
//	|		КОНЕЦ) КАК СуммаНДСАкта,
//	|	СУММА(ВЫБОР
//	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
//	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
//	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
//	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
//	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> 0
//	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов <> NULL
//	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КратностьВзаиморасчетов, 0)
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> 0
//	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов <> NULL
//	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка.КурсВзаиморасчетов, 0)
//	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.СуммаРаспределения, 0)
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ) КАК СуммаСНДСАкта,
//	|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка КАК Сделка
//	|ПОМЕСТИТЬ ВТ_Поступления
//	|ИЗ
//	|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкам
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
//	|		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.КлючСвязи = ПоступлениеТоваровУслугУслуги.КлючСвязиРаспределения
//	|			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
//	|ГДЕ
//	|	ПоступлениеТоваровУслугУслуги.Ссылка В(&АктыВходящие)
//	|	И ПоступлениеТоваровУслугУслуги.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Ссылка,
//	|	ПоступлениеТоваровУслугУслуги.Номенклатура,
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкам.Сделка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
//	|	СУММА(ВЫБОР
//	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
//	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
//	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
//	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
//	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
//	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
//	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
//	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
//	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
//	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0) - ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ),
//	|	СУММА(ВЫБОР
//	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / ПоступлениеТоваровУслугТовары.Сумма)
//	|			ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения / (ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС))
//	|		КОНЕЦ),
//	|	СУММА(ВЫБОР
//	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
//	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
//	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
//	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
//	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> 0
//	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов <> NULL
//	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КратностьВзаиморасчетов, 0)
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> 0
//	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов <> NULL
//	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка.КурсВзаиморасчетов, 0)
//	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.СуммаРаспределения, 0)
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ),
//	|	ПоступлениеТоваровУслугТовары.Номенклатура,
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка
//	|ИЗ
//	|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамТовары КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
//	|		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.КлючСвязи = ПоступлениеТоваровУслугТовары.КлючСвязиРаспределения
//	|			И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
//	|ГДЕ
//	|	ПоступлениеТоваровУслугТовары.Ссылка В(&АктыВходящие)
//	|	И ПоступлениеТоваровУслугТовары.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Ссылка,
//	|	ПоступлениеТоваровУслугТовары.Номенклатура,
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамТовары.Сделка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
//	|	СУММА(ВЫБОР
//	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
//	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
//	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
//	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
//	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
//	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
//	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
//	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
//	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
//	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0) - ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ),
//	|	СУММА(ВЫБОР
//	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / ПоступлениеТоваровУслугАгентскиеУслуги.Сумма)
//	|			ИНАЧЕ ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС * (ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения / (ПоступлениеТоваровУслугАгентскиеУслуги.Сумма + ПоступлениеТоваровУслугАгентскиеУслуги.СуммаНДС))
//	|		КОНЕЦ),
//	|	СУММА(ВЫБОР
//	|			КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
//	|				ТОГДА ВЫБОР
//	|						КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
//	|								И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
//	|							ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
//	|						ИНАЧЕ ВЫБОР
//	|								КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
//	|										И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
//	|									ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
//	|								ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
//	|							КОНЕЦ
//	|					КОНЕЦ
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> 0
//	|							И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов <> NULL
//	|						ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов, 0)
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> 0
//	|									И ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов <> NULL
//	|								ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения * ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка.КурсВзаиморасчетов, 0)
//	|							ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.СуммаРаспределения, 0)
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ),
//	|	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура,
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка
//	|ИЗ
//	|	Документ.ПоступлениеТоваровУслуг.РаспределениеСуммПоСделкамАгентскиеУслуги КАК ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
//	|		ПО ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.КлючСвязи = ПоступлениеТоваровУслугАгентскиеУслуги.КлючСвязиРаспределения
//	|			И (ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка = ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка)
//	|ГДЕ
//	|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка В(&АктыВходящие)
//	|	И ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура <> &Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Ссылка,
//	|	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура,
//	|	ПоступлениеТоваровУслугРаспределениеСуммПоСделкамАгентскиеУслуги.Сделка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_СчетаПоставщиков.Счет КАК Счет,
//	|	ВТ_СчетаПоставщиков.СуммаБезНДССчета КАК СуммаБезНДССчета,
//	|	ВТ_СчетаПоставщиков.СуммаНДССчета КАК СуммаНДССчета,
//	|	ВТ_СчетаПоставщиков.Номенклатура КАК Номенклатура,
//	|	ВТ_СчетаПоставщиков.Сделка КАК Сделка,
//	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
//	|ПОМЕСТИТЬ ВТ_СчетаВходящиеНДСПеревыставляемый
//	|ИЗ
//	|	ВТ_СчетаПоставщиков КАК ВТ_СчетаПоставщиков
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
//	|		ПО (ВидыРасходовСделки.Номенклатура = ВТ_СчетаПоставщиков.Номенклатура)
//	|			И ВТ_СчетаПоставщиков.Сделка.Вид = ВидыРасходовСделки.ВидСделки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Поступления.Акт КАК Акт,
//	|	ВТ_Поступления.СуммаБезНДСАкта КАК СуммаБезНДСАкта,
//	|	ВТ_Поступления.СуммаНДСАкта КАК СуммаНДСАкта,
//	|	ВТ_Поступления.СуммаСНДСАкта КАК СуммаСНДСАкта,
//	|	ВТ_Поступления.Номенклатура КАК Номенклатура,
//	|	ВТ_Поступления.Сделка КАК Сделка,
//	|	ВидыРасходовСделки.Перевыставляемый КАК Перевыставляемый
//	|ПОМЕСТИТЬ ВТ_АктыВходящиеНДСПеревыставляемый
//	|ИЗ
//	|	ВТ_Поступления КАК ВТ_Поступления
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
//	|		ПО ВТ_Поступления.Номенклатура = ВидыРасходовСделки.Номенклатура
//	|			И (ВидыРасходовСделки.ВидСделки = ВТ_Поступления.Сделка.Вид)"; 
//	
//	Запрос.УстановитьПараметр("СчетаВходящие",СчетаВходящие);
//	Запрос.УстановитьПараметр("АктыВходящие",АктыВходящие);
//	Запрос.УстановитьПараметр("Номенклатура",Номенклатура1);
//	
//	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
//	
//	ТЗ_СчетаВходящие = Результат[2].Выгрузить();
//	ТЗ_АктыВходящие =  Результат[3].Выгрузить();
//	
//	Если ТЗ_СчетаВходящие.Количество() > 0 Тогда
//		
//		Для каждого стрТЗ_СчетаВходящие из ТЗ_СчетаВходящие Цикл  
//			
//			Если стрТЗ_СчетаВходящие.Перевыставляемый Тогда
//				
//				СуммаНДСИтогоВходящиеСчетаПеревыставляемый = СуммаНДСИтогоВходящиеСчетаПеревыставляемый + стрТЗ_СчетаВходящие.СуммаНДССчета; 
//				
//				СтруктураНДСВходящие.СчетВходящийПеревыставляемыйНДС = СтруктураНДСВходящие.СчетВходящийПеревыставляемыйНДС + стрТЗ_СчетаВходящие.СуммаНДССчета;
//				
//			Иначе
//				
//				СтруктураНДСВходящие.СчетВходящийНеПеревыставляемыйНДС = СтруктураНДСВходящие.СчетВходящийНеПеревыставляемыйНДС + стрТЗ_СчетаВходящие.СуммаНДССчета;
//				
//				
//			КонецЕсли; 
//			
//			СтруктураНДСВходящие.СчетВходящийВсегоНДС = СтруктураНДСВходящие.СчетВходящийВсегоНДС + стрТЗ_СчетаВходящие.СуммаНДССчета; 
//			
//		КонецЦикла;	
//		
//	КонецЕсли;	
//	
//	
//	Если ТЗ_АктыВходящие.Количество() > 0 Тогда 
//		
//		Для каждого стрТЗ_АктыВходящие из ТЗ_АктыВходящие Цикл 
//			
//			Если стрТЗ_АктыВходящие.Перевыставляемый Тогда
//				
//				СуммаНДСИтогоВходящиеАктыПеревыставляемый = СуммаНДСИтогоВходящиеАктыПеревыставляемый + стрТЗ_АктыВходящие.СуммаНДСАкта; 
//				
//				СтруктураНДСВходящие.АктВходящийПеревыставляемыйНДС = СтруктураНДСВходящие.АктВходящийПеревыставляемыйНДС + стрТЗ_АктыВходящие.СуммаНДСАкта;
//				
//			Иначе
//				
//				СтруктураНДСВходящие.АктВходящийНеПеревыставляемыйНДС = СтруктураНДСВходящие.АктВходящийНеПеревыставляемыйНДС + стрТЗ_АктыВходящие.СуммаНДСАкта;
//				
//			КонецЕсли; 
//			
//			СтруктураНДСВходящие.АктВходящийВсегоНДС	= СтруктураНДСВходящие.АктВходящийВсегоНДС + стрТЗ_АктыВходящие.СуммаНДСАкта;
//			
//		КонецЦикла;	
//		
//	КонецЕсли;
//	
//	
//	а="";
//КонецПроцедуры 



