
&НаКлиенте
Процедура ЛГС_ДокументОснованиеПриИзмененииПосле(Элемент) 
	
	УстановитьЗначенияСделокВСтроки();
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияСделокВСтроки()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Объект.РаспределениеСуммПоСделкамТовары.Очистить();
				
		Для Каждого Стр Из Объект.Товары Цикл
			
			Если НЕ ЗначениеЗаполнено(Стр.КлючСвязиРаспределения) Тогда
				
				Стр.КлючСвязиРаспределения = Стр.ПолучитьИдентификатор();
				
			КонецЕсли;
			
			СтрРаспределение = Объект.РаспределениеСуммПоСделкамТовары.Добавить();
			СтрРаспределение.КлючСвязи = Стр.КлючСвязиРаспределения;
			СтрРаспределение.Сделка = Объект.ДокументОснование;
			
			Если Объект.СуммаВключаетНДС Тогда
				
				СтрРаспределение.СуммаРаспределения = Стр.Сумма;
				
			Иначе
				
				СтрРаспределение.СуммаРаспределения = Стр.Сумма + Стр.СуммаНДС;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах()
	
	Для Каждого Стр Из Объект.Товары Цикл
		
		ПараметрыОтбора = Новый Структура("КлючСвязи", Стр.КлючСвязиРаспределения);
		
		НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ТекстовоеПредставление = "";
			
			Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
				
				Если ТекстовоеПредставление = "" Тогда
					
					ТекстовоеПредставление = ПолучитьНомерДокумента(СтрНайденнаяСтрока.Сделка) + " - " + Формат(СтрНайденнаяСтрока.СуммаРаспределения,"ЧДЦ=2; ЧГ=");	
					
				Иначе
					
					ТекстовоеПредставление = ТекстовоеПредставление + Символы.ПС + ПолучитьНомерДокумента(СтрНайденнаяСтрока.Сделка) + " - " + Формат(СтрНайденнаяСтрока.СуммаРаспределения,"ЧДЦ=2; ЧГ=");
					
				КонецЕсли;
				
			КонецЦикла;
			
			Стр.Сделки = ТекстовоеПредставление;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Для Каждого Стр ИЗ Объект.Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Сделки) Тогда
			
			Стр.Сделки = "не распределено";
			
		КонецЕсли;
		
	КонецЦикла;  
КонецПроцедуры 

&НаСервере
Функция ПолучитьНомерДокумента(Док)
	
	Возврат Док.Номер;
	
КонецФункции

&НаСервере
Процедура ЛГС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах();
	
	НЗ = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Для Каждого Запись Из НЗ Цикл
		
		ЭтотОбъект.Проверено = Запись.Проверено;
		ЭтотОбъект.Проверил = Запись.Проверил;
		
	КонецЦикла;
	
	Если ЛогистикаСервер.ЕстьРоль("ЛогистикаАдминистратор") тогда
		
		Элементы.Администратор.Видимость = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)

	Если Источник = ЭтаФорма.УникальныйИдентификатор Тогда
		
		Если ИмяСобытия = "ВыполненоРаспределениеСтрокиПоСделкамТовары" Тогда
			
			Для Каждого Стр Из Объект.РаспределениеСуммПоСделкамТовары Цикл
				
				ПараметрыОтбора = Новый Структура("КлючСвязи", Параметр.КлючСвязи);
				
				НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора);
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
						
						Объект.РаспределениеСуммПоСделкамТовары.Удалить(СтрНайденнаяСтрока);
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла; 
			
			Для Каждого Стр Из Параметр.МассивДобавляемыхСтрокРаспределения Цикл
				
				СтрРаспределение = Объект.РаспределениеСуммПоСделкамТовары.Добавить();
				СтрРаспределение.КлючСвязи = Параметр.КлючСвязи;
				СтрРаспределение.Сделка = Стр.Сделка;
				СтрРаспределение.СуммаРаспределения = Стр.Сумма;
				
			КонецЦикла;
			
			Для Каждого Стр Из Объект.Товары Цикл
				
				Если Стр.КлючСвязиРаспределения = Параметр.КлючСвязи Тогда
					
					Стр.Сделки = Параметр.ТекстовоеПредставление;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	Если Поле.Имя = "ТоварыСделки" Тогда
		
		Если НЕ ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения) Тогда
			
			Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
			
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("Номенклатура", Элементы.Товары.ТекущиеДанные.Номенклатура);
		ПараметрыФормы.Вставить("Сумма", ?(Объект.СуммаВключаетНДС, Элементы.Товары.ТекущиеДанные.Сумма, Элементы.Товары.ТекущиеДанные.Сумма + Элементы.Товары.ТекущиеДанные.СуммаНДС));
		ПараметрыФормы.Вставить("КлючСвязи", Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
		ПараметрыФормы.Вставить("ВидТЧ", "Товары");
		
		ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаРедактированияСуммПоСделкам", ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ЭтаФорма.Модифицированность = Истина;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыПередУдалениемПосле(Элемент, Отказ) 
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамТовары.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование) 
	
	Если НоваяСтрока Тогда
		
		МаксКлючСвязиРаспределения = -1;
		
		Для Каждого Стр Из Объект.Товары Цикл
			
			Если Стр.КлючСвязиРаспределения = "" Тогда
				
				Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения = Строка(МаксКлючСвязиРаспределения + 1);
				Элементы.Товары.ТекущиеДанные.Сделки = "не распределено";
				
			ИначеЕсли МаксКлючСвязиРаспределения < Число(Стр.КлючСвязиРаспределения) Тогда
				
				МаксКлючСвязиРаспределения = Число(Стр.КлючСвязиРаспределения);	
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если Копирование Тогда
		
		Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения = Строка(МаксКлючСвязиРаспределения + 1); 
		Элементы.Товары.ТекущиеДанные.Сделки = "не распределено";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЛГС_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи) 
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах(); 
	
	НЗ = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Объект.Ссылка);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		
		Для Каждого Запись Из НЗ Цикл
			
			Запись.Проверено = ЭтотОбъект.Проверено;
			Запись.Проверил = ЭтотОбъект.Проверил;
			
		КонецЦикла;
		
		НЗ.Записать();
		
	Иначе
		
		Если ЭтотОбъект.Проверено Тогда
			
			Запись = РегистрыСведений.СтатусыПроверкиДокументаПоступлениеТоваровИУслуг.СоздатьМенеджерЗаписи();
			Запись.Документ = Объект.Ссылка;
			Запись.Проверено = ЭтотОбъект.Проверено;
			Запись.Проверил = ЭтотОбъект.Проверил;
			Запись.Записать();  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыЦенаПриИзмененииПосле(Элемент) 
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамТовары.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах();

КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыСуммаПриИзмененииПосле(Элемент)
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамТовары.Удалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ТоварыКоличествоПриИзмененииПосле(Элемент)
	
	ПараметрыОтбора = Новый Структура("КлючСвязи", Элементы.Товары.ТекущиеДанные.КлючСвязиРаспределения);
	
	НайденныеСтроки = Объект.РаспределениеСуммПоСделкамТовары.НайтиСтроки(ПараметрыОтбора); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрНайденнаяСтрока ИЗ НайденныеСтроки Цикл
			
			Объект.РаспределениеСуммПоСделкамТоварыУдалить(СтрНайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьВизуальноеОтображениеРаспределенияПоСделкамВТоварах();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ПровереноПриИзмененииПосле(Элемент) 
	
	Если ЭтотОбъект.Проверено Тогда
		
		ЭтотОбъект.Проверил = ПользователиКлиентСервер.ТекущийПользователь();
		
	Иначе
		
		ЭтотОбъект.Проверил = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛГС_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	ЕстьНераспределенные =  РезультатПроверкиПозицийПоВидамСделок();
	
	Если ЕстьНераспределенные Тогда
		ПоказатьПредупреждение(,"Имеются нераспределенные позиции из Видов Расходов Сделки",,"Ошибка");
		Отказ = Истина;
	КонецЕсли; 
	
 КонецПроцедуры 
 
 &НаСервере
 Функция РезультатПроверкиПозицийПоВидамСделок()
	 
	 НаличиеНераспределено = Ложь;
	 
	 //Загрузка видов расходов сделок в ТЗ
	 Запрос = Новый Запрос;
	 Запрос.Текст = "
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВидыРасходовСделки.Номенклатура КАК Номенклатура
	 |ИЗ
	 |	РегистрСведений.ВидыРасходовСделки КАК ВидыРасходовСделки
	 |"; 
	 ВидыРасходов = Запрос.Выполнить().Выгрузить();
	 ВидыРасходов.Свернуть("Номенклатура"); 
	 
	//Проверяем ТЧ Товаты 
	НаличиеНераспределено = ЛогистикаСервер.ПолучитьРезультатПроверкиРаспределенные(Объект.Товары, Объект.РаспределениеСуммПоСделкамТовары, ВидыРасходов);  

  	Возврат НаличиеНераспределено;
		 
КонецФункции 

